{
    "paper_id": "D09-1066",
    "header": {
        "generated_with": "S2ORC 1.0.0",
        "date_generated": "2023-06-16T11:56:21.213138Z"
    },
    "title": "A Comparison of Windowless and Window-Based Computational Association Measures as Predictors of Syntagmatic Human Associations",
    "authors": [
        {
            "first": "Justin",
            "middle": [],
            "last": "Washtell",
            "suffix": "",
            "affiliation": {
                "laboratory": "",
                "institution": "University of Leeds",
                "location": {}
            },
            "email": "washtell@comp.leeds.ac.uk"
        },
        {
            "first": "Katja",
            "middle": [],
            "last": "Markert",
            "suffix": "",
            "affiliation": {
                "laboratory": "",
                "institution": "University of Leeds",
                "location": {}
            },
            "email": "markert@comp.leeds.ac.uk"
        }
    ],
    "year": "",
    "venue": null,
    "identifiers": {},
    "abstract": "Distance-based (windowless) word assocation measures have only very recently appeared in the NLP literature and their performance compared to existing windowed or frequency-based measures is largely unknown. We conduct a largescale empirical comparison of a variety of distance-based and frequency-based measures for the reproduction of syntagmatic human assocation norms. Overall, our results show an improvement in the predictive power of windowless over windowed measures. This provides support to some of the previously published theoretical advantages and makes windowless approaches a promising avenue to explore further. This study also serves as a first comparison of windowed methods across numerous human association datasets. During this comparison we also introduce some novel variations of window-based measures which perform as well as or better in the human association norm task than established measures.",
    "pdf_parse": {
        "paper_id": "D09-1066",
        "_pdf_hash": "",
        "abstract": [
            {
                "text": "Distance-based (windowless) word assocation measures have only very recently appeared in the NLP literature and their performance compared to existing windowed or frequency-based measures is largely unknown. We conduct a largescale empirical comparison of a variety of distance-based and frequency-based measures for the reproduction of syntagmatic human assocation norms. Overall, our results show an improvement in the predictive power of windowless over windowed measures. This provides support to some of the previously published theoretical advantages and makes windowless approaches a promising avenue to explore further. This study also serves as a first comparison of windowed methods across numerous human association datasets. During this comparison we also introduce some novel variations of window-based measures which perform as well as or better in the human association norm task than established measures.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Abstract",
                "sec_num": null
            }
        ],
        "body_text": [
            {
                "text": "Automatic discovery of semantically associated words has attracted a large amount of attention in the last decades and a host of computational association measures have been proposed to deal with this task (see Section 2). These measures traditionally rely on the co-ocurrence frequency of two words in a corpus to estimate a relatedness score. There has been a recent emergence of distancebased language modelling techiques in NLP (Savicki and Hlavacova, 2002; Terra and Clarke, 2004) in which the number of tokens separating words is the essential quantity. While some of this work has considered distance-based alternatives to conventional association measures (Hardcastle, 2005; Washtell, 2009) , there has been no principled empirical evaluation of these measures as predictors of human association. We remedy this by conducting a thorough comparison of a wide variety of frequency-based and distance-based measures as predictors of human association scores as elicited in several different free word association tasks.",
                "cite_spans": [
                    {
                        "start": 432,
                        "end": 461,
                        "text": "(Savicki and Hlavacova, 2002;",
                        "ref_id": "BIBREF20"
                    },
                    {
                        "start": 462,
                        "end": 485,
                        "text": "Terra and Clarke, 2004)",
                        "ref_id": "BIBREF21"
                    },
                    {
                        "start": 664,
                        "end": 682,
                        "text": "(Hardcastle, 2005;",
                        "ref_id": "BIBREF7"
                    },
                    {
                        "start": 683,
                        "end": 698,
                        "text": "Washtell, 2009)",
                        "ref_id": "BIBREF24"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "In this work we focus on first-order association measures as predictors of syntagmatic associations. This is in contrast to second and higher-order measures which are better predictors of paradigmatic associations, or word similarity. The distinction between syntagmatic and paradigmatic relationship types is neither exact nor mutually exclusive, and many paradigmatic relationships can be observed syntagmatically in the text. Roughly in keeping with (Rapp, 2002) , we hereby regard paradigmatic assocations as those based largely on word similarity (i.e. including those typically classed as synonyms, antonyms, hypernyms, hyponyms etc), whereas syntagmatic associations are all those words which strongly invoke one another yet which cannot readily be said to be similar. Typically these will have an identifiable semantic or grammatical relationship (meronym/holonym: stem -flower, verb/object: eat -food etc), or may have harder-to-classify topical or idiomatic relationships (family -Christmas, rock -roll).",
                "cite_spans": [
                    {
                        "start": 453,
                        "end": 465,
                        "text": "(Rapp, 2002)",
                        "ref_id": "BIBREF18"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "We will show in Section 3.2 that syntagmatic relations by themselves constitute a substantial 25-40% of the strongest human responses to cue words. Although the automatic detection of these assocations in text has received less attention than that of paradigmatic associations, they are nonetheless important in applications such as the resolution of bridging anaphora (Vieira and Poesio, 2000) . 1 Furthermore, first-order associations are often the basis of higher-order vector wordspace models used for predicting paradigmatic relationships: i.e. through the observation of words which share similar sets of syntagmatic associations. Therefore improvements made at the level we are concerned with may reasonably be expected to carry through to applications which hinge on the identification of paradigmatic relationships.",
                "cite_spans": [
                    {
                        "start": 369,
                        "end": 394,
                        "text": "(Vieira and Poesio, 2000)",
                        "ref_id": "BIBREF22"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "After a discussion of previous work in Section 2, we formulate the exact association measures and parameter settings which we compare in Section 3, where we also introduce the corpora and human association sets used. Then, by using evaluations similar to those described in (Baroni et al., 2008) and by Rapp (2002) , we show that the best distance-based measures correlate better overall with human association scores than do the best window based configurations (see Section 4), and that they also serve as better predictors of the strongest human associations (see Section 5).",
                "cite_spans": [
                    {
                        "start": 274,
                        "end": 295,
                        "text": "(Baroni et al., 2008)",
                        "ref_id": null
                    },
                    {
                        "start": 303,
                        "end": 314,
                        "text": "Rapp (2002)",
                        "ref_id": "BIBREF18"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "Measures based on co-ocurrence frequency. The standard way of estimating the syntagmatic association of word pairs in a corpus is to examine the frequency of their co-occurence, and then usually to compare this to some expected frequency. There are a host of measures which exist for this purpose. After raw co-occurrence frequency, the simplest and most prevalent in the literature is Pointwise Mutual Information, famously used by Church (1989) (as the association ratio). This is defined as the log of the ratio of the observed co-occurrence frequency to the frequency expected under independence. More sophisticated and statistically-informed measures include t-Score, z-Score, Chi-Squared and Log-Likelihood (see Evert (2005) for a thorough review).",
                "cite_spans": [
                    {
                        "start": 433,
                        "end": 446,
                        "text": "Church (1989)",
                        "ref_id": "BIBREF2"
                    },
                    {
                        "start": 718,
                        "end": 730,
                        "text": "Evert (2005)",
                        "ref_id": "BIBREF6"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Related Work",
                "sec_num": "2"
            },
            {
                "text": "All of these measures have in common that they require co-occurrence frequency to be specified, and therefore require some definition of a region within which to count co-occurrences. This region might be the entirety of a document at one extreme, or a bigram at the other. A versatile and hugely popular generalised approach is therefore to consider a \"'window\"' of w words, where w can be varied to suit the application. Unsurprisingly, it has been found that this is a parameter which can have a significant impact upon performance (Yarowsky and Florian, 2002; Lamjiri et al., 2004; Wang, 2005) . While choosing an optimum window size for an application is often subject to trial and error, there are some generally recognized trade-offs between small versus large windows, such as the impact of data-sparseness, and the nature of the associations retrieved (Church and Hanks, 1989; Church and Hanks, 1991; Rapp, 2002) Measures based on distance between words in the text. The idea of using distance as an alternative to frequency for modelling language has been touched upon in recent literature (Savicki and Hlavacova, 2002; Terra and Clarke, 2004; Hardcastle, 2005) . Washtell (2009) showed that it is possible to build distance-based analogues of existing syntagmatic association measures, by using the notions of mean and expected distance rather than of frequency. These measures have certain theoretical qualities -notably scale-independence and relative resilience to data-sparseness -which might be expected to provide gains in tasks such as the reproduction of human association norms from corpus data. The specific measure introduced by Washtell, called Co-Dispersion, is based upon an established biogeographic dispersion measure (Clark and Evans, 1954) . We provide a thorough empirical investigation of Co-Dispersion and some of its derivatives herein.",
                "cite_spans": [
                    {
                        "start": 535,
                        "end": 563,
                        "text": "(Yarowsky and Florian, 2002;",
                        "ref_id": "BIBREF27"
                    },
                    {
                        "start": 564,
                        "end": 585,
                        "text": "Lamjiri et al., 2004;",
                        "ref_id": "BIBREF12"
                    },
                    {
                        "start": 586,
                        "end": 597,
                        "text": "Wang, 2005)",
                        "ref_id": "BIBREF23"
                    },
                    {
                        "start": 861,
                        "end": 885,
                        "text": "(Church and Hanks, 1989;",
                        "ref_id": "BIBREF2"
                    },
                    {
                        "start": 886,
                        "end": 909,
                        "text": "Church and Hanks, 1991;",
                        "ref_id": "BIBREF3"
                    },
                    {
                        "start": 910,
                        "end": 921,
                        "text": "Rapp, 2002)",
                        "ref_id": "BIBREF18"
                    },
                    {
                        "start": 1100,
                        "end": 1129,
                        "text": "(Savicki and Hlavacova, 2002;",
                        "ref_id": "BIBREF20"
                    },
                    {
                        "start": 1130,
                        "end": 1153,
                        "text": "Terra and Clarke, 2004;",
                        "ref_id": "BIBREF21"
                    },
                    {
                        "start": 1154,
                        "end": 1171,
                        "text": "Hardcastle, 2005)",
                        "ref_id": "BIBREF7"
                    },
                    {
                        "start": 1174,
                        "end": 1189,
                        "text": "Washtell (2009)",
                        "ref_id": "BIBREF24"
                    },
                    {
                        "start": 1745,
                        "end": 1768,
                        "text": "(Clark and Evans, 1954)",
                        "ref_id": "BIBREF4"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Related Work",
                "sec_num": "2"
            },
            {
                "text": "Measures based on syntactic relations. Several researchers (Lin, 1998; Curran, 2003; Pado and Lapata, 2007) have used word space models based on grammatical relationships for detecting and quantifying (mostly paradigmatic) word associations. In this paper, we will not use syntactic relation measures for two main reasons. Firstly these depend on the availability of parsers, which is not a given for many languages. Secondly, this may not be the most pertinent approach for predicting human free associations, in which certain observed relationsips can be hard to express in terms of syntactic relationships.",
                "cite_spans": [
                    {
                        "start": 59,
                        "end": 70,
                        "text": "(Lin, 1998;",
                        "ref_id": "BIBREF13"
                    },
                    {
                        "start": 71,
                        "end": 84,
                        "text": "Curran, 2003;",
                        "ref_id": "BIBREF5"
                    },
                    {
                        "start": 85,
                        "end": 107,
                        "text": "Pado and Lapata, 2007)",
                        "ref_id": "BIBREF16"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Related Work",
                "sec_num": "2"
            },
            {
                "text": "Similar to (Rapp, 2002; Baroni et al., 2008, among others) , we use comparison to human assocation datasets as a test bed for the scores produced by computational association measures. An alternative might be to validate scores against those derived from a structured resource such as WordNet. However, relatedness measures for WordNet are many and varied and are themselves the subject of evaluation (Pedersen et al., 2004) . Although human association datasets have their own peculiarities, they do at least provide some kind of definite Gold Standard. Yet another alternative might be to incorporate our computational association scores into an application (such as anaphora resolution), and measure the performance of that, but noise from other submodules would complicate evaluation. We leave such extensions to possible future work.",
                "cite_spans": [
                    {
                        "start": 11,
                        "end": 23,
                        "text": "(Rapp, 2002;",
                        "ref_id": "BIBREF18"
                    },
                    {
                        "start": 24,
                        "end": 58,
                        "text": "Baroni et al., 2008, among others)",
                        "ref_id": null
                    },
                    {
                        "start": 401,
                        "end": 424,
                        "text": "(Pedersen et al., 2004)",
                        "ref_id": "BIBREF17"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Methodology",
                "sec_num": "3"
            },
            {
                "text": "We use evaluations similar to those used before (Rapp, 2002; Pado and Lapata, 2007; Baroni et al., 2008, among others) . However, whereas most existing studies use only one dataset, or handselected parts thereof, we aim to evaluate measures across four different human datasets. In this way we hope to get as unbiased a picture as possible.",
                "cite_spans": [
                    {
                        "start": 48,
                        "end": 60,
                        "text": "(Rapp, 2002;",
                        "ref_id": "BIBREF18"
                    },
                    {
                        "start": 61,
                        "end": 83,
                        "text": "Pado and Lapata, 2007;",
                        "ref_id": "BIBREF16"
                    },
                    {
                        "start": 84,
                        "end": 118,
                        "text": "Baroni et al., 2008, among others)",
                        "ref_id": null
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Methodology",
                "sec_num": "3"
            },
            {
                "text": "The datasets used are listed in Table 1 . While the exact experimental conditions may differ, the datasets used were all elicited using the same basic methodology: by presenting individual words (cues) to a number of healthy human subjects and asking in each case for the word that is most immediately or strongly evoked. An association score can then be derived for each cue/response pair in a dataset by dividing the number of participants providing a given response by the number who were presented with the cue word. In Table 1 , respondents refers to the number of people from whom a response was solicited for each cue word in a study (this is not to be confused with the number of unique responses).",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 38,
                        "end": 39,
                        "text": "1",
                        "ref_id": "TABREF0"
                    },
                    {
                        "start": 530,
                        "end": 531,
                        "text": "1",
                        "ref_id": "TABREF0"
                    }
                ],
                "eq_spans": [],
                "section": "Association data",
                "sec_num": "3.1"
            },
            {
                "text": "Of these four datasets, one (Kent & Rosanoff) appears not to have been previously used in any peer-reviewed study of corpus-derived lexical association. It is worth noting that some of these datasets are quite dated, which might affect correlations with corpus-derived scores, as culture and contemporary language have a fundamental im-pact upon the associations humans form (White and Abrams, 2004) .",
                "cite_spans": [
                    {
                        "start": 375,
                        "end": 399,
                        "text": "(White and Abrams, 2004)",
                        "ref_id": "BIBREF26"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Association data",
                "sec_num": "3.1"
            },
            {
                "text": "To verify that strong human associations do include a large number of syntagmatic associations, we manually annotated all pairs consisting of a cue and its strongest human response in the Minnesota and Kent datasets as expressing either a syntagmatic or a paradigmatic relationship. The overall set to be annotated consisted of 200 pairs.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Frequency of Syntagmatic Associations",
                "sec_num": "3.2"
            },
            {
                "text": "Annotators were given short (half-page) guidelines on syntagmatic and paradigmatic assocations, stating that very similar items (including hyponyms/hypernyms) as well as antonyms were to be judged as paradigmatic whereas words that do not fulfil this criterion are to be judged as syntagmatic. The two annotators were the authors of this paper (one native and one near-native speaker). After independent annotation, agreement was measured at a percentage agreement of 91/93% and a kappa of 0.80/0.82 for Minnesota and Kent, respectively. Therefore, the distinction can be made with high reliability.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Frequency of Syntagmatic Associations",
                "sec_num": "3.2"
            },
            {
                "text": "Overall, 27/39% of the human responses were syntagmatic in the Kent/Minnesota datasets, showing that syntagmatic relations make up a large proportion of even the strongest human associations.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Frequency of Syntagmatic Associations",
                "sec_num": "3.2"
            },
            {
                "text": "We use two randomized subsets of the British National Corpus (BNC), a representative 100 million word corpus of British English (Burnard, 1995) : one 10 million word sample, and a 1 million word sample. A vocabulary of approximately 33,000 word types was used. The selected words included approximately 24,000 word types comprising all cue and target words from the multiple sets of human association norms to be used in this study. To these were added a top-cut of the most frequent words in the BNC, until the total of 33,000 word types was reached. The resultant set included ap-proximately the 24,000 most common word types in the BNC, with the remaining 9000 words types therefore comprising relatively uncommon words taken from the human associative responses.",
                "cite_spans": [
                    {
                        "start": 128,
                        "end": 143,
                        "text": "(Burnard, 1995)",
                        "ref_id": "BIBREF1"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Corpora",
                "sec_num": "3.3"
            },
            {
                "text": "The words included in the vocabulary accounted for over 94.5% of tokens in the corpus. Although statistics for the remaining word types in the BNC were not gathered, their corresponding tokens were left in the corpus so that these could be properly accounted for when calculating distances and window spans.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Corpora",
                "sec_num": "3.3"
            },
            {
                "text": "In order to maximize matching between word types in the corpus and association norms, all words in both were normalized by converting to lower-case and removing hyphens and periods. Words consisting entirely of numerals, or numerals and punctuation, and all \"phrasal\" associative responses (those containing spaces) were discarded. The 33,000 word count was satisfied after making these normalizations.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Corpora",
                "sec_num": "3.3"
            },
            {
                "text": "In order to maximize the variety of the language in the samples, the subsets were built from approximately the first 2000 words only of each randomly selected document from the BNC (a similar strategy to that used in constructing the 1 million word Brown Corpus). Both a 10 million word and a 1 million word sample were constructed in this fashion, allowing us to also examine the effects of varying corpus size and content.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Corpora",
                "sec_num": "3.3"
            },
            {
                "text": "In the following, x is the cue word and y a (possible) response word. Therefore p(x) is the probability of observing x, and p(x) refers to the probability of not observing x.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Frequency-based measures",
                "sec_num": "3.4.1"
            },
            {
                "text": "Pointwise Mutual Information (hereonin PMI) was introduced in Section 2. For ranking word pairs, we can neglect the usual logarithm.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Frequency-based measures",
                "sec_num": "3.4.1"
            },
            {
                "text": "P M I = p(x, y) p(x)p(y)",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Frequency-based measures",
                "sec_num": "3.4.1"
            },
            {
                "text": "PMI is infamous for its tendency to attribute very high association scores to pairs involving low frequency words, as the denominator is small in such cases, even though the evidence for association in such cases is also small. This can result in some unlikely associations. There exist a number of alternative measures which factor in the amount of evidence to give an estimate of the significance of association. One popular and statistically appealing such measure is Log-Likelihood (LL) (Dunning, 1993) . LL works on a similar principle to PMI but considers the ratio of the observed to expected co-occurrence frequencies for all contingencies (i.e. including those where the words do not co-occur). LL, as it most frequently appears in the literature, is not actually a measure of positive association: it also responds to significant negative association. Therefore LL is arguably not suited to the task in hand. Krenn & Evert (2001) experiment with one-tailed variants of LL and Chi-Squared measures, although they do not define these variants. Here, we construct a one-tailed variant of LL by simply reversing the signs of the terms which respond to negative association.",
                "cite_spans": [
                    {
                        "start": 491,
                        "end": 506,
                        "text": "(Dunning, 1993)",
                        "ref_id": null
                    },
                    {
                        "start": 919,
                        "end": 939,
                        "text": "Krenn & Evert (2001)",
                        "ref_id": "BIBREF11"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Frequency-based measures",
                "sec_num": "3.4.1"
            },
            {
                "text": "LL 1tail = p(x, y) log p(x, y) p(x)p(y) -p(x, ȳ) log p(x, ȳ) p(x)p(ȳ) -p(x, y) log p(x, y) p(x)p(y) + p(x, ȳ) log p(x, ȳ) p(x)p(ȳ)",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Frequency-based measures",
                "sec_num": "3.4.1"
            },
            {
                "text": "LL does not have a clear analogue amongst the distance-based measures (introduced in Section 3.4.2), whereas PMI for instance does. We therefore construct variants of PMI and other measures which take the amount of evidence into account in a way which can be directly reproduced in the distance domain. For this we borrow from Sackett (2001) who asserts that, all other things being equal, statistical significance is proportional to the square root of the sample size. There are a number of ways one might quantify sample size. We take a consistent approach across the various distance-based and frequency-based measures: we assume sample size to be equivalent to the lesser of the frequencies of the two words as this represents the total number of words available for pairing, with fewer observed pairs therefore being considered to constitute negative evidence.",
                "cite_spans": [
                    {
                        "start": 327,
                        "end": 341,
                        "text": "Sackett (2001)",
                        "ref_id": "BIBREF19"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Frequency-based measures",
                "sec_num": "3.4.1"
            },
            {
                "text": "P M Isig = min(p(x), p(y)) p(x, y) p(x)p(y)",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Frequency-based measures",
                "sec_num": "3.4.1"
            },
            {
                "text": "All of the above measures are symmetric. Human associative responses however are not (Michelbacher et al., 2007) : a person's tendency to give the response because to the cue why does not necessarily reflect their tendency to give the response why to the cue because.2 A simple asymmetric association measure is conditional probability (CP)",
                "cite_spans": [
                    {
                        "start": 85,
                        "end": 112,
                        "text": "(Michelbacher et al., 2007)",
                        "ref_id": "BIBREF14"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Frequency-based measures",
                "sec_num": "3.4.1"
            },
            {
                "text": "-the probability of observing the response, given that the cue has already occurred.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Frequency-based measures",
                "sec_num": "3.4.1"
            },
            {
                "text": "CP = p(y|x) = p(x, y) p(x)",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Frequency-based measures",
                "sec_num": "3.4.1"
            },
            {
                "text": "CP suffers from the fact that it does not account at all for the general frequency of the response word. It therefore tends to favour very frequent words, such as function words. An obvious solution would be to divide CP by the frequency of the response word, however this merely results in PMI which is symmetric. By multiplying CP with PMI (and taking the root, to simplify) we obtain a measure which is asymmetric yet does not overtly favour frequent response words. 3 We refer to this herein as Semi-Conditional Information (SCI).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Frequency-based measures",
                "sec_num": "3.4.1"
            },
            {
                "text": "SCI = p(x, y) p(x) p(y)",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Frequency-based measures",
                "sec_num": "3.4.1"
            },
            {
                "text": "We also explore variants of both CP and SCI with the additional significance correction presented for PMI sig . These can be easily inferred from the formulae above.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Frequency-based measures",
                "sec_num": "3.4.1"
            },
            {
                "text": "Co-Dispersion (herein CD), introduced by Washtell (2009) , is defined as the ratio of the mean observed distance to the expected distance, where the expected distance is derived from the frequency of the more frequent word type. Distance refers to the number of tokens separating an occurrence of one word and the nearest occurrence of another word. Pairs spanning an intervening occurrence of either word type or a document boundary are not considered. Note that here we specify only the generalised mean M , as we wish to keep the specific choice of mean as a parameter to be explored,",
                "cite_spans": [
                    {
                        "start": 41,
                        "end": 56,
                        "text": "Washtell (2009)",
                        "ref_id": "BIBREF24"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Distance-based Measures",
                "sec_num": "3.4.2"
            },
            {
                "text": "CD = 1/ max(p(x), p(y)) M (distxy1 . . . distxyn)",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Distance-based Measures",
                "sec_num": "3.4.2"
            },
            {
                "text": "that of direction in the text. While the two may correlate, one can find ample counter-examples: jerky triggers beef more strongly than beef triggers jerky.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Distance-based Measures",
                "sec_num": "3.4.2"
            },
            {
                "text": "3 Note that Wettler & Rapp (1993) introduced a more general asymmetric measure for predicting human associations, by employing an exponent parameter to p(y). Our formulisation is equivalent to their measure with an exponent of 0.5, whereas they found an exponent of 0.66 to be most effective in their empirical study. Exponents of 0 and 1 result in CP and PMI respectively.",
                "cite_spans": [
                    {
                        "start": 12,
                        "end": 33,
                        "text": "Wettler & Rapp (1993)",
                        "ref_id": "BIBREF25"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Distance-based Measures",
                "sec_num": "3.4.2"
            },
            {
                "text": "where dist xyi is i th observed distance between some occurrence of word type x and its nearest preceding or following occurrence of word type y, and n is the total number of such distances observed (being at most equal to the frequency of the rarer word).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Distance-based Measures",
                "sec_num": "3.4.2"
            },
            {
                "text": "In cases where many occurrences of the less frequent word were not able to be paired, raw CD gives midleading results. This is because unpairable words themselves provide useful negative evidence which CD ignores. A more appropriate measure can be formed in which the mean distance is calculated using the frequency of the less frequent word, regardless of whether this many distances were actually observed. This gives us Neutrally-Weighted Co-Dispersion (NWCD). Note that for convenience, we keep the standard definition of the mean and introduce a correction factor instead.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Distance-based Measures",
                "sec_num": "3.4.2"
            },
            {
                "text": "N W CD = n min(p(x), p(y)) 1/ max(p(x), p(y)) M (distxy1 . . . distxyn)",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Distance-based Measures",
                "sec_num": "3.4.2"
            },
            {
                "text": "An asymmetric association measure can be formed in a similar manner. Instead of calculating the mean using the frequency of the less frequent word as described above, we explicitly use the frequency of the cue word (which in some cases may actually exceed the number of distances observed). This gives us Cue-Weighted Co-Dispersion (CWCD).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Distance-based Measures",
                "sec_num": "3.4.2"
            },
            {
                "text": "EQUATION",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [
                    {
                        "start": 0,
                        "end": 8,
                        "text": "EQUATION",
                        "ref_id": "EQREF",
                        "raw_str": "CW CD = n p(x) 1/ max(p(x), p(y)) M (distxy1 . . . distxyn)",
                        "eq_num": "(1)"
                    }
                ],
                "section": "Distance-based Measures",
                "sec_num": "3.4.2"
            },
            {
                "text": "In addition to these measures, we also explore significance-corrected forms NWCD sig and CWCD sig , by introducing the same sample size term employed by PMI sig , CP sig and SCI sig . Again, these can readily be inferred from the existing formulae in the above two sections.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Distance-based Measures",
                "sec_num": "3.4.2"
            },
            {
                "text": "For frequency-based co-occurrence statistics, the principle parameter is the window size. We will use five window sizes separated by a constant scaling factor, chosen so as to span those most commonly encountered in the literature, with some extension towards the upper end. We use w to represent this parameter, with w = 2 implying a window size of +/-2. The parameter values explored are w = 2, w = 10, w = 50, w = 250 and w = 1250. We examine such large window sizes so as to give a fairer comparison with the distance approach which is not bounded by a window, and in acknowledgement of the fact that the entire document as context has been used with some success in other application areas (most notably information retrieval).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Co-occurrence Parameters",
                "sec_num": "3.5"
            },
            {
                "text": "For distance-based statistics, the principle parameter is the function via which the various observed distances between tokens are reduced to a single mean value. In this investigation we will explore five means. These are the power means with exponents (which herein we refer to as m) ranging from -2 to +2. These give us the quadratic mean or RMS (m = 2), the arithmetic mean (m = 1), the geometric mean (m = 0), the harmonic mean (m = -1), and the inverse quadratic mean (m = -2).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Co-occurrence Parameters",
                "sec_num": "3.5"
            },
            {
                "text": "One of the ESSLLI Workshop shared tasks (Baroni et al., 2008) required the evaluation of correlation between a small, manually selected subset of human cue-response scores from the EAT dataset and automatic scores for the same word pairs. Here, tather than focusing on word pairs which meet certain grammatical and frequency criteria we test on all pairs. For the EAT and Florida datasets, this amounts to many tens of thousands of cue-response pairs. Although this makes the task of correlation harder, it means we can attribute a great deal of statistical significance to the results and make our observations as general as possible.",
                "cite_spans": [
                    {
                        "start": 40,
                        "end": 61,
                        "text": "(Baroni et al., 2008)",
                        "ref_id": null
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Task I: Correlations on word pairs",
                "sec_num": "4"
            },
            {
                "text": "For evaluating agreement between corpus-derived associations and human associations, we use Spearman's Rank correlation. This is appropriate because we are primarily interested in the relative ranking of word pair associations (in order to predict particularly strong responses, for example). Although some studies have used Pearson's correlation, the various association measures explored here are not linear within each another and it would be inappropriate to evaluate them under the assumption of a linear relationship with the human norms. Two of the human datasets, Kent and Minnesota, though collected independently, are based on the same set of 100 cue words established by Kent (1910) . Therefore by performing a rank correlation of these two datasets with one another, (each of which was produced by pooling the responses of some 1000 people) we can get a useful upper-bound for correlations: if a computer-based system were to exceed this upper-bound in correlations with either dataset, then we would need to suspect it of over-fitting.",
                "cite_spans": [
                    {
                        "start": 682,
                        "end": 693,
                        "text": "Kent (1910)",
                        "ref_id": "BIBREF9"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Evaluation Measures, Upper Bounds and Baselines",
                "sec_num": "4.1"
            },
            {
                "text": "As a baseline, we use the corpus frequency of the response word. The simple assumption is that the more frequent a word is, the more likely it is to appear as a human response independent of the cue given. This is also the simplest formulation which does not assign equal scores to the various possible responses, and which is therefore capable of producing a rank-list of predictions.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Evaluation Measures, Upper Bounds and Baselines",
                "sec_num": "4.1"
            },
            {
                "text": "Figure 1 shows the Spearman's rank correlation co-efficients across all paramaterisations of all association measures (frequency-based on the left, and distance-based on the right), with each human dataset, for the 10 million word corpus. Emboldened are the best performing windowed and windowless configurations for each dataset. The difference of these figures over the baseline is highly significant (p < 0.0001 in most cases). The panels to the right show summary statistics for these figures, and for the 1 million word corpus (for which full figures are not included owing to space limitations). These statistics include the performance of the baseline, where relevant the estimated upperbound (see Section 4.1), and the difference in performance of the distance-based method over the window-based. The accuracy and error figures are based on the co-efficients of determination (r 2 ) and are expressed both as a relative improvement in accuracy (how much closer (r 2 ) is to 1 under the distance-based approach) and reduction in error (how much further r 2 is from zero). Also the significance of the difference in the r values is given.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 7,
                        "end": 8,
                        "text": "1",
                        "ref_id": "FIGREF0"
                    }
                ],
                "eq_spans": [],
                "section": "Task I Results",
                "sec_num": "4.2"
            },
            {
                "text": "The two-way Spearman's rank correlations between the Kent and Minesota datasets suggested an upper bound of r = 0.4. In theory, a large proportion of this agreement is accounted for by paradigmatic associations which we are not likely to fully reproduce with these first-order measures. By this standard, the general levels of What is immediately clear from Figure 1 is that, for the range of parameters tested here, we see a relatively small but statistically significant improvement across four of the five datasets when adopting the distance-based approach.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 365,
                        "end": 366,
                        "text": "1",
                        "ref_id": "FIGREF0"
                    }
                ],
                "eq_spans": [],
                "section": "Discussion",
                "sec_num": "4.3"
            },
            {
                "text": "The correlations are unsurprisingly lower across the board for the much smaller 1 million word corpus. Here, the best distance-based measure statistically significantly outperforms the best windowbased one (with a significance level of p < 0.0001) on one out of four datasets, while the differences are not great enough to be considered statistically significant on the other three datasets. There is therefore some evidence that the benefits observed with the larger corpus hold in the presence of limited data, which is in support of the general theory that distance-based methods capture more information from the corpus at the co-occurrence level (Washtell, 2009) . It remains clear, however, that no method is presently a substitute for using a larger corpus.",
                "cite_spans": [
                    {
                        "start": 651,
                        "end": 667,
                        "text": "(Washtell, 2009)",
                        "ref_id": "BIBREF24"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Discussion",
                "sec_num": "4.3"
            },
            {
                "text": "In terms of optimum configurations, we find that for the frequency-based approach with the larger corpus, a window size of around +/-10 to +/-50 words more or less consistently produces the best results, irrespective of association the measure. Interestingly on the small corpus the tendency appears to be towards a somewhat larger window size than with the larger corpus. This may be related to the larger windows' increased resilience to data-sparseness. Somewhat surprisingly, we also see that our assymmetric association measures SCI and SCI sig perform the best overall amongst the windowed measures, largely irrespective of the window or corpus, size.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Discussion",
                "sec_num": "4.3"
            },
            {
                "text": "In the large corpus, the best distance-based measure is the asymmetric CW CD, with the significance corrected measure CW CD sig showing greater strength in the small corpus: perhaps, again, for its improved reliability in the presence of very low-frequency data. The optimum mean for the distance-based parameterisations is somewhere around m = -1 (the harmonic) to m = 0 (the geometric). We find this unsurprising as the typical distribution of inter-word distances in a corpus is heavily skewed towards the smaller distances -indeed even a random corpus exhibits this characteristic with the distances following a geometric distribution.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Discussion",
                "sec_num": "4.3"
            },
            {
                "text": "The correlation evalation presented considers all word pairs present in the human datasets. However, human association norms tend to contain a very long tail of hapax legomena -responses which were given by only one individual. Such responses are extremely difficult for corpus-based association measures to predict, and given that there is so little consensus amongst human respondents over these items, it is probably not particularly useful to do so. Rather, it might be most useful to predict common or majority human responses.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Task II: Agreement with strongest human associations",
                "sec_num": "5"
            },
            {
                "text": "For the strongest human response to each cue in the human datasets, its rank was calculated amongst all 33, 000 possible responses to that cue, according to each association measure and parameterisation. Where there were tied scores for various responses, a median rank was assigned.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Evaluation measure and Upper Bound",
                "sec_num": "5.1"
            },
            {
                "text": "As a rough upper bound, we would be impressed by a computer system which was able to predict the most popular human response as often as a randomly selected individual in the human experiments happened to chose the most popular response.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Evaluation measure and Upper Bound",
                "sec_num": "5.1"
            },
            {
                "text": "Figure 2 illustrates the range of computational association scores attributed to only the strongest human responses. The position of the strongest human response to each cue word, within the computationally-ranked lists of all possible responses, is plotted on the y-axis. For each association measure the points are ordered from best to worst along the x-axis. In the ideal case therefore, the most popular human response for every cue word would appear at rank 1 amongst the computer-generated responses, resulting in a horizonal line at y=1. Generally speaking therefore, the smaller the area above a line the better the performance of a measure. Three summary statistics can be derived from Figure 2: 1) The number of most popular human responses that are correctly predicted by a measure is indicated by the x-position at which its line departs from y=1. This can be seen to be around 11% for CWCD sig and is zero for the two best PMI parameterizations, with other illustrated measures performing intermediately.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 7,
                        "end": 8,
                        "text": "2",
                        "ref_id": "FIGREF1"
                    },
                    {
                        "start": 702,
                        "end": 704,
                        "text": "2:",
                        "ref_id": "FIGREF1"
                    }
                ],
                "eq_spans": [],
                "section": "Task II Results",
                "sec_num": "5.2"
            },
            {
                "text": "2) The width of the flat horizontal tails at the opposite corner of the figure indicate the proportion of the cue words for which a measure was unable to differentiate the strongest human response from the large contingent of zero association scores resulting from unobservable co-occurrences. This tail is non-existent for CWCD sig , but afflicts some 25% and 62% of cue words under the two best PMI parameterizations, again with other illustrated measures performing intermediately.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Task II Results",
                "sec_num": "5.2"
            },
            {
                "text": "3) The median rank of the most popular human response for each measure can be read of on the y-axis at the horizontal mid-point (indicated by a feint vertical line). other frequency-based configurations are included for contrast. Also included is the single windowless configuration with the highest median rankin this case CWCD sig using the harmonic mean. Several other windowless configurations (notably CWCD and the nearby means) and had very similar profiles.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Task II Results",
                "sec_num": "5.2"
            },
            {
                "text": "Figure 3 shows the magnitude of the difference in the ranking of each of the same 100 strong human cue/response pairs, between the best windowless versus best windowed method. Points above the axis represent those cue/response pairs which the windowless method ranked more highly, and vice-versa. The points have been ordered on the x-axis according the the cue word frequency.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 7,
                        "end": 8,
                        "text": "3",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "Task II Results",
                "sec_num": "5.2"
            },
            {
                "text": "Noteworthy, studying Figure 2 , is the great sensitivity of the frequency-based measures to the window size parameter. There exists a cut-off point, linked to window size, beyond which the frequency-based measures are unable to make any differentiation between the desired human response and a large portion of the 33, 000 candidate responses. This is almost certainly due to a lack of evidence in the presence of very low frequency words. Log-Likelihood performs somewhat better in this respect, as it takes negative information into account.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 28,
                        "end": 29,
                        "text": "2",
                        "ref_id": "FIGREF1"
                    }
                ],
                "eq_spans": [],
                "section": "Discussion",
                "sec_num": "5.3"
            },
            {
                "text": "Although the distance-based approach follows the same general trend as the other measures, it is nonetheless able to generate a distinct non-zero association score for every strong human response and overall it aptly ranks them more highly. A larger number these responses are actually ranked first (i.e. successfully predicted) by the distancebased approach. In fact this number is comparable to, and sometimes exceeds, the upper-bound of 10% implied by taking the average proportion of human respondents who give the most popular response to a given cue.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Discussion",
                "sec_num": "5.3"
            },
            {
                "text": "Whilst Figure 2 showed that overall the windowless method fairs better, on a per-cue basis (Figure 3 ) things are a little more interesting: For a little over a third of cue-words the windowed method actually appears to perform somewhat better. For the majority however, the windowless approach performs considerably better (note that the y-axis scale is logarithmic). It can also be seen that the difference between the methods is most pronounced for low frequency cue words, with re-sponses to some cues exhibiting a relative ranking of around one-hundred times lower for the windowed method. This further supports the theory that the windowless methods are better able to exploit sparse data.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 14,
                        "end": 15,
                        "text": "2",
                        "ref_id": "FIGREF1"
                    },
                    {
                        "start": 99,
                        "end": 100,
                        "text": "3",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "Discussion",
                "sec_num": "5.3"
            },
            {
                "text": "This paper presented the first empirical comparison of window-based and the relatively recently introduced windowless association measures, using their ability to reproduce human association scores as a testbed. We show that the best windowless measures are always at least as good as the best window-based measures, both when it comes to overall correlation with human association scores and predicting the strongest human response. In addition, for several human association sets, they perform significantly better. Although not all parameter settings and corpus sizes could be explored, we conclude that it is worthwhile investigating windowless association measures further. As a side-benefit, we have also introduced new variants of existing frequency-based association measures and shown them to perform as well as or better than their existing counterparts. Although these measures were semi-principled in their construction, a deeper understanding of why they work so well is needed. This may in turn lead to the construction of superior windowless measures.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Conclusions and Future work",
                "sec_num": "6"
            },
            {
                "text": "In our own future work, we are especially interested in using higher-order windowless association measures for retrieving paradigmatic relations as well as exploring their use in various NLP applications.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Conclusions and Future work",
                "sec_num": "6"
            },
            {
                "text": "where for example resolving my house -the windows to the windows of my house can be aided by the knowledge that windows are often (syntagmatically) associated with houses.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            },
            {
                "text": "This notion of assymmetry is not to be confused with",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            }
        ],
        "back_matter": [
            {
                "text": "We would like to extend sincere thanks to Reinhard Rapp for providing us with the Minnesota dataset in digital form, and additional thanks to Eric Atwell for his support.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Acknowledgements",
                "sec_num": "7"
            }
        ],
        "bib_entries": {
            "BIBREF1": {
                "ref_id": "b1",
                "title": "Users' Reference Guide, British National Corpus",
                "authors": [
                    {
                        "first": "L",
                        "middle": [],
                        "last": "Burnard",
                        "suffix": ""
                    }
                ],
                "year": 1995,
                "venue": "",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "L. Burnard, 1995. Users' Reference Guide, British Na- tional Corpus. British National Corpus Consortium, Oxford, England.",
                "links": null
            },
            "BIBREF2": {
                "ref_id": "b2",
                "title": "Word association norms, mutual information, and lexicography",
                "authors": [
                    {
                        "first": "K",
                        "middle": [],
                        "last": "Church",
                        "suffix": ""
                    },
                    {
                        "first": "P",
                        "middle": [],
                        "last": "Hanks",
                        "suffix": ""
                    }
                ],
                "year": 1989,
                "venue": "Proc. of ACL-89",
                "volume": "",
                "issue": "",
                "pages": "76--83",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "K. Church and P. Hanks. 1989. Word association norms, mutual information, and lexicography. In Proc. of ACL-89, pages 76-83.",
                "links": null
            },
            "BIBREF3": {
                "ref_id": "b3",
                "title": "Word association norms, mutual information and lexicography",
                "authors": [
                    {
                        "first": "K",
                        "middle": [],
                        "last": "Church",
                        "suffix": ""
                    },
                    {
                        "first": "P",
                        "middle": [],
                        "last": "Hanks",
                        "suffix": ""
                    }
                ],
                "year": 1991,
                "venue": "Computational Linguistics",
                "volume": "16",
                "issue": "1",
                "pages": "22--29",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "K. Church and P. Hanks. 1991. Word association norms, mutual information and lexicography. Com- putational Linguistics, 16(1):22-29.",
                "links": null
            },
            "BIBREF4": {
                "ref_id": "b4",
                "title": "Distance to nearest neighbor as a measure of spatial relationships in populations",
                "authors": [
                    {
                        "first": "P",
                        "middle": [],
                        "last": "Clark",
                        "suffix": ""
                    },
                    {
                        "first": "F",
                        "middle": [
                            "C"
                        ],
                        "last": "Evans",
                        "suffix": ""
                    }
                ],
                "year": 1954,
                "venue": "Ecology",
                "volume": "35",
                "issue": "",
                "pages": "445--453",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "P. Clark and F.C. Evans. 1954. Distance to near- est neighbor as a measure of spatial relationships in populations. Ecology, 35:445-453.",
                "links": null
            },
            "BIBREF5": {
                "ref_id": "b5",
                "title": "Accurate methods for the statistics of surprise and coincidence",
                "authors": [
                    {
                        "first": "J",
                        "middle": [],
                        "last": "Curran",
                        "suffix": ""
                    }
                ],
                "year": 1993,
                "venue": "Computational Linguistics",
                "volume": "19",
                "issue": "",
                "pages": "61--74",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "J. Curran. 2003. From distributional to semantic simi- larity. Ph.D. thesis, University of Edinburgh. Ted Dunning. 1993. Accurate methods for the statis- tics of surprise and coincidence. Computational Linguistics, 19:61-74.",
                "links": null
            },
            "BIBREF6": {
                "ref_id": "b6",
                "title": "The Statistics of Word Cooccurrences: Word Pairs and Collocations",
                "authors": [
                    {
                        "first": "S",
                        "middle": [],
                        "last": "Evert",
                        "suffix": ""
                    }
                ],
                "year": 2005,
                "venue": "",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "S. Evert. 2005. The Statistics of Word Cooccurrences: Word Pairs and Collocations. Ph.D. thesis, Insti- tut fr maschinelle Sprachverarbeitung, University of Stuttgart.",
                "links": null
            },
            "BIBREF7": {
                "ref_id": "b7",
                "title": "Using the distributional hypothesis to derive coocurrence scores from the British National Corpus",
                "authors": [
                    {
                        "first": "D",
                        "middle": [],
                        "last": "Hardcastle",
                        "suffix": ""
                    }
                ],
                "year": 2005,
                "venue": "Proc. of Corpus Linguistics",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "D. Hardcastle. 2005. Using the distributional hypothe- sis to derive coocurrence scores from the British Na- tional Corpus. In Proc. of Corpus Linguistics.",
                "links": null
            },
            "BIBREF8": {
                "ref_id": "b8",
                "title": "The 1952 Minnesota word association norms",
                "authors": [
                    {
                        "first": "J",
                        "middle": [],
                        "last": "Jenkins",
                        "suffix": ""
                    }
                ],
                "year": 1970,
                "venue": "Norms of word associations",
                "volume": "",
                "issue": "",
                "pages": "1--38",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "J. Jenkins. 1970. The 1952 Minnesota word associa- tion norms. In L. Postman and G. Keppel, editors, Norms of word associations, pages 1-38. Academic press.",
                "links": null
            },
            "BIBREF9": {
                "ref_id": "b9",
                "title": "A study of association in insanity",
                "authors": [
                    {
                        "first": "G",
                        "middle": [],
                        "last": "Kent",
                        "suffix": ""
                    },
                    {
                        "first": "A",
                        "middle": [],
                        "last": "Rosanoff",
                        "suffix": ""
                    }
                ],
                "year": 1910,
                "venue": "Amer. J. of Insanity",
                "volume": "",
                "issue": "",
                "pages": "317--390",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "G. Kent and A. Rosanoff. 1910. A study of association in insanity. Amer. J. of Insanity, pages 317-390.",
                "links": null
            },
            "BIBREF10": {
                "ref_id": "b10",
                "title": "An associative thesaurus of English and its computer analysis",
                "authors": [
                    {
                        "first": "G",
                        "middle": [],
                        "last": "Kiss",
                        "suffix": ""
                    },
                    {
                        "first": "C",
                        "middle": [],
                        "last": "Armstrong",
                        "suffix": ""
                    },
                    {
                        "first": "R",
                        "middle": [],
                        "last": "Milroy",
                        "suffix": ""
                    },
                    {
                        "first": "J",
                        "middle": [],
                        "last": "Piper",
                        "suffix": ""
                    }
                ],
                "year": 1973,
                "venue": "The Computer and Literary Studies",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "G. Kiss, C. Armstrong, R. Milroy, and J. Piper. 1973. An associative thesaurus of English and its computer analysis. In A. Aitken, R. Bailey, and N. Hamilton- Smith, editors, The Computer and Literary Studies. Edinburgh University Press.",
                "links": null
            },
            "BIBREF11": {
                "ref_id": "b11",
                "title": "Cam we do better than frequency? a case study on extracting pp-verb collocations",
                "authors": [
                    {
                        "first": "B",
                        "middle": [],
                        "last": "Krenn",
                        "suffix": ""
                    },
                    {
                        "first": "S",
                        "middle": [],
                        "last": "Evert",
                        "suffix": ""
                    }
                ],
                "year": 2001,
                "venue": "Proc. of the ACL Workshop on Collocations",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "B. Krenn and S. Evert. 2001. Cam we do better than frequency? a case study on extracting pp-verb collo- cations. In Proc. of the ACL Workshop on Colloca- tions.",
                "links": null
            },
            "BIBREF12": {
                "ref_id": "b12",
                "title": "Simple features for statistical word sense disambiguation",
                "authors": [
                    {
                        "first": "A",
                        "middle": [],
                        "last": "Lamjiri",
                        "suffix": ""
                    },
                    {
                        "first": "O",
                        "middle": [
                            "El"
                        ],
                        "last": "Demerdash",
                        "suffix": ""
                    },
                    {
                        "first": "L",
                        "middle": [],
                        "last": "Kosseim",
                        "suffix": ""
                    }
                ],
                "year": 2004,
                "venue": "Proc. of SENSEVAL-2004",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "A. Lamjiri, O. El Demerdash, and L. Kosseim. 2004. Simple features for statistical word sense disam- biguation. In Proc. of SENSEVAL-2004.",
                "links": null
            },
            "BIBREF13": {
                "ref_id": "b13",
                "title": "Automatic retrieval and clustering of similar words",
                "authors": [
                    {
                        "first": "D",
                        "middle": [],
                        "last": "Lin",
                        "suffix": ""
                    }
                ],
                "year": 1998,
                "venue": "Proc. of COLING-ACL-98",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "D. Lin. 1998. Automatic retrieval and clustering of similar words. In Proc. of COLING-ACL-98.",
                "links": null
            },
            "BIBREF14": {
                "ref_id": "b14",
                "title": "Asymmetric association measures",
                "authors": [
                    {
                        "first": "Lukas",
                        "middle": [],
                        "last": "Michelbacher",
                        "suffix": ""
                    },
                    {
                        "first": "Stefan",
                        "middle": [],
                        "last": "Evert",
                        "suffix": ""
                    },
                    {
                        "first": "Hinrich",
                        "middle": [],
                        "last": "Schütze",
                        "suffix": ""
                    }
                ],
                "year": 2007,
                "venue": "Proc. of RANLP-2007",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Lukas Michelbacher, Stefan Evert, and Hinrich Schütze. 2007. Asymmetric association measures. In Proc. of RANLP-2007.",
                "links": null
            },
            "BIBREF15": {
                "ref_id": "b15",
                "title": "The University of South Florida homograph norms",
                "authors": [
                    {
                        "first": "D",
                        "middle": [],
                        "last": "Nelson",
                        "suffix": ""
                    },
                    {
                        "first": "C",
                        "middle": [],
                        "last": "Mcevoy",
                        "suffix": ""
                    },
                    {
                        "first": "J",
                        "middle": [],
                        "last": "Walling",
                        "suffix": ""
                    },
                    {
                        "first": "J",
                        "middle": [],
                        "last": "Wheeler",
                        "suffix": ""
                    }
                ],
                "year": 1980,
                "venue": "Behaviour Research Methods and Instrumentation",
                "volume": "12",
                "issue": "",
                "pages": "16--37",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "D. Nelson, C. McEvoy, J. Walling, and J. Wheeler. 1980. The University of South Florida homograph norms. Behaviour Research Methods and Instru- mentation, 12:16-37.",
                "links": null
            },
            "BIBREF16": {
                "ref_id": "b16",
                "title": "Dependency-based construction of semantic space models",
                "authors": [
                    {
                        "first": "S",
                        "middle": [],
                        "last": "Pado",
                        "suffix": ""
                    },
                    {
                        "first": "M",
                        "middle": [],
                        "last": "Lapata",
                        "suffix": ""
                    }
                ],
                "year": 2007,
                "venue": "Computational Linguistics",
                "volume": "33",
                "issue": "2",
                "pages": "161--199",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "S. Pado and M. Lapata. 2007. Dependency-based con- struction of semantic space models. Computational Linguistics, 33(2):161-199.",
                "links": null
            },
            "BIBREF17": {
                "ref_id": "b17",
                "title": "Wordnet::similarity -measuring the relatedness of concepts",
                "authors": [
                    {
                        "first": "T",
                        "middle": [],
                        "last": "Pedersen",
                        "suffix": ""
                    },
                    {
                        "first": "S",
                        "middle": [],
                        "last": "Patwardhan",
                        "suffix": ""
                    },
                    {
                        "first": "J",
                        "middle": [],
                        "last": "Michelizzi",
                        "suffix": ""
                    }
                ],
                "year": 2004,
                "venue": "Proc. of the 21 st National Conference on Artificial Intelligence",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "T. Pedersen, S. Patwardhan, and J. Michelizzi. 2004. Wordnet::similarity -measuring the relatedness of concepts. In Proc. of the 21 st National Conference on Artificial Intelligence; 2004.",
                "links": null
            },
            "BIBREF18": {
                "ref_id": "b18",
                "title": "The computation of word associations: comparing syntagmatic and paradigmatic approaches",
                "authors": [
                    {
                        "first": "R",
                        "middle": [],
                        "last": "Rapp",
                        "suffix": ""
                    }
                ],
                "year": 2002,
                "venue": "Proc of COLING",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "R. Rapp. 2002. The computation of word associa- tions: comparing syntagmatic and paradigmatic ap- proaches. In Proc of COLING 2002.",
                "links": null
            },
            "BIBREF19": {
                "ref_id": "b19",
                "title": "Why randomized controlled trials fail but needn't: 2. failure to employ physiological statistics, or the only formula a clinician-trialist is every likely to need (or understand)",
                "authors": [
                    {
                        "first": "D",
                        "middle": [
                            "L"
                        ],
                        "last": "Sackett",
                        "suffix": ""
                    }
                ],
                "year": 2001,
                "venue": "Canadian Medical Association Journal",
                "volume": "165",
                "issue": "9",
                "pages": "1226--1237",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "D.L. Sackett. 2001. Why randomized controlled tri- als fail but needn't: 2. failure to employ physiolog- ical statistics, or the only formula a clinician-trialist is every likely to need (or understand). Canadian Medical Association Journal, 165(9):1226-1237.",
                "links": null
            },
            "BIBREF20": {
                "ref_id": "b20",
                "title": "Measures of word commonness",
                "authors": [
                    {
                        "first": "P",
                        "middle": [],
                        "last": "Savicki",
                        "suffix": ""
                    },
                    {
                        "first": "J",
                        "middle": [],
                        "last": "Hlavacova",
                        "suffix": ""
                    }
                ],
                "year": 2002,
                "venue": "Journal of Quantitative Linguistcs",
                "volume": "9",
                "issue": "3",
                "pages": "215--231",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "P. Savicki and J. Hlavacova. 2002. Measures of word commonness. Journal of Quantitative Linguistcs, 9(3):215-231.",
                "links": null
            },
            "BIBREF21": {
                "ref_id": "b21",
                "title": "Fast computation of lexical affinity models",
                "authors": [
                    {
                        "first": "E",
                        "middle": [],
                        "last": "Terra",
                        "suffix": ""
                    },
                    {
                        "first": "C",
                        "middle": [],
                        "last": "Clarke",
                        "suffix": ""
                    }
                ],
                "year": 2004,
                "venue": "Proc of COLING",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "E. Terra and C. Clarke. 2004. Fast computation of lexical affinity models. In Proc of COLING 2004.",
                "links": null
            },
            "BIBREF22": {
                "ref_id": "b22",
                "title": "An empirically-based system for processing definite descriptions",
                "authors": [
                    {
                        "first": "Renata",
                        "middle": [],
                        "last": "Vieira",
                        "suffix": ""
                    },
                    {
                        "first": "Massimo",
                        "middle": [],
                        "last": "Poesio",
                        "suffix": ""
                    }
                ],
                "year": 2000,
                "venue": "Computational Linguistics",
                "volume": "26",
                "issue": "4",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Renata Vieira and Massimo Poesio. 2000. An empirically-based system for processing definite de- scriptions. Computational Linguistics, 26(4), De- cember.",
                "links": null
            },
            "BIBREF23": {
                "ref_id": "b23",
                "title": "Robust Utilization of Context in Word Sense Disambiguation, chapter Modeling and Using Context",
                "authors": [
                    {
                        "first": "X",
                        "middle": [],
                        "last": "Wang",
                        "suffix": ""
                    }
                ],
                "year": 2005,
                "venue": "Springer Lecture Notes in Computer Science",
                "volume": "",
                "issue": "",
                "pages": "529--541",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "X. Wang, 2005. Robust Utilization of Context in Word Sense Disambiguation, chapter Modeling and Using Context, pages 529-541. Springer Lecture Notes in Computer Science.",
                "links": null
            },
            "BIBREF24": {
                "ref_id": "b24",
                "title": "Co-dispersion: A windowless approach to lexical association",
                "authors": [
                    {
                        "first": "J",
                        "middle": [],
                        "last": "Washtell",
                        "suffix": ""
                    }
                ],
                "year": 2009,
                "venue": "Proc. of EACL-2009",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "J. Washtell. 2009. Co-dispersion: A windowless ap- proach to lexical association. In Proc. of EACL- 2009.",
                "links": null
            },
            "BIBREF25": {
                "ref_id": "b25",
                "title": "Computation of word associations based on the co-ocurrences of words in large corpora",
                "authors": [
                    {
                        "first": "M",
                        "middle": [],
                        "last": "Wettler",
                        "suffix": ""
                    },
                    {
                        "first": "R",
                        "middle": [],
                        "last": "Rapp",
                        "suffix": ""
                    }
                ],
                "year": 1993,
                "venue": "Proc. of the First Workshop on Very Large Corpora",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "M. Wettler and R. Rapp. 1993. Computation of word associations based on the co-ocurrences of words in large corpora. In Proc. of the First Workshop on Very Large Corpora.",
                "links": null
            },
            "BIBREF26": {
                "ref_id": "b26",
                "title": "Free associations and dominance ratings of homophones for young and older adults",
                "authors": [
                    {
                        "first": "K",
                        "middle": [],
                        "last": "White",
                        "suffix": ""
                    },
                    {
                        "first": "L",
                        "middle": [],
                        "last": "Abrams",
                        "suffix": ""
                    }
                ],
                "year": 2004,
                "venue": "Behaviour Research Methods, Instruments and Computers",
                "volume": "36",
                "issue": "",
                "pages": "408--420",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "K. White and L. Abrams. 2004. Free associations and dominance ratings of homophones for young and older adults. Behaviour Research Methods, Instru- ments and Computers, 36:408-420.",
                "links": null
            },
            "BIBREF27": {
                "ref_id": "b27",
                "title": "Evaluating sense disambiguation across diverse parameter spaces",
                "authors": [
                    {
                        "first": "D",
                        "middle": [],
                        "last": "Yarowsky And R Florian",
                        "suffix": ""
                    }
                ],
                "year": 2002,
                "venue": "Natural Language Engineering",
                "volume": "8",
                "issue": "4",
                "pages": "293--310",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "D. Yarowsky and R Florian. 2002. Evaluating sense disambiguation across diverse parameter spaces. Natural Language Engineering, 8(4):293-310.",
                "links": null
            }
        },
        "ref_entries": {
            "FIGREF0": {
                "num": null,
                "text": "Figure 1: Correlations for window-based and windowless measures on a 10 million word corpus",
                "uris": null,
                "fig_num": "1",
                "type_str": "figure"
            },
            "FIGREF1": {
                "num": null,
                "text": "Figure 2: Agreement of computational measures with strongest human responses",
                "uris": null,
                "fig_num": "2",
                "type_str": "figure"
            },
            "TABREF0": {
                "content": "<table><tr><td>Name</td><td>Origin</td><td colspan=\"2\">Cues Respondents</td></tr><tr><td>Kent</td><td>Kent &amp; Rosanoff (1910)</td><td>100</td><td>∼ 1000</td></tr><tr><td colspan=\"2\">Minnesota Russell &amp; Jenkins (1954)</td><td>100</td><td>∼ 1000</td></tr><tr><td>EAT</td><td>Kiss et al (1973)</td><td>8400</td><td>100</td></tr><tr><td>Florida</td><td>Nelson et al (1980)</td><td>5019</td><td>∼ 140</td></tr></table>",
                "type_str": "table",
                "text": "Human association datasets",
                "html": null,
                "num": null
            }
        }
    }
}