{
    "paper_id": "D09-1131",
    "header": {
        "generated_with": "S2ORC 1.0.0",
        "date_generated": "2023-06-16T12:35:11.413222Z"
    },
    "title": "Using Morphological and Syntactic Structures for Chinese Opinion Analysis",
    "authors": [
        {
            "first": "Lun-Wei",
            "middle": [],
            "last": "Ku",
            "suffix": "",
            "affiliation": {
                "laboratory": "",
                "institution": "National Taiwan University",
                "location": {
                    "addrLine": "No. 1, Sec. 4, Roosevelt Road",
                    "postCode": "10617",
                    "settlement": "Taipei",
                    "country": "Taiwan"
                }
            },
            "email": "lwku@nlg.csie.ntu.edu.tw"
        },
        {
            "first": "Ting-Hao",
            "middle": [],
            "last": "Huang",
            "suffix": "",
            "affiliation": {
                "laboratory": "",
                "institution": "National Taiwan University",
                "location": {
                    "addrLine": "No. 1, Sec. 4, Roosevelt Road",
                    "postCode": "10617",
                    "settlement": "Taipei",
                    "country": "Taiwan"
                }
            },
            "email": "thhuang@nlg.csie.ntu.edu.tw"
        },
        {
            "first": "Hsin-Hsi",
            "middle": [],
            "last": "Chen",
            "suffix": "",
            "affiliation": {
                "laboratory": "",
                "institution": "National Taiwan University",
                "location": {
                    "addrLine": "No. 1, Sec. 4, Roosevelt Road",
                    "postCode": "10617",
                    "settlement": "Taipei",
                    "country": "Taiwan"
                }
            },
            "email": "hhchen@ntu.edu.tw"
        }
    ],
    "year": "",
    "venue": null,
    "identifiers": {},
    "abstract": "This paper employs morphological structures and relations between sentence segments for opinion analysis on words and sentences. Chinese words are classified into eight morphological types by two proposed classifiers, CRF classifier and SVM classifier. Experiments show that the injection of morphological information improves the performance of the word polarity detection. To utilize syntactic structures, we annotate structural trios to represent relations between sentence segments. Experiments show that considering structural trios is useful for sentence opinion analysis. The best f-score achieves 0.77 for opinion word extraction, 0.62 for opinion word polarity detection, 0.80 for opinion sentence extraction, and 0.54 for opinion sentence polarity detection.",
    "pdf_parse": {
        "paper_id": "D09-1131",
        "_pdf_hash": "",
        "abstract": [
            {
                "text": "This paper employs morphological structures and relations between sentence segments for opinion analysis on words and sentences. Chinese words are classified into eight morphological types by two proposed classifiers, CRF classifier and SVM classifier. Experiments show that the injection of morphological information improves the performance of the word polarity detection. To utilize syntactic structures, we annotate structural trios to represent relations between sentence segments. Experiments show that considering structural trios is useful for sentence opinion analysis. The best f-score achieves 0.77 for opinion word extraction, 0.62 for opinion word polarity detection, 0.80 for opinion sentence extraction, and 0.54 for opinion sentence polarity detection.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Abstract",
                "sec_num": null
            }
        ],
        "body_text": [
            {
                "text": "Sentiment analysis has attracted much attention in recent years because a large scale of subjective information is disseminated through various platforms on the web. Sentiment information can be applied to a wide variety of fields, including product recommendation, review summarization, public polling, and so on.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "Opinion dictionaries are important resources for identifying subjective information. Several approaches were proposed to collect such resources. Wiebe (2000) learned subjective adjectives from corpora. Takamura et al. (2005) extracted semantic orientations of words. Ku et al. (2007) measured sentiment degrees of Chinese words by averaging the sentiment scores of the composing characters. When the opinion words are available, the polarities of sentences and documents can be determined by them. Riloff and Wiebe (2003) learned the extraction patterns for subjective expressions. Kim and Hovy (2004) found the polarity of subjective expressions. Pang et al. (2002) and Dave et al. (2003) explored various techniques at document level.",
                "cite_spans": [
                    {
                        "start": 145,
                        "end": 157,
                        "text": "Wiebe (2000)",
                        "ref_id": "BIBREF18"
                    },
                    {
                        "start": 202,
                        "end": 224,
                        "text": "Takamura et al. (2005)",
                        "ref_id": "BIBREF16"
                    },
                    {
                        "start": 267,
                        "end": 283,
                        "text": "Ku et al. (2007)",
                        "ref_id": "BIBREF10"
                    },
                    {
                        "start": 498,
                        "end": 521,
                        "text": "Riloff and Wiebe (2003)",
                        "ref_id": "BIBREF13"
                    },
                    {
                        "start": 582,
                        "end": 601,
                        "text": "Kim and Hovy (2004)",
                        "ref_id": "BIBREF9"
                    },
                    {
                        "start": 648,
                        "end": 666,
                        "text": "Pang et al. (2002)",
                        "ref_id": "BIBREF12"
                    },
                    {
                        "start": 671,
                        "end": 689,
                        "text": "Dave et al. (2003)",
                        "ref_id": "BIBREF7"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "Morphological information has been widely used in classifying words, telling the meanings, and doing other in-depth analysis (Tzeng and Chen, 2002) . However, morphological information was seldom applied either in Chinese opinion extraction, or in solving the coverage problem of opinion dictionary. Instead of bag-ofcharacters approach (Ku et al., 2007) , this paper employs morphological structures of words to extract opinion words.",
                "cite_spans": [
                    {
                        "start": 125,
                        "end": 147,
                        "text": "(Tzeng and Chen, 2002)",
                        "ref_id": "BIBREF17"
                    },
                    {
                        "start": 337,
                        "end": 354,
                        "text": "(Ku et al., 2007)",
                        "ref_id": "BIBREF10"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "Relations between sentence segments are also defined by linguistics in the Chinese language. These are similar to morphological structures between Chinese characters. Based on parsing trees of sentences, we identify these relations and utilize them for opinion analysis on sentences.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "As the experimental corpus, some researchers managed to generate annotated materials and gold standards under many constraints. Ku set a standard for generating final answers from annotations of multiple annotators (Ku et al., 2007) , and Somasundaran annotated discourse information from meeting dialogs to train a sentiment model (Somasundaran et al., 2007) . For multilingual issues, researchers concerned mainly about the applicability of corpus and algorithms from the native language to foreign languages (Banea et al., 2008; Bautin et al., 2008) .",
                "cite_spans": [
                    {
                        "start": 215,
                        "end": 232,
                        "text": "(Ku et al., 2007)",
                        "ref_id": "BIBREF10"
                    },
                    {
                        "start": 332,
                        "end": 359,
                        "text": "(Somasundaran et al., 2007)",
                        "ref_id": "BIBREF15"
                    },
                    {
                        "start": 511,
                        "end": 531,
                        "text": "(Banea et al., 2008;",
                        "ref_id": "BIBREF0"
                    },
                    {
                        "start": 532,
                        "end": 552,
                        "text": "Bautin et al., 2008)",
                        "ref_id": "BIBREF1"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "Several opinion analysis systems have been developed so far. OASYS (Cesarano et al., 2007) and CopeOpi (Ku et al., 2007) allow users input their queries and select preferred data sources, and then track opinions in a time zone. For both systems, extracting opinions is the main focus, while holders and targets are identified implicitly when retrieving relevant documents. Carenini's team proposed a graphical user interface for evaluative texts (2006) , in which color blocks were used to present the evaluations for components of products. Fair News Reader, a Japanese news Web system, incorporates sentiment information insensibly in an interesting way (Kawai et al., 2007) . It provides readers \"balanced\" reports by analyzing the sentiment in news articles which readers have read, and suggests them new articles according to the analysis results. It leads the application of opinion analysis to the direction of personalization.",
                "cite_spans": [
                    {
                        "start": 67,
                        "end": 90,
                        "text": "(Cesarano et al., 2007)",
                        "ref_id": "BIBREF3"
                    },
                    {
                        "start": 103,
                        "end": 120,
                        "text": "(Ku et al., 2007)",
                        "ref_id": "BIBREF10"
                    },
                    {
                        "start": 446,
                        "end": 452,
                        "text": "(2006)",
                        "ref_id": null
                    },
                    {
                        "start": 656,
                        "end": 676,
                        "text": "(Kawai et al., 2007)",
                        "ref_id": "BIBREF8"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "In the Chinese language, a word is composed of one or more Chinese characters, and its meaning can be interpreted in terms of its composite characters. The morphological structures of Chinese words are formulated by three major processes in linguistics: compounding, affixation, and conversion.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Chinese Morphological Structures",
                "sec_num": "2"
            },
            {
                "text": "Compounding is a complex wordformation process. In most cases, two or more morphemes together are formed as a lexical item by this process. Affixation is a morphological process, by which grammatical or lexical information is added to a base form. By the conversion process, a word is changed from one part of speech into another without the addition or deletion of any morphemes.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Chinese Morphological Structures",
                "sec_num": "2"
            },
            {
                "text": "Compounding is the most productive way to construct a Chinese word. Mostly, a Chinese character itself carries meanings, so that a morpheme can function as a character and has its own part of speech. In some cases, a Chinese morpheme may carry no specific meaning and just makes a word more readable. Cheng and Tian (1992) divided Chinese words into five morphological types based on the relations between the morphemes in compounding words.",
                "cite_spans": [
                    {
                        "start": 301,
                        "end": 322,
                        "text": "Cheng and Tian (1992)",
                        "ref_id": "BIBREF6"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Chinese Morphological Structures",
                "sec_num": "2"
            },
            {
                "text": "(1) Parallel Type: Two morphemes play coordinate roles in a word. For example, the morphemes \"財\" (money) and \"富\" (wealth) are parallel in the word \"財富\" (money-wealth).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Chinese Morphological Structures",
                "sec_num": "2"
            },
            {
                "text": "(2) Substantive-Modifier Type: A modified morpheme follows a modifying morpheme. For example, the morpheme \"哭\" (cry) is modified by \"痛\" (bitterly) in the word \"痛哭\" (bitterlycry).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Chinese Morphological Structures",
                "sec_num": "2"
            },
            {
                "text": "(3) Subjective-Predicate Type: One morpheme is an expresser and the other one is described. The structure is like a subject-verb sentence condensed in one word. For example, the morpheme \"心\" (heart) is a subject of the predicate \"疼\" (hurt) in the word \"心疼\" (heart-hurt).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Chinese Morphological Structures",
                "sec_num": "2"
            },
            {
                "text": "(4) Verb-Object Type: The first morpheme is usually a verb which governs the second one, making this word similar to a verb followed by its object. For example, the morpheme \" 控 \" (control) serves as the object of the verb \"失\" (lose) in the word \"失控\" (lose-control).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Chinese Morphological Structures",
                "sec_num": "2"
            },
            {
                "text": "(5) Verb-Complement Type: The first morpheme is usually a verb but sometimes can be an adjective, and the second morpheme explains the first one from different aspects. For example, the morpheme \"清\" (clearly) expresses the aspects of the action \"看\" (look).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Chinese Morphological Structures",
                "sec_num": "2"
            },
            {
                "text": "Chinese words constructed by affixation process can be one of the two cases -say, morpheme and morpheme, or morpheme and non-morpheme. In the case of morpheme and morpheme, the affixation word belongs to one of the above 5 types if the prefix and the suffix are neither negations nor confirmations. Types 6 and 7 defined below represent the affixation words whose prefix or suffix is a negation or a confirmation. The affixation words whose prefix or suffix characters are not morphemes are classified into type 8. (6) Negation Type: There is at least one negation character in words of this type. For example, the prefix \"無\" (no) is the negation morpheme in the word \"無法\" (no-method).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Chinese Morphological Structures",
                "sec_num": "2"
            },
            {
                "text": "(7) Confirmation Type: There is at least one confirmation character in words of this type. For example, the prefix \"有\" (do) is a confirmation in the word \"有賴\" (do-depend on).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Chinese Morphological Structures",
                "sec_num": "2"
            },
            {
                "text": "(8) Others: Those words that do not belong to the above seven types are assigned to this type, such as words whose meanings are not a function of their composite characters, words whose composite characters are not morphemes, such as \"姪 子\" (nephew-suffix) and \"薄荷\" (peppermint).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Chinese Morphological Structures",
                "sec_num": "2"
            },
            {
                "text": "The bag-of-characters approach proposed by Ku et al. (2007) considers the observation probabilities of characters in Chinese opinion words. It calculates the observation probabilities of characters from a set of seeds first, then dynamically enlarges the set and adjusts their probabilities. In this approach, the opinion score of a word is determined by the combination of the observation probabilities of its composite characters defined by Formulas (1) and (2).",
                "cite_spans": [
                    {
                        "start": 43,
                        "end": 59,
                        "text": "Ku et al. (2007)",
                        "ref_id": "BIBREF10"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Opinion Scores of Chinese Words",
                "sec_num": "3"
            },
            {
                "text": "EQUATION",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [
                    {
                        "start": 0,
                        "end": 8,
                        "text": "EQUATION",
                        "ref_id": "EQREF",
                        "raw_str": "∑ ∑ ∑ = = = + = m i i n i i n i i neg , C f / neg , C f pos , C f / pos , C f pos , C f / pos , C f pos C P 1 1 1 ) ( ) ( ) ( ) ( ) ( ) ( ) , (",
                        "eq_num": "(1)"
                    }
                ],
                "section": "Opinion Scores of Chinese Words",
                "sec_num": "3"
            },
            {
                "text": "EQUATION",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [
                    {
                        "start": 0,
                        "end": 8,
                        "text": "EQUATION",
                        "ref_id": "EQREF",
                        "raw_str": "∑ ∑ ∑ = = = + = m i i n i i m i i neg , C f / neg , C f pos , C f / pos , C f neg , C f / neg , C f neg C P 1 1 1 ) ( ) ( ) ( ) ( ) ( ) ( ) , (",
                        "eq_num": "(2)"
                    }
                ],
                "section": "Opinion Scores of Chinese Words",
                "sec_num": "3"
            },
            {
                "text": ") , ( ) , ( ) ( neg C N pos C P C S - = (3) ) ( 1 ) ... ( 1 2 1 ∑ = = l i i l C S l C C C S (4)",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Opinion Scores of Chinese Words",
                "sec_num": "3"
            },
            {
                "text": "where C is an arbitrary Chinese character, f(C, polarity) counts the observed frequency of C in a set of Chinese words whose opinion polarity is positive (pos) or negative (neg); P(C, pos) and P(C, neg) denote the observation probabilities of C as a positive and a negative character, and n and m denote total number of unique characters in positive and negative words. The difference of P(C, pos) and P(C, neg) in Formula (3) determines the sentiment score of character C, denoted by S(C). Formula (4) computes the opinion score of a word of l characters C 1 C 2 …C l by averaging their scores.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Opinion Scores of Chinese Words",
                "sec_num": "3"
            },
            {
                "text": "Instead of counting the weights as in the bagof-characters approaches, we consider the word structures and propose a scoring function for each morphological type. According to the Frequency Dictionary of Modern Chinese, 96.5% of Chinese words are unigrams and bigrams (Chen, et al., 1997) . In the following functions, S(C 1 C 2 ) computes the opinion scores of words with characters C 1 and C 2 . SIGN(s) returns -1 if polarity degree s is smaller than 0, i.e., negative, and returns 1 when positive.",
                "cite_spans": [
                    {
                        "start": 268,
                        "end": 288,
                        "text": "(Chen, et al., 1997)",
                        "ref_id": "BIBREF5"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Opinion Scores of Chinese Words",
                "sec_num": "3"
            },
            {
                "text": "(1) Parallel Type: Since the two composite characters of a word of this type are homogeneous, the opinion score is the average score of two characters' opinion scores. ",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Opinion Scores of Chinese Words",
                "sec_num": "3"
            },
            {
                "text": ") ( ) ( ) ( 2 1 2 1 C S C S C C S + =",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Opinion Scores of Chinese Words",
                "sec_num": "3"
            },
            {
                "text": "(5)",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Opinion Scores of Chinese Words",
                "sec_num": "3"
            },
            {
                "text": "(2) Substantive-Modifier Type: The first morpheme of a word of this type modifies the second one, so that its opinion weight comes from the absolute opinion score of the first character, while the opinion polarity is determined by the occurrence of negative opinion characters. If at least one negative opinion character appears, the word is negative, else it is positive. For example, the word \"痛哭\" (bitterly cry) is composed of \"痛\" (bitterly, negative) and \"哭\" (cry, negative). Negative characters make this word negative and its opinion strength, i.e., the absolute value of the score, is decided by the first character for the degree of crying.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Opinion Scores of Chinese Words",
                "sec_num": "3"
            },
            {
                "text": ") ( ) ( ) ( else ) ( 1 - ) ( else ) ( ) ( then ) 0 ) ( and 0 ) ( ( if then ) 0 ) ( and 0 ) ( ( if 2 1 2 1 1 2 1 1 2 1 2 1 2 1 C S C S C C S C S C C S C S C C S C S C S C S C S + = × = = > > ≠ ≠ (6)",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Opinion Scores of Chinese Words",
                "sec_num": "3"
            },
            {
                "text": "(3) Subjective-Predicate Type: The first morpheme of a word of this type is a subject and the second morpheme is the action it performs, so that the action decides the opinion score of the word. If the action is not an opinion or it is neutral, the subject determines the opinion score of this word. For example, the word \"山崩\" (mudslide, negative) is composed of \"山\" (mountain, non-opinion) and \"崩\" (collapse, negative). Its opinion score depends only on the second character \"崩\" (collapse) since the first character is a subject and usually bears no opinions.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Opinion Scores of Chinese Words",
                "sec_num": "3"
            },
            {
                "text": "EQUATION",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [
                    {
                        "start": 0,
                        "end": 8,
                        "text": "EQUATION",
                        "ref_id": "EQREF",
                        "raw_str": ") ( ) ( else ) ( ) ( then ) 0 ) ( ( if 1 2 1 2 2 1 2 C S C C S C S C C S C S = = ≠",
                        "eq_num": "(7)"
                    }
                ],
                "section": "Opinion Scores of Chinese Words",
                "sec_num": "3"
            },
            {
                "text": "(4) Verb-Object Type: The first morpheme of words of this type acts upon the second morpheme. The effect depends not only on the action but on the target. The weight is determined by the action, but the polarity is the multiplication of the signs of the two morphemes. For example, the word \" 避暑\" (to go away for the summer, positive) is composed of \"避\" (hide, negative) and \"暑\" (hot summer, negative). Its strength depends on the strength of \"避\" (hide) and polarity is positive from the multiplication of two negatives.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Opinion Scores of Chinese Words",
                "sec_num": "3"
            },
            {
                "text": ") ( ) ( ) ( else )) ( ( )) ( ( ) ( ) ( then ) 0 ) ( and 0 ) ( ( if 2 1 2 1 2 1 1 2 1 2 1 C S C S C C S C S SIGN C S SIGN C S C C S C S C S + = × × = ≠ ≠ (8)",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Opinion Scores of Chinese Words",
                "sec_num": "3"
            },
            {
                "text": "(5) Verb-Complement Type: The scoring function for words of this type is defined the same as that of a Subjective-Predicate type in Formula (7). The complement morpheme is the deciding factor of the opinion score. For example, the word \" 提高\" (raise, positive) is composed of \"提\" (carry or lift, non-opinion) and \"高\" (high, positive). The complement morpheme \" 高 \" (high) describes the resulting state of the verb morpheme \"提\" (raise), so both strength and polarity depend on the morpheme \"高\" (high).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Opinion Scores of Chinese Words",
                "sec_num": "3"
            },
            {
                "text": "(6) Negation Type: A negative character specified in a predefined set NC has a negation effect on the opinion score of the other character. The strength depends on the modified morpheme while the polarity of the word is the negation of the polarity of the modified morpheme.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Opinion Scores of Chinese Words",
                "sec_num": "3"
            },
            {
                "text": ") ( 1 ) ( else ) ( 1 ) ( then ) ( if 1 2 1 2 2 1 1 C S C C S C S C C S NC C × - = × - = ∈ (9)",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "( ) ( )",
                "sec_num": null
            },
            {
                "text": "(7) Confirmation Type: A positive character specified in a predefined set PC ensures that the opinion score of a word only comes from the other character. Therefore, the opinion score of this word is determined by the modified morpheme.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "( ) ( )",
                "sec_num": null
            },
            {
                "text": ") ( ) ( else ) ( ) ( then ) ( if 1 2 1 2 2 1 1 C S C C S C S C C S PC C = = ∈",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "( ) ( )",
                "sec_num": null
            },
            {
                "text": "(10) (8) Others: Since words of this type contain no clear cues for their morphological structures, we postulate that both characters have the same contribution, and adopt Formula (5).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "( ) ( )",
                "sec_num": null
            },
            {
                "text": "To compute the opinion score of a word according to formulae in Section 3, we must know its morphological type from the morphological structure, i.e., the parts of speech of the composite morphemes. Currently, part of speech tagging is performed at the word level rather than the morpheme level, and morpheme-tagging corpus is not available. We consider an on-line Chinese dictionary, Dictionary of Chinese Words by Ministry of Education, Taiwan (MOEDCW), as a corpus, and compute the statistics of each morpheme in it.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Identification of Morphological Types",
                "sec_num": "4"
            },
            {
                "text": "Two classifiers, CRF classifier and SVM classifier are proposed to recognize morphological types (1)-( 5). Morphological types (6) to (8) are determined by rules such as whether two composite characters are morphemes; whether there are confirmation/negation morphemes; and so on.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Identification of Morphological Types",
                "sec_num": "4"
            },
            {
                "text": "MOEDCW corpus provides possible parts of speech for each morpheme by treating it as a unigram word, and possible senses under each part of speech. In each entry, there are a sense defini-tion and some example words. Figures 1 and 2 show the specifications of two morphemes \"冒\" and \"汗\". The morpheme \"冒\" has three parts of speech (verb, adverb and noun) and includes 3, 1, and 1 senses. There are 3, 3, and 2 example words listed under the three verb senses.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 224,
                        "end": 225,
                        "text": "1",
                        "ref_id": null
                    },
                    {
                        "start": 230,
                        "end": 231,
                        "text": "2",
                        "ref_id": "FIGREF1"
                    }
                ],
                "eq_spans": [],
                "section": "MOEDCW Corpus",
                "sec_num": "4.1"
            },
            {
                "text": "We can find the correct parts of speech of the composite characters of a word when it is an example word in the dictionary. However, not all words are listed in the corpus. Consider the word \"冒汗\" (sweat, verb). Figure 1 shows that \"冒汗\" (sweat) is an example word listed under the verb sense of the character \"冒\" (perspire), thus the character \"冒\" (perspire) in the word \"冒 汗\" (sweat) functions as a verb. However, \"冒 汗\" (sweat) is not an example for the character \"汗\" (sweat). Figure 2 show that there are two possible parts of speech, noun and verb, for the character \"汗\" (sweat). We then show how to identify its function in the word \"冒汗\".",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 218,
                        "end": 219,
                        "text": "1",
                        "ref_id": null
                    },
                    {
                        "start": 484,
                        "end": 485,
                        "text": "2",
                        "ref_id": "FIGREF1"
                    }
                ],
                "eq_spans": [],
                "section": "MOEDCW Corpus",
                "sec_num": "4.1"
            },
            {
                "text": "Goes out from the button to the top or from inside to outside. For example, fume, smoking, and sweat. 由下往上或 The number of possible meanings one character can bear when it functions as a certain part of speech is employed to estimate how often this part of speech is used. The function T(C, POS) shown in Formula (11) defines the score of a character C functioning as a particular part of speech POS. Here, POS may be noun (N), adjective (ADJ), verb (V), adverb (ADV), auxiliary (AUX), conjunction (CONJ), pronoun (PRON), preposition (PREP), and interjection (INT). In Figure 2 , T(汗<sweat>, N) = 2 and T(汗<sweat>, V) = 1.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 575,
                        "end": 576,
                        "text": "2",
                        "ref_id": "FIGREF1"
                    }
                ],
                "eq_spans": [],
                "section": "1",
                "sec_num": null
            },
            {
                "text": "往 外 透 出 、 發 散 。 如 ： 「 冒 煙 」 、 「冒氣」、",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "1",
                "sec_num": null
            },
            {
                "text": "Features for training SVM and CRF classifiers include the pronunciation and the tone of the word, parts of speech of the first and the second characters of training words, and the position information of the composite characters. The tone of the word is acquired from MOEDCW. The parts of speech are estimated by Formula (11). f(C, POS, k, start/end) counts the number of k-grams (k=2, 3, 4). In Figures 1 and 2 ",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 404,
                        "end": 405,
                        "text": "1",
                        "ref_id": null
                    },
                    {
                        "start": 410,
                        "end": 411,
                        "text": "2",
                        "ref_id": "FIGREF1"
                    }
                ],
                "eq_spans": [],
                "section": "Features for Classifiers",
                "sec_num": "4.2"
            },
            {
                "text": ", f(冒, V, 2, start)=6, f(冒, V, 2, end)= 2, f(冒, ADV, 2, start) = 2,",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Features for Classifiers",
                "sec_num": "4.2"
            },
            {
                "text": "and f(冒, ADV, 2, end)=0. This example shows that when the character \"冒\" functions as a verb or an adverb, it serves as the starting character more often than the ending character.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Features for Classifiers",
                "sec_num": "4.2"
            },
            {
                "text": "CRF and SVM are both common used algorithms for building classifiers (Lafferty et al., 2001) . We adopted CRF++1 and libSVM (Chang and Lin, 2001) to develop our classifiers. The features for training our CRF and SVM classifiers include the input word W, the tone of W, the first and the second characters",
                "cite_spans": [
                    {
                        "start": 69,
                        "end": 92,
                        "text": "(Lafferty et al., 2001)",
                        "ref_id": "BIBREF11"
                    },
                    {
                        "start": 124,
                        "end": 145,
                        "text": "(Chang and Lin, 2001)",
                        "ref_id": "BIBREF4"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "CRF and SVM Classifier",
                "sec_num": "4.3"
            },
            {
                "text": "C 1 and C 2 , T(C 1 , POS), T(C 2 , POS), f(C 1 , POS, k, start), f(C 1 , POS, k, end), f(C 2 , POS, k, start), and f(C 2 , POS, k, end).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "CRF and SVM Classifier",
                "sec_num": "4.3"
            },
            {
                "text": "POS denotes one of nine parts of speech in MOEDCW, and k equals to 2, 3 or 4.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "CRF and SVM Classifier",
                "sec_num": "4.3"
            },
            {
                "text": "Using SVM is straightforward. To classify a word into one of the morphological structure types, we construct the word's feature vector and input the vector into SVM. When using CRF, a different approach is taken. When predicting the classes of two successive instances, CRF takes the predicted class of the first instance into account when predicting the second instance's class.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "CRF and SVM Classifier",
                "sec_num": "4.3"
            },
            {
                "text": "Here is how we exploit this capability. In a nutshell, we perform classification at the character level instead of the word level. Let W be a word composed of the two characters C 1 and C 2 . Let v be the feature vector of W. Let t be the morphological structure type of W. We define C 1 's feature vector to be composed of the features in v which are related to C 1 , e.g., T(C 1 , verb). Similarly, C 2 's feature vector is composed of the features in v which are related to C 2 . C 1 's class and C 2 's class are defined as t_1 and t_2, respectively. Since t has five possible values, there are 10 character classes.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "CRF and SVM Classifier",
                "sec_num": "4.3"
            },
            {
                "text": "To determine a word W's morphological structure type, we first apply CRF on W's constituent characters C 1 and C 2 's feature vectors. For C 1 , CRF will return a set of probabilities P(C 1 ,t_q), where q ∈ {1, 2}, indicating the likelihood of C 1 being an instance of class t_q. Similarly, a set of probabilities P(C 2 ,t_q) is returned for C 2 . W's morphological structure type is defined as the value of t which maximizes the product of P(C 1 ,t_1) and P(C 2 ,t_2).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "CRF and SVM Classifier",
                "sec_num": "4.3"
            },
            {
                "text": "Though CRF is mostly used for sequential labeling, the idea of using CRF is to tail this classification questions into a labeling question in order to utilizing the position information of characters. As mentioned, if a word W of two characters C1C2 is of type 1, CRF will label C1 1_1 (type1_1st char) and C2 1_2 (type1_2nd char). The labeling of each character considers both the previous character's features and the next character's features. That is, if the current character is the first character, its previous character is an empty character (which is used for segmenting sequences in CRF); if the current character is the second character, its next character is an empty character. Hence the position information will be considered by CRF.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "CRF and SVM Classifier",
                "sec_num": "4.3"
            },
            {
                "text": "Experiments verify whether the morphological types benefit opinion polarity detection on words. The relation between the performance of morphological classifiers and opinion polarity detection is discussed.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Experiments and Discussion",
                "sec_num": "5"
            },
            {
                "text": "To compare the bag-of-characters approach (Ku et al., 2007) with our morphological structure approach, we adopt the same evaluation data set containing 836 words. To evaluate the performance of our two morphological classifiers, we prepare two sets of words, including the testing set of 836 words for word-level opinion prediction (abbreviated as OP), and a set of 8,186 words selected from words in MOEDCW corpus and news documents except those can be classi-fied by patterns (abbreviated as TRAIN set), all with their morphological types annotated. Table 1 lists the distributions of morphological types in OP and TRAIN sets.",
                "cite_spans": [
                    {
                        "start": 42,
                        "end": 59,
                        "text": "(Ku et al., 2007)",
                        "ref_id": "BIBREF10"
                    }
                ],
                "ref_spans": [
                    {
                        "start": 558,
                        "end": 559,
                        "text": "1",
                        "ref_id": "TABREF0"
                    }
                ],
                "eq_spans": [],
                "section": "Experimental Setup",
                "sec_num": "5.1"
            },
            {
                "text": "The polarity of words is predicted by their opinion scores ranging between -1 to 1. We set a positive threshold. Those words with scores above it are considered as positive while those below this threshold multiplied by (-1) are regarded as negative. The words with non-zero scores falling between the positive and negative thresholds are neutral. Fifty grids from 0 to 0.5 are searched for the best threshold. Since the opinion extraction at word level concerns only word structure, no retraining for the best threshold is need when domain shifts, which is a superiority of our method.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Experimental Setup",
                "sec_num": "5.1"
            },
            {
                "text": "The performances of CRF and SVM classifiers on each morphological type are listed in Table 2 . We perform four-fold cross validation on the TRAIN set. Results show that CRF classifier achieves better performance than SVM classifier in this task. The accuracy of CRF classifier (0.70) is 8% higher than that of SVM classifier (0.62). Note those type 8 words which could be extracted by rules are excluded from classification experiment. The remaining type 8 words are usually proper names. It is difficult for both classifiers to identify such words. Table 3 further shows the performance of polarity prediction using morphological types de-termined by CRF classifier and SVM classifier. The performance of polarity detection is evaluated by the f-score defined in Formula ( 12).",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 91,
                        "end": 92,
                        "text": "2",
                        "ref_id": "TABREF1"
                    },
                    {
                        "start": 556,
                        "end": 557,
                        "text": "3",
                        "ref_id": "TABREF3"
                    }
                ],
                "eq_spans": [],
                "section": "Morphological Type Classification and Polarity Detection",
                "sec_num": "5.2"
            },
            {
                "text": "The f-scores of polarity detection using CRF classified types and SVM classified types are 0.5806 and 0.5938, respectively. Both of them outperform baseline's f-score 0.5455, i.e., the bag-of-characters approach (Ku et al., 2007) . Experiments show that adopting morphological types annotated by two classifiers for polarity prediction has little difference. In other words, CRF and SVM classifiers have an 8% f-score difference in their best performance of classification, while the performance gap in word polarity prediction using morphological types provided by these two classifiers is around 1.3% only (0.5806 vs. 0.5938). The reason may be that we define scoring functions of each morphological type in a straightforward way. If they are not the best scoring functions, the benefit of considering the morphological type information could be restricted. Nevertheless, experimental results show that morphological type information is useful for word polarity detection (with p-value less than 0.05).",
                "cite_spans": [
                    {
                        "start": 212,
                        "end": 229,
                        "text": "(Ku et al., 2007)",
                        "ref_id": "BIBREF10"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Morphological Type Classification and Polarity Detection",
                "sec_num": "5.2"
            },
            {
                "text": ") ( We further examine how well our polarity detection method works in combination with a word sentiment dictionary. We use the NTUSD2 word sentiment dictionary. If a word appears in NTUSD, then the word's polarity is the one specified in NTUSD. If a word does not appear in NTUSD, then the word's polarity is determined using our morphological type method. We further analyze the improvement of polarity prediction for each morphological type. We find that the f-scores of polarity prediction of all morphological types are improved in different degrees, and among them the performance of type 2 words are improved the most. We have shown that our method can assign an opinion score to an arbitrary word without any word thesauri by considering its morphological information.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Morphological Type Classification and Polarity Detection",
                "sec_num": "5.2"
            },
            {
                "text": "EQUATION",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [
                    {
                        "start": 0,
                        "end": 8,
                        "text": "EQUATION",
                        "ref_id": "EQREF",
                        "raw_str": ") ( ) ( opinion proposed polarity correct opinion correct P ∩ = , ) ( ) ( ) ( opinion gold polarity correct opinion correct R ∩ = , R P R P score f + ⋅ ⋅ = - 2 . (",
                        "eq_num": "12"
                    }
                ],
                "section": "Morphological Type Classification and Polarity Detection",
                "sec_num": "5.2"
            },
            {
                "text": ")",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Morphological Type Classification and Polarity Detection",
                "sec_num": "5.2"
            },
            {
                "text": "Moreover, since the Substantive-Modifier (type 2) is the most common way to form a new word in the Chinese language (Cheng and Tian, 1992) , the result presents the strength of our method in solving the coverage problem.",
                "cite_spans": [
                    {
                        "start": 116,
                        "end": 138,
                        "text": "(Cheng and Tian, 1992)",
                        "ref_id": "BIBREF6"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Morphological Type Classification and Polarity Detection",
                "sec_num": "5.2"
            },
            {
                "text": "As mentioned, the relations introduced in Section 2 exist not only within words, but also between sentence segments. Relations between sentence segments are represented by structural trios hereafter and will be introduced in next section. We have already shown that morphological types are useful when extracting opinion words and would like to further testify whether structural trios also benefit the opinion analysis on sentences. We annotate these relations manually, propose a method to identify these relations, and compare results of experimental settings using structural trios with those not using structural trios.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Syntactic Structure for Chinese Opinion Analysis",
                "sec_num": "6"
            },
            {
                "text": "Each node in a parsing tree dominates a word string in a sentence. Linguistics have shown that there are also five relations between sentence segments: Parallel, Substantive-Modifier, Subjective-Predicate, Verb-Object, and Verb-Complement, same as morphological types (1) to (5). Because parsing trees have hierarchical structures, we define a structural trio to represent a relation between two nodes as follows:",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Structural Trio",
                "sec_num": "6.1"
            },
            {
                "text": "(1) A structure trio contains two children nodes which bear a relation. (2) A structure trio contains one head node which is the nearest common parent of two children nodes in (1).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Structural Trio",
                "sec_num": "6.1"
            },
            {
                "text": "Figure 3 : Example of structural trios Figure 3 shows an example of a structure trio. It is a part of a parsing tree containing words \"取 得\" (obtain), \"可喜\" (happy), \"成果\" (results). Two structural trios are shown in this example. The lower one contains two children nodes \"可 喜\" (happy) and \"成果\" (results), and is labeled as Substantive-Modifier (S-M (2)) in their nearest common parent node, while the upper one contains two children nodes \"取得\" (obtain) and \"可喜成果\" (happy results), and is labeled as Verb-Object (V-O (4)).",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 7,
                        "end": 8,
                        "text": "3",
                        "ref_id": null
                    },
                    {
                        "start": 46,
                        "end": 47,
                        "text": "3",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "Structural Trio",
                "sec_num": "6.1"
            },
            {
                "text": "To experiment with structural trios, we need the parsing trees of all experimental sentences. For this purpose, we adopted Chinese Treebank 5.14 as the experimental materials. Chinese Treebank contains raw Chinese news documents together with their segmented, part of speech tagged, and parsed versions. The parsed documents are adopted in experiments utilizing structural trios, and the part of speech tagged documents are used in experiments not utilizing structural trios.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Experimental Corpus",
                "sec_num": "6.2"
            },
            {
                "text": "In Chinese Treebank, a unique ID is labeled on each sentence. For each sentence, we had three annotators label their opinions and then we generate the gold standard following NTCIR5 MOAT protocol (Seki et al., 2008) . We also annotated structure trios in Chinese Treebank. A total of 17,159 sentences are obtained after dropping some faulty sentences such as empty sentences and sentences composed of more than one parsing tree. The statistics of opinion sentences and structural trios in the constructed experimental materials are shown in Table 4 and Table 5 ",
                "cite_spans": [
                    {
                        "start": 196,
                        "end": 215,
                        "text": "(Seki et al., 2008)",
                        "ref_id": "BIBREF14"
                    }
                ],
                "ref_spans": [
                    {
                        "start": 547,
                        "end": 548,
                        "text": "4",
                        "ref_id": null
                    },
                    {
                        "start": 553,
                        "end": 560,
                        "text": "Table 5",
                        "ref_id": "TABREF4"
                    }
                ],
                "eq_spans": [],
                "section": "Experimental Corpus",
                "sec_num": "6.2"
            },
            {
                "text": "The aim of our experiments is to know how opinion analysis approach performs when morphological and syntactic structures are incorporated. They are compared with the bag-ofcharacter and bag-of-word approaches. We implemented the bag-of-word approach proposed by Ku et al. (2007) to show its performance on Chinese Treebank. In their approach, the opinion scores of words are summed to generate the opinion scores of sentences, and the negation words will negate the closest opinion words.",
                "cite_spans": [
                    {
                        "start": 262,
                        "end": 278,
                        "text": "Ku et al. (2007)",
                        "ref_id": "BIBREF10"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Experiment Setup",
                "sec_num": "6.3"
            },
            {
                "text": "Based on this approach, we further consider structural trios to experiment whether syntactic structures of sentences are beneficial for opinion analysis. Because the scoring functions may not be straight forward as those we have adopted for opinion word extraction, we did not design scoring functions for utilizing all types of structural trios. Instead, we emphasize their original opinion scores by multiplying a variable alpha to see whether these structures are important. In this paper, alpha equals five.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Experiment Setup",
                "sec_num": "6.3"
            },
            {
                "text": "We have shown that word morphological structures benefit the word opinion extraction. When we experiment on sentences, we also incorporate the word morphological structures to see whether they are also useful for opinion analysis on sentences. Five experimental settings are listed as below:",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Experiment Setup",
                "sec_num": "6.3"
            },
            {
                "text": "(1) bag[w]-bag[s]: structural information is not considered for both words and sentences. The bag-of-character approach is used to calculate the opinion scores of words, and the bag-of-word approach sentences.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Experiment Setup",
                "sec_num": "6.3"
            },
            {
                "text": "(2) struc[w]-bag[s]: morphological structures are utilized to calculate word opinion scores, but structural trios are not considered. The bag-of-word approach is used to calculate the opinion scores of sentences.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Experiment Setup",
                "sec_num": "6.3"
            },
            {
                "text": "(3) bag[w]-struc[s]: structural trios are considered for calculating sentence opinion scores, while the bag-of-character approach is used to calculate the opinion scores of words. (4) struc[w]-(m)struc[s]: both word morphological structures and manually labeled structural trios are adopted. ( 5) struc[w]-struc[s]: both morphological structure of words and system labeled structural trios are adopted. As we have shown that NTUSD is beneficial to the opinion analysis at word level, it is used as described in section 5.2 by default.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Experiment Setup",
                "sec_num": "6.3"
            },
            {
                "text": "Our system adopted CRF algorithm to label structural trios for setting (5). The content string and the part of speech of the current node, its parent node, its offspring nodes in the next three generations, together with the depth of the current node in the Chinese Treebank, are used as the features for each node in CRF. The cooccurrence of the current node and all its siblings are defined in CRF's template file. CRF will label whether the current node is the first child or the second child of a certain relation in a structural trio, or it is not part of any structural trios. A four-fold experiment is performed for the learning and testing of this labeling process by CRF.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Experiment Setup",
                "sec_num": "6.3"
            },
            {
                "text": "Table 6 shows the statistics of manually labeled structural trios in Chinese Treebank and identification performance of CRF. Table 7 shows the performance of five experiment settings described in Section 6.3. The experiment results show that the morphological structures of words do not have a large contribution for opinion sentence analysis (setting 1 vs. setting 2; setting 3 vs. setting 4). However, considering the structural trios improve the performance. By summarizing the experimental results in Section 5 and this section, we can conclude that considering the word morphological structures benefits the opinion polarity detection, but in the current approach its assistance to words does not propagate to sentences. Considering the syntactic structures, however, do help in opinion analysis both for the opinion sentence extraction and the polarity detection. The performance of opinion extraction boosts to an f-score 0.80 and the performance of polarity detection an f-score 0.54.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 6,
                        "end": 7,
                        "text": "6",
                        "ref_id": null
                    },
                    {
                        "start": 131,
                        "end": 132,
                        "text": "7",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "Results and Discussion",
                "sec_num": "6.4"
            },
            {
                "text": "However, the utilization of structure trios needs the parsing tree of sentences as the prior knowledge. Hence these two kinds of structural information may be suitable for different applications: structural trios for well written sentences such as those in the news articles, while the morphological structures for casually written sentences such as those appear in SMS messages or articles with limit length on the Web.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Results and Discussion",
                "sec_num": "6.4"
            },
            {
                "text": "Because there are no opinion experiments performed on Chinese Treebank, we mention the performance of Ku's approach (setting (1)) for opinion sentence extraction, f-score 0.6846, in NTCIR-7 MOAT task, on news articles, as a result for comparison. Their approach was ranked the second in this task, and the best team achieved an f-score 0.7453.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Results and Discussion",
                "sec_num": "6.4"
            },
            {
                "text": "This paper considers morphological and syntactic structures in analyzing Chinese opinion words and sentences. For morphological structures, eight Chinese morphological types are defined.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Conclusion and Future Work",
                "sec_num": "7"
            },
            {
                "text": "CRF classifier and SVM classifier for morphological type classification are proposed. Experiments show that CRF classifier achieves the best accuracy 0.70 in type classification, which is 8% better than SVM classifier. We further show that word morphological structures benefit the opinion word extraction significantly. With the help of the sentiment dictionary NTUSD, the f-score of opinion word extraction achieves 0.77 and the f-score of the word polarity detection achieves 0.62 when the word morphological types are provided by the SVM classifier. They are comparably better than bag-of-character approach and the dictionary based approach.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Conclusion and Future Work",
                "sec_num": "7"
            },
            {
                "text": "We defined structural trios to represent the relations between sentence segments and also extract these relations using CRF algorithm. Results show that considering structural trios benefits the opinion analysis on sentences. An fscore 0.80 for opinion extraction and an f-score 0.54 for polarity detection are achieved, which is a great improvement.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Conclusion and Future Work",
                "sec_num": "7"
            },
            {
                "text": "The opinion scoring functions for morphological types and structural trios are critical for polarity detection, and scoring functions for words determine the scoring functions for sentences. Now we define these functions intuitively based on linguistic rules, but learning methods like regression will be investigated in the future. Examining the interaction of cues from word and sentence levels on the opinion sentence extraction and the opinion polarity detection is our next goal.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Conclusion and Future Work",
                "sec_num": "7"
            },
            {
                "text": "http://crfpp.sourceforge.net/",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            },
            {
                "text": "http://nlg18.csie.ntu.edu.tw:8080/opinion/ After introducing a sentiment dictionary NTUSD",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            },
            {
                "text": ", CRF and SVM classifiers both achieve the f-score 0.77 for opinion word extraction, and achieve f-scores 0.61 and 0.62 for polarity detection, respectively. Note that if only NTUSD is used to extract opinion words by string matching, the f-score is only 0.44.3 http://nlg18.csie.ntu.edu.tw:8080/opinion/",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            },
            {
                "text": "http://www.ldc.upenn.edu/Catalog/CatalogEntry.jsp? catalogId=LDC2005T01",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            },
            {
                "text": "http://research.nii.ac.jp/ntcir/index-en.html",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            }
        ],
        "back_matter": [
            {
                "text": "Research of this paper was partially supported by National Science Council, Taiwan, under the contract NSC95-2221-E-002-265-MY3.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Acknowledgement",
                "sec_num": null
            }
        ],
        "bib_entries": {
            "BIBREF0": {
                "ref_id": "b0",
                "title": "Multilingual Subjectivity Analysis Using Machine Translation",
                "authors": [
                    {
                        "first": "C",
                        "middle": [],
                        "last": "Banea",
                        "suffix": ""
                    },
                    {
                        "first": "R",
                        "middle": [],
                        "last": "Mihalcea",
                        "suffix": ""
                    },
                    {
                        "first": "J",
                        "middle": [],
                        "last": "Wiebe",
                        "suffix": ""
                    },
                    {
                        "first": "S",
                        "middle": [],
                        "last": "Hassan",
                        "suffix": ""
                    }
                ],
                "year": 2008,
                "venue": "Proceedings of Empirical Methods in Natural Language Processing",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Banea, C., Mihalcea, R., Wiebe, J. and Hassan, S. 2008. Multilingual Subjectivity Analysis Using Machine Translation. In Proceedings of Empirical Methods in Natural Language Processing (EMNLP 2008).",
                "links": null
            },
            "BIBREF1": {
                "ref_id": "b1",
                "title": "International sentiment analysis for news and blogs",
                "authors": [
                    {
                        "first": "M",
                        "middle": [],
                        "last": "Bautin",
                        "suffix": ""
                    },
                    {
                        "first": "L",
                        "middle": [],
                        "last": "Vijayarenu",
                        "suffix": ""
                    },
                    {
                        "first": "S",
                        "middle": [],
                        "last": "Skiena",
                        "suffix": ""
                    }
                ],
                "year": 2008,
                "venue": "Proceedings of the International Conference on Weblogs and Social Media (ICWSM)",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Bautin, M., Vijayarenu, L. and Skiena, S. 2008. Inter- national sentiment analysis for news and blogs. In Proceedings of the International Conference on Weblogs and Social Media (ICWSM).",
                "links": null
            },
            "BIBREF2": {
                "ref_id": "b2",
                "title": "Interactive Multimedia Summaries of Evaluative Text",
                "authors": [
                    {
                        "first": "G",
                        "middle": [],
                        "last": "Carenini",
                        "suffix": ""
                    },
                    {
                        "first": "R",
                        "middle": [
                            "T"
                        ],
                        "last": "Ng",
                        "suffix": ""
                    },
                    {
                        "first": "A",
                        "middle": [],
                        "last": "Pauls",
                        "suffix": ""
                    }
                ],
                "year": 2006,
                "venue": "Proceedings of the 11th International Conference on Intelligent User Interfaces",
                "volume": "",
                "issue": "",
                "pages": "124--131",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Carenini, G., Ng, R. T. and Pauls, A. 2006. Interactive Multimedia Summaries of Evaluative Text. In Pro- ceedings of the 11th International Conference on Intelligent User Interfaces (pp. 124-131), Sydney, Australia.",
                "links": null
            },
            "BIBREF3": {
                "ref_id": "b3",
                "title": "The OASYS 2.0 Opinion Analysis System",
                "authors": [
                    {
                        "first": "C",
                        "middle": [],
                        "last": "Cesarano",
                        "suffix": ""
                    },
                    {
                        "first": "A",
                        "middle": [],
                        "last": "Picariello",
                        "suffix": ""
                    },
                    {
                        "first": "D",
                        "middle": [],
                        "last": "Reforgiato",
                        "suffix": ""
                    },
                    {
                        "first": "V",
                        "middle": [
                            "S"
                        ],
                        "last": "Subrahmanian",
                        "suffix": ""
                    }
                ],
                "year": 2007,
                "venue": "Demo in Proceedings of International Conference on Weblogs and Social Media",
                "volume": "",
                "issue": "",
                "pages": "313--314",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Cesarano, C., Picariello, A., Reforgiato, D. and Subrahmanian, V.S. 2007. The OASYS 2.0 Opin- ion Analysis System. Demo in Proceedings of In- ternational Conference on Weblogs and Social Media (pp. 313-314), Boulder, CO USA.",
                "links": null
            },
            "BIBREF4": {
                "ref_id": "b4",
                "title": "LIBSVM: a library for support vector machines",
                "authors": [
                    {
                        "first": "Chih-Chung And",
                        "middle": [],
                        "last": "Chang",
                        "suffix": ""
                    },
                    {
                        "first": "Chih-Jen",
                        "middle": [],
                        "last": "Lin",
                        "suffix": ""
                    }
                ],
                "year": 2001,
                "venue": "",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Chang, Chih-Chung and Lin, Chih-Jen. 2001. LIBSVM: a library for support vector machines, http://www.csie.ntu.edu.tw/~cjlin/libsvm",
                "links": null
            },
            "BIBREF5": {
                "ref_id": "b5",
                "title": "Chinese Text Retrieval without Using a Dictionary",
                "authors": [
                    {
                        "first": "A",
                        "middle": [],
                        "last": "Chen",
                        "suffix": ""
                    },
                    {
                        "first": "L",
                        "middle": [],
                        "last": "Xu",
                        "suffix": ""
                    },
                    {
                        "first": "F",
                        "middle": [
                            "C"
                        ],
                        "last": "Gey",
                        "suffix": ""
                    },
                    {
                        "first": "J",
                        "middle": [],
                        "last": "Meggs",
                        "suffix": ""
                    }
                ],
                "year": 1997,
                "venue": "ACM SIGIR Forum",
                "volume": "31",
                "issue": "",
                "pages": "42--49",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Chen, A., Xu, L., Gey, F.C. and Meggs, J. 1997. Chi- nese Text Retrieval without Using a Dictionary. ACM SIGIR Forum, Volume 31, Issue SI (pp. 42- 49).",
                "links": null
            },
            "BIBREF6": {
                "ref_id": "b6",
                "title": "Modern Chinese",
                "authors": [
                    {
                        "first": "X.-H",
                        "middle": [],
                        "last": "Cheng",
                        "suffix": ""
                    },
                    {
                        "first": "X.-L",
                        "middle": [],
                        "last": "Tian",
                        "suffix": ""
                    }
                ],
                "year": 1992,
                "venue": "",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Cheng, X.-H. and Tian, X.-L. 1992. Modern Chinese. Bookman Books Ltd.",
                "links": null
            },
            "BIBREF7": {
                "ref_id": "b7",
                "title": "Mining the Peanut Gallery: Opinion Extraction and Semantic Classification of Product Reviews",
                "authors": [
                    {
                        "first": "K",
                        "middle": [],
                        "last": "Dave",
                        "suffix": ""
                    },
                    {
                        "first": "S",
                        "middle": [],
                        "last": "Lawrence",
                        "suffix": ""
                    },
                    {
                        "first": "D",
                        "middle": [
                            "M"
                        ],
                        "last": "Pennock",
                        "suffix": ""
                    }
                ],
                "year": 2003,
                "venue": "Proc. of the 12th International WWW Conference",
                "volume": "",
                "issue": "",
                "pages": "519--528",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Dave, K., Lawrence, S., and Pennock, D.M. 2003. Mining the Peanut Gallery: Opinion Extraction and Semantic Classification of Product Reviews. In Proc. of the 12th International WWW Confer- ence (pp. 519-528).",
                "links": null
            },
            "BIBREF8": {
                "ref_id": "b8",
                "title": "Fair News Reader: Recommending news articles with different sentiments based on user preference",
                "authors": [
                    {
                        "first": "Y",
                        "middle": [],
                        "last": "Kawai",
                        "suffix": ""
                    },
                    {
                        "first": "T",
                        "middle": [],
                        "last": "Kumamoto",
                        "suffix": ""
                    },
                    {
                        "first": "K",
                        "middle": [],
                        "last": "Tanaka",
                        "suffix": ""
                    }
                ],
                "year": 2007,
                "venue": "Proceedings of Knowledge-Based Intelligent Information and Engineering Systems (KES)",
                "volume": "",
                "issue": "",
                "pages": "612--622",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Kawai, Y., Kumamoto, T. and Tanaka, K. 2007. Fair News Reader: Recommending news articles with different sentiments based on user preference. In Proceedings of Knowledge-Based Intelligent In- formation and Engineering Systems (KES), No. 4692 in Lecture Notes in Computer Science (pp. 612-622).",
                "links": null
            },
            "BIBREF9": {
                "ref_id": "b9",
                "title": "Determining the Sentiment of Opinions",
                "authors": [
                    {
                        "first": "S.-M",
                        "middle": [],
                        "last": "Kim",
                        "suffix": ""
                    },
                    {
                        "first": "E",
                        "middle": [],
                        "last": "Hovy",
                        "suffix": ""
                    }
                ],
                "year": 2004,
                "venue": "Proc. of the 20th ICCL",
                "volume": "",
                "issue": "",
                "pages": "1367--1373",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Kim, S.-M. and Hovy, E. 2004. Determining the Sen- timent of Opinions. In Proc. of the 20th ICCL (pp. 1367-1373).",
                "links": null
            },
            "BIBREF10": {
                "ref_id": "b10",
                "title": "Journal of American Society for Information Science and Technology, Special Issue on Mining Web Resources for Enhancing Information Retrieval",
                "authors": [
                    {
                        "first": "L.-W",
                        "middle": [],
                        "last": "Ku",
                        "suffix": ""
                    },
                    {
                        "first": "H.-H",
                        "middle": [],
                        "last": "Chen",
                        "suffix": ""
                    }
                ],
                "year": 2007,
                "venue": "",
                "volume": "58",
                "issue": "",
                "pages": "1838--1850",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Ku, L.-W. and Chen, H.-H. 2007. Mining Opinions from the Web: Beyond Relevance Retrieval. Jour- nal of American Society for Information Science and Technology, Special Issue on Mining Web Re- sources for Enhancing Information Retrieval, 58(12), 1838-1850.",
                "links": null
            },
            "BIBREF11": {
                "ref_id": "b11",
                "title": "Conditional Random Fields: Probabilistic Models for Segmenting and Labeling Sequence Data",
                "authors": [
                    {
                        "first": "J",
                        "middle": [],
                        "last": "Lafferty",
                        "suffix": ""
                    },
                    {
                        "first": "A",
                        "middle": [],
                        "last": "Mccallum",
                        "suffix": ""
                    },
                    {
                        "first": "F",
                        "middle": [],
                        "last": "Pereira",
                        "suffix": ""
                    }
                ],
                "year": 2001,
                "venue": "Proc. of ICML",
                "volume": "",
                "issue": "",
                "pages": "282--289",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Lafferty, J., McCallum, A. and Pereira, F. 2001. Con- ditional Random Fields: Probabilistic Models for Segmenting and Labeling Sequence Data, In Proc. of ICML (pp.282-289).",
                "links": null
            },
            "BIBREF12": {
                "ref_id": "b12",
                "title": "Thumbs up? Sentiment Classification Using Machine Learning Techniques",
                "authors": [
                    {
                        "first": "B",
                        "middle": [],
                        "last": "Pang",
                        "suffix": ""
                    },
                    {
                        "first": "L",
                        "middle": [],
                        "last": "Lee",
                        "suffix": ""
                    },
                    {
                        "first": "S",
                        "middle": [],
                        "last": "Vaithyanathan",
                        "suffix": ""
                    }
                ],
                "year": 2002,
                "venue": "Proc. of the 2002 Conference on EMNLP",
                "volume": "",
                "issue": "",
                "pages": "79--86",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Pang, B., Lee, L. and Vaithyanathan, S. 2002. Thumbs up? Sentiment Classification Using Machine Learning Techniques. In Proc. of the 2002 Confer- ence on EMNLP (pp. 79-86).",
                "links": null
            },
            "BIBREF13": {
                "ref_id": "b13",
                "title": "Learning Extraction Patterns for Subjective Expressions",
                "authors": [
                    {
                        "first": "E",
                        "middle": [],
                        "last": "Riloff",
                        "suffix": ""
                    },
                    {
                        "first": "J",
                        "middle": [],
                        "last": "Wiebe",
                        "suffix": ""
                    }
                ],
                "year": 2003,
                "venue": "Proc. of the 2003 Conference on EMNLP",
                "volume": "",
                "issue": "",
                "pages": "105--112",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Riloff, E. and Wiebe, J. 2003. Learning Extraction Patterns for Subjective Expressions. In Proc. of the 2003 Conference on EMNLP (pp. 105-112).",
                "links": null
            },
            "BIBREF14": {
                "ref_id": "b14",
                "title": "Overview of Multilingual Opinion Analysis Task at NTCIR-7",
                "authors": [
                    {
                        "first": "Y",
                        "middle": [],
                        "last": "Seki",
                        "suffix": ""
                    },
                    {
                        "first": "D",
                        "middle": [
                            "K"
                        ],
                        "last": "Evans",
                        "suffix": ""
                    },
                    {
                        "first": "L.-W",
                        "middle": [],
                        "last": "Ku",
                        "suffix": ""
                    },
                    {
                        "first": "L",
                        "middle": [],
                        "last": "Sun",
                        "suffix": ""
                    },
                    {
                        "first": "H.-H",
                        "middle": [],
                        "last": "Chen",
                        "suffix": ""
                    },
                    {
                        "first": "N",
                        "middle": [],
                        "last": "Kando",
                        "suffix": ""
                    }
                ],
                "year": 2008,
                "venue": "Proceedings of the 7th NTCIR Workshop Meeting on Evaluation of Information Access Technologies: Information Retrieval, Question Answering, and Cross-Lingual Information Access",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Seki, Y., Evans, D. K., Ku, L.-W., Sun, L., Chen, H.-H. and Kando, N. 2008. Overview of Multilingual Opinion Analysis Task at NTCIR-7. In Proceed- ings of the 7th NTCIR Workshop Meeting on Evaluation of Information Access Technologies: Information Retrieval, Question Answering, and Cross-Lingual Information Access.",
                "links": null
            },
            "BIBREF15": {
                "ref_id": "b15",
                "title": "Detecting arguing and sentiment in meetings",
                "authors": [
                    {
                        "first": "S",
                        "middle": [],
                        "last": "Somasundaran",
                        "suffix": ""
                    },
                    {
                        "first": "J",
                        "middle": [],
                        "last": "Ruppenhofer",
                        "suffix": ""
                    },
                    {
                        "first": "J",
                        "middle": [],
                        "last": "Wiebe",
                        "suffix": ""
                    }
                ],
                "year": 2007,
                "venue": "Proceedings of the SIGdial Workshop on Discourse and Dialogue",
                "volume": "8",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Somasundaran, S., Ruppenhofer, J. and Wiebe, J. 2007. Detecting arguing and sentiment in meetings. Proceedings of the SIGdial Workshop on Dis- course and Dialogue, 2007.8.6",
                "links": null
            },
            "BIBREF16": {
                "ref_id": "b16",
                "title": "Extracting Semantic Orientations of Words Using Spin Model",
                "authors": [
                    {
                        "first": "H",
                        "middle": [],
                        "last": "Takamura",
                        "suffix": ""
                    },
                    {
                        "first": "T",
                        "middle": [],
                        "last": "Inui",
                        "suffix": ""
                    },
                    {
                        "first": "M",
                        "middle": [],
                        "last": "Okumura",
                        "suffix": ""
                    }
                ],
                "year": 2005,
                "venue": "Proc. of the 43rd Annual Meeting of the ACL",
                "volume": "",
                "issue": "",
                "pages": "133--140",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Takamura, H., Inui, T. and Okumura, M. 2005. Ex- tracting Semantic Orientations of Words Using Spin Model. In Proc. of the 43rd Annual Meeting of the ACL (pp. 133-140).",
                "links": null
            },
            "BIBREF17": {
                "ref_id": "b17",
                "title": "Design of Chinese Morphological Analyzer",
                "authors": [
                    {
                        "first": "H",
                        "middle": [],
                        "last": "Tzeng",
                        "suffix": ""
                    },
                    {
                        "first": "K.-J",
                        "middle": [],
                        "last": "Chen",
                        "suffix": ""
                    }
                ],
                "year": 2002,
                "venue": "Proc. of the 1st SIGHAN Workshop on Chinese Language Processing",
                "volume": "18",
                "issue": "",
                "pages": "1--7",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Tzeng, H. and Chen, K.-J. 2002. Design of Chinese Morphological Analyzer. In Proc. of the 1st SIGHAN Workshop on Chinese Language Process- ing, vol.18, 1-7.",
                "links": null
            },
            "BIBREF18": {
                "ref_id": "b18",
                "title": "Learning Subjective Adjectives from Corpora",
                "authors": [
                    {
                        "first": "J",
                        "middle": [],
                        "last": "Wiebe",
                        "suffix": ""
                    }
                ],
                "year": 2000,
                "venue": "Proc. of the 17th National Conference on AAAI and Twelfth Conference on IAAI",
                "volume": "",
                "issue": "",
                "pages": "735--740",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Wiebe, J. 2000. Learning Subjective Adjectives from Corpora. In Proc. of the 17th National Conference on AAAI and Twelfth Conference on IAAI (pp. 735- 740).",
                "links": null
            }
        },
        "ref_entries": {
            "FIGREF0": {
                "num": null,
                "text": "2",
                "uris": null,
                "fig_num": null,
                "type_str": "figure"
            },
            "FIGREF1": {
                "num": null,
                "text": "Figure 1: Specification of \"冒\" in MOEDCW",
                "uris": null,
                "fig_num": "2",
                "type_str": "figure"
            },
            "TABREF0": {
                "content": "<table><tr><td>set/type</td><td>1</td><td>2</td><td>3</td><td>4</td><td>5</td><td>6</td><td>7</td><td>8</td></tr><tr><td>TRAIN</td><td colspan=\"4\">26.15 44.97 1.64 15.14</td><td>9.22</td><td>0</td><td>0</td><td>2.88</td></tr><tr><td>OP</td><td>45.8</td><td>24.4</td><td>1.3</td><td>7.9</td><td>8.0</td><td>2.3</td><td>0.5</td><td>9.8</td></tr><tr><td>MorphoType</td><td>1</td><td>2</td><td>3</td><td>4</td><td>5</td><td>8</td><td/><td>Accuracy</td></tr><tr><td>CRF</td><td>0.63</td><td>0.78</td><td>0.41</td><td>0.66</td><td>0.78</td><td>0.17</td><td/><td>0.70</td></tr><tr><td>SVM</td><td>0.49</td><td>0.73</td><td>0.22</td><td>0.52</td><td>0.55</td><td>0</td><td/><td>0.62</td></tr></table>",
                "type_str": "table",
                "text": "The Percentage of distribution for morphological types in TRAIN and OP sets",
                "html": null,
                "num": null
            },
            "TABREF1": {
                "content": "<table/>",
                "type_str": "table",
                "text": "The f-score of CRF and SVM classifiers",
                "html": null,
                "num": null
            },
            "TABREF3": {
                "content": "<table/>",
                "type_str": "table",
                "text": "Prediction with Morphological Types",
                "html": null,
                "num": null
            },
            "TABREF4": {
                "content": "<table><tr><td/><td/><td>Opinion</td><td colspan=\"2\">Non-Opinion</td></tr><tr><td/><td colspan=\"3\">Positive Neutral Negative</td><td/></tr><tr><td>#</td><td>6,380</td><td>1,537 9,631</td><td>1,714</td><td>7,528</td></tr><tr><td>%</td><td>66.24</td><td>15.96 56.13</td><td>17.80</td><td>43.87</td></tr><tr><td/><td colspan=\"4\">Table 4: Statistics of opinion sentences</td></tr><tr><td/><td>Trio Type</td><td>Number</td><td colspan=\"2\">Percentage %</td></tr><tr><td/><td>2</td><td>18,483</td><td colspan=\"2\">36.85</td></tr><tr><td/><td>3</td><td>13,687</td><td colspan=\"2\">27.29</td></tr><tr><td/><td>4</td><td>15,970</td><td colspan=\"2\">31.84</td></tr><tr><td/><td>5</td><td>965</td><td>1.92</td><td/></tr><tr><td/><td>Others</td><td>1,054</td><td>2.10</td><td/></tr><tr><td/><td>Total</td><td>50,159</td><td colspan=\"2\">100.00</td></tr></table>",
                "type_str": "table",
                "text": ". Statistics of structural trios",
                "html": null,
                "num": null
            }
        }
    }
}