{
    "paper_id": "E14-1023",
    "header": {
        "generated_with": "S2ORC 1.0.0",
        "date_generated": "2023-06-16T11:55:45.680539Z"
    },
    "title": "Frame Semantic Tree Kernels for Social Network Extraction from Text",
    "authors": [
        {
            "first": "Apoorv",
            "middle": [],
            "last": "Agarwal",
            "suffix": "",
            "affiliation": {
                "laboratory": "",
                "institution": "Columbia University",
                "location": {
                    "settlement": "New York",
                    "region": "NY",
                    "country": "USA"
                }
            },
            "email": "apoorv@cs.columbia.edu"
        },
        {
            "first": "Sriramkumar",
            "middle": [],
            "last": "Balasubramanian",
            "suffix": "",
            "affiliation": {
                "laboratory": "",
                "institution": "Columbia University",
                "location": {
                    "settlement": "New York",
                    "region": "NY",
                    "country": "USA"
                }
            },
            "email": ""
        },
        {
            "first": "Anup",
            "middle": [],
            "last": "Kotalwar",
            "suffix": "",
            "affiliation": {
                "laboratory": "",
                "institution": "Microsoft, Inc. Redmonad",
                "location": {
                    "region": "WA",
                    "country": "USA"
                }
            },
            "email": ""
        },
        {
            "first": "Jiehan",
            "middle": [],
            "last": "Zheng",
            "suffix": "",
            "affiliation": {},
            "email": ""
        },
        {
            "first": "Owen",
            "middle": [],
            "last": "Rambow",
            "suffix": "",
            "affiliation": {
                "laboratory": "",
                "institution": "CCLS Columbia University",
                "location": {
                    "settlement": "New York",
                    "region": "NY",
                    "country": "USA"
                }
            },
            "email": ""
        }
    ],
    "year": "",
    "venue": null,
    "identifiers": {},
    "abstract": "In this paper, we present work on extracting social networks from unstructured text. We introduce novel features derived from semantic annotations based on FrameNet. We also introduce novel semantic tree kernels that help us improve the performance of the best reported system on social event detection and classification by a statistically significant margin. We show results for combining the models for the two aforementioned subtasks into the overall task of social network extraction. We show that a combination of features from all three levels of abstractions (lexical, syntactic and semantic) are required to achieve the best performing system.",
    "pdf_parse": {
        "paper_id": "E14-1023",
        "_pdf_hash": "",
        "abstract": [
            {
                "text": "In this paper, we present work on extracting social networks from unstructured text. We introduce novel features derived from semantic annotations based on FrameNet. We also introduce novel semantic tree kernels that help us improve the performance of the best reported system on social event detection and classification by a statistically significant margin. We show results for combining the models for the two aforementioned subtasks into the overall task of social network extraction. We show that a combination of features from all three levels of abstractions (lexical, syntactic and semantic) are required to achieve the best performing system.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Abstract",
                "sec_num": null
            }
        ],
        "body_text": [
            {
                "text": "Social network extraction from text has recently been gaining a considerable amount of attention (Agarwal and Rambow, 2010; Elson et al., 2010; Agarwal et al., 2013a; Agarwal et al., 2013b; He et al., 2013) . One of the reason for this attention, we believe, is that being able to extract social networks from unstructured text may provide a powerful new tool for historians, political scientists, scholars of literature, and journalists to analyze large collections of texts around entities and their interactions. The tool would allow researchers to quickly extract networks and assess their size, nature, and cohesiveness, a task that would otherwise be impossible with corpora numbering millions of documents. It would also make it possible to make falsifiable claims about these networks, bringing the experimental method to disciplines like history, where it is still relatively rare.",
                "cite_spans": [
                    {
                        "start": 97,
                        "end": 123,
                        "text": "(Agarwal and Rambow, 2010;",
                        "ref_id": null
                    },
                    {
                        "start": 124,
                        "end": 143,
                        "text": "Elson et al., 2010;",
                        "ref_id": "BIBREF9"
                    },
                    {
                        "start": 144,
                        "end": 166,
                        "text": "Agarwal et al., 2013a;",
                        "ref_id": null
                    },
                    {
                        "start": 167,
                        "end": 189,
                        "text": "Agarwal et al., 2013b;",
                        "ref_id": null
                    },
                    {
                        "start": 190,
                        "end": 206,
                        "text": "He et al., 2013)",
                        "ref_id": "BIBREF13"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "In our previous work (Agarwal et al., 2010) , we proposed a definition of a network based on interactions: nodes are entities and links are social events. We defined two broad types of links: one-directional links (one person thinking about or talking about another person) and bi-directional links (two people having a conversation, a meeting, etc.). For example, in the following sentence, we would add two links to the network: a one-directional link between Toujan Faisal and the committee, triggered by the word said (because Toujan is talking about the committee) and a bi-directional link between the same entities triggered by the word informed (a mutual interaction).",
                "cite_spans": [
                    {
                        "start": 21,
                        "end": 43,
                        "text": "(Agarwal et al., 2010)",
                        "ref_id": null
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "(1) [Toujan Faisal], 54, said [she] was informed of the refusal by an [Interior Ministry committee] overseeing election preparations.",
                "cite_spans": [
                    {
                        "start": 4,
                        "end": 20,
                        "text": "[Toujan Faisal],",
                        "ref_id": null
                    },
                    {
                        "start": 21,
                        "end": 24,
                        "text": "54,",
                        "ref_id": null
                    },
                    {
                        "start": 25,
                        "end": 35,
                        "text": "said [she]",
                        "ref_id": null
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "In this paper, we extract networks using the aforementioned definition of social networks. We introduce and add tree kernel representations and features derived from frame-semantic parses to our previously proposed system. Our results show that hand-crafted frame semantic features, which are linguistically motivated, add less value to the overall performance in comparison with the frame-semantic tree kernels. We believe this is due to the fact that hand-crafted features require frame parses to be highly accurate and complete. In contrast, tree kernels are able to find and leverage less strict patterns without requiring the semantic parse to be entirely accurate or complete.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "Apart from introducing semantic features and tree structures, we evaluate on the task of social network extraction, which is a combination of two sub-tasks: social event detection and social event classification. In our previous work (Agarwal and Rambow, 2010) , we presented results for the two sub-tasks, but no evaluation was presented for the task of social network extraction. We experiment with two different designs of combining models for the two sub-tasks: 1) One-versus-All and 2) Hierarchical. We find that the hierarchical design outperforms the more commonly used Oneversus-All by a statistically significant margin.",
                "cite_spans": [
                    {
                        "start": 234,
                        "end": 260,
                        "text": "(Agarwal and Rambow, 2010)",
                        "ref_id": null
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "Following are the contributions of this paper:",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "1. We design and propose novel frame semantic features and tree-based representations and show that tree kernels are well suited to work with noisy semantic parses.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "2. We show that in order to achieve the best performing system, we need to include features and tree structures from all levels of abstractions, lexical, syntactic, and semantic, and that the convolution kernel framework is well-suited for creating such a combination.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "3. We combine the previously proposed subtasks (social event detection and classification) into a single task, social network extraction, and show that combining the models using a hierarchical design is significantly better than the one-versus-all design.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "The rest of the paper is structured as follows: In Section 2, we give a precise definition of the task and describe the data. In Section 3, we give a brief overview of frame semantics and motivate the need to use frame semantics for the tasks addressed in this paper. In Section 4, we present semantic features and tree kernel representations designed for the tasks. In Section 5, we briefly review tree kernels and support vector machines (SVM). In Section 6 we present experiments and discuss the results. In Section 7 we discuss related work. We conclude and give future directions of work in Section 8.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "In Agarwal et al. (2010) , we presented the annotation details of social events on a well-known corpus -Automated Content Extraction 1 (ACE2005). We defined a social event to be a happening between two entities (of type person) E1 and E2 (E1 = E2), in which at least one entity is cognitively aware of the other and of the happening taking place. We defined two broad cate- For example, meetings and dinners are social events of type interaction. In a social event of type OBS, only one of the two participating entities is aware of the other and therefore, OBS is a one-directional social event, directed from the entity that is aware of the other to the other entity. For example, thinking about someone, or missing someone are social events of type OBS. Table 1 shows the distribution of the data. There are 199 INR type of social events, 199 OBS events, and 1,609 pairs of entity mentions have no event between them.",
                "cite_spans": [
                    {
                        "start": 3,
                        "end": 24,
                        "text": "Agarwal et al. (2010)",
                        "ref_id": null
                    }
                ],
                "ref_spans": [
                    {
                        "start": 763,
                        "end": 764,
                        "text": "1",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "Data and Task Definition",
                "sec_num": "2"
            },
            {
                "text": "Task definition : The task is, given a pair of entity mentions in a sentence, to predict if the entities are participating in a social event or not (social event detection, SED), and if they are, to further predict the type of social event (INR or OBS, social event classification, SEC). In this paper, we evaluate our system on the above tasks as well as a combined task: social network extraction (SNE): given a sentence and a pair of entity mentions, predict the class of the example from one of the following three categories: {No-Event, INR, OBS}.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Data and Task Definition",
                "sec_num": "2"
            },
            {
                "text": "For the purposes of this paper, we use gold named entity mentions to avoid errors caused due to named entity recognition systems. This is a common practice used in the literature for reporting relation extraction systems (Zelenko et al., 2003; Kambhatla, 2004; Zhao and Grishman, 2005; GuoDong et al., 2005; Harabagiu et al., 2005; Nguyen et al., 2009) . We use standard terminology from the literature to refer to the pair of entities mentions as target entities T 1 and T 2 .",
                "cite_spans": [
                    {
                        "start": 221,
                        "end": 243,
                        "text": "(Zelenko et al., 2003;",
                        "ref_id": "BIBREF20"
                    },
                    {
                        "start": 244,
                        "end": 260,
                        "text": "Kambhatla, 2004;",
                        "ref_id": "BIBREF14"
                    },
                    {
                        "start": 261,
                        "end": 285,
                        "text": "Zhao and Grishman, 2005;",
                        "ref_id": "BIBREF21"
                    },
                    {
                        "start": 286,
                        "end": 307,
                        "text": "GuoDong et al., 2005;",
                        "ref_id": "BIBREF10"
                    },
                    {
                        "start": 308,
                        "end": 331,
                        "text": "Harabagiu et al., 2005;",
                        "ref_id": "BIBREF11"
                    },
                    {
                        "start": 332,
                        "end": 352,
                        "text": "Nguyen et al., 2009)",
                        "ref_id": "BIBREF17"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Data and Task Definition",
                "sec_num": "2"
            },
            {
                "text": "FrameNet (Baker et al., 1998) is a resource which associates words of English with their meaning. Word meanings are based on the notion of \"semantic frame\". A frame is a conceptual description of a type of event, relation, or entity, and it includes a list of possible participants in terms of the roles they play; these participants are called \"frame elements\". Through the following example, we present the terminology and acronyms that will be used throughout the paper.",
                "cite_spans": [
                    {
                        "start": 9,
                        "end": 29,
                        "text": "(Baker et al., 1998)",
                        "ref_id": "BIBREF4"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Frame Semantics and FrameNet",
                "sec_num": "3"
            },
            {
                "text": "Example (2) shows the frame annotations for the sentence Toujan Faisal said she was informed of the refusal by an Interior Ministry committee. One of the semantic frames in the sentence is Statement. The frame evoking element (FEE) for this frame is said. It has two frame elements (FE): one of type Speaker (Toujan Faisal) and the other of type Message (she was informed ... by an Interior Ministry committee).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Frame Semantics and FrameNet",
                "sec_num": "3"
            },
            {
                "text": "(",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Frame Semantics and FrameNet",
                "sec_num": "3"
            },
            {
                "text": "2) [ FE-Speaker Toujan Faisal] [ FEE-Statement",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Frame Semantics and FrameNet",
                "sec_num": "3"
            },
            {
                "text": "said] [ FE-Message she was informed of the refusal by an Interior Ministry committee]",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Frame Semantics and FrameNet",
                "sec_num": "3"
            },
            {
                "text": "In example (2), the speaker of the message (Toujan Faisal) is mentioning another group of people (the Interior Ministry committee) in her message. By definition, this is a social event of type OBS. In general, there is an OBS social event between any Speaker and any person mentioned in the frame element Message of the frame Statement. This close relation between frames and social events is the reason for our investigation and use of frame semantics for the tasks addressed in this paper.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Frame Semantics and FrameNet",
                "sec_num": "3"
            },
            {
                "text": "We convert examples2 into two kinds of structured representations: feature vectors and tree structures. Each of these structural representations may broadly be categorized into one or more of the following levels of abstraction: {Lexical, Syntactic, Semantic}. Table 2 presents this distribution. Our final results show that all of our top performing models use a data representation that is a combination of features and structures from all levels of abstraction. We review previously proposed features and tree structures in subsections 4.1, 4.2, and 4.3. To the best of our knowledge, the remaining features and structures presented in this section are novel.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 267,
                        "end": 268,
                        "text": "2",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "Feature space and data representation",
                "sec_num": "4"
            },
            {
                "text": "We create a vocabulary from our training data by using the Stanford tokenizer (Klein and Manning, 2003) ",
                "cite_spans": [
                    {
                        "start": 78,
                        "end": 103,
                        "text": "(Klein and Manning, 2003)",
                        "ref_id": "BIBREF15"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Bag of words (BOW)",
                "sec_num": "4.1"
            },
            {
                "text": "In Agarwal and Rambow (2010) , we explored a wide range of syntactic structures for the two tasks of social event detection (SED) and classification (SEC). All our previous structures were derived from a variation of two underlying tree structures: phrase structure trees and dependency trees. The best structure we proposed was PET_GR_SqGRW, which was a linear combination of two tree kernels and one word kernel: 1) a structure derived from a phrase structure tree (PET); 2) a grammatical role tree (GR), which is a dependency tree in which words are replaced with their grammatical roles; and 3) a path from one entity to the other in a dependency tree, in which grammatical roles of words are inserted as additional nodes between the dependent and parent (SqGRW). We refer the reader to Agarwal and Rambow (2010) for details of these structures.",
                "cite_spans": [
                    {
                        "start": 3,
                        "end": 28,
                        "text": "Agarwal and Rambow (2010)",
                        "ref_id": null
                    },
                    {
                        "start": 791,
                        "end": 816,
                        "text": "Agarwal and Rambow (2010)",
                        "ref_id": null
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Syntactic structures (AR2010)",
                "sec_num": "4.2"
            },
            {
                "text": "For the rest of the paper, we refer to this structure, PET_GR_SqGRW, as \"AR2010\". We use AR2010 as one of our baselines.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Syntactic structures (AR2010)",
                "sec_num": "4.2"
            },
            {
                "text": "We use Semafor (Chen et al., 2010) for obtaining the semantic parse of a sentence. Semafor found instances of 1,174 different FrameNet frames in our corpus. Each example ( x) is converted to a vector of dimension 1,174, in which x i (the i th component of vector x) is 1 if the frame number i appears in the example, and 0 otherwise.",
                "cite_spans": [
                    {
                        "start": 15,
                        "end": 34,
                        "text": "(Chen et al., 2010)",
                        "ref_id": "BIBREF6"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Bag of frames (BOF)",
                "sec_num": "4.3"
            },
            {
                "text": "We use the manual of the FrameNet resource to hand-craft 199 rules that are intended to detect the presence and determine the type of social events between two entities mentioned in a sentence. An example of one such rule is given in section 3, which we reformulate here. We also present another example:",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Hand-crafted semantic features (RULES)",
                "sec_num": "4.4"
            },
            {
                "text": "Feature Vectors Tree Structures BOW",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Hand-crafted semantic features (RULES)",
                "sec_num": "4.4"
            },
            {
                "text": "BOF RULES AR2010 FrameForest FrameTree FrameTreeProp Lexical ! ! ! Syntactic ! ! Semantic (novel) ! ! ! ! !",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Hand-crafted semantic features (RULES)",
                "sec_num": "4.4"
            },
            {
                "text": "Table 2 : Features and tree structures and the level of abstraction they fall into.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 6,
                        "end": 7,
                        "text": "2",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "Hand-crafted semantic features (RULES)",
                "sec_num": "4.4"
            },
            {
                "text": "(3) If the frame is Statement, and the first target entity mention is contained in the FE Speaker, and the second is contained in the FE Message, then there is an OBS social event from the first entity to the second.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Hand-crafted semantic features (RULES)",
                "sec_num": "4.4"
            },
            {
                "text": "(4) If the frame is Commerce_buy, and one target entity mention is contained in the FE Buyer, and the other is contained in the FE Seller, then there is an INR social event between the two entities.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Hand-crafted semantic features (RULES)",
                "sec_num": "4.4"
            },
            {
                "text": "Each rule corresponds to a binary feature: it takes a value 1 if the rule fires for an input example, and 0 otherwise. Consider the following sentence:",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Hand-crafted semantic features (RULES)",
                "sec_num": "4.4"
            },
            {
                "text": "(",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Hand-crafted semantic features (RULES)",
                "sec_num": "4.4"
            },
            {
                "text": "5) [Coleman] T 1-Ind {claimed} [he] T 1 -Ind {bought} drugs from the [defendants] T 2-Grp .",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Hand-crafted semantic features (RULES)",
                "sec_num": "4.4"
            },
            {
                "text": "In this sentence, there are two social events: 1) an OBS event triggered by the word claimed between Coleman and defendants and 2) an INR event triggered by the word bought between he (co-referential with Coleman) and the defendants.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Hand-crafted semantic features (RULES)",
                "sec_num": "4.4"
            },
            {
                "text": "Semafor correctly detects two frames in this sentence: 1) the frame Statement, with Coleman as Speaker, and he bought ... defendants as Message, and 2) the frame Commerce_buy, with he as the Buyer, drugs as the Goods and the defendants as the Seller. Both hand-crafted rules (3 and 4) fire and the corresponding feature values for these rules is set to 1. Firing of these rules (and thus the effectiveness these features) is of course highly dependent on the fact that Semafor provides an accurate frame parse for the sentence.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Hand-crafted semantic features (RULES)",
                "sec_num": "4.4"
            },
            {
                "text": "FrameTree, FrameTreeProp)",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Semantic trees (FrameForest,",
                "sec_num": "4.5"
            },
            {
                "text": "Semafor labels text spans in sentences as frame evoking elements (FEE) or frame elements (FE).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Semantic trees (FrameForest,",
                "sec_num": "4.5"
            },
            {
                "text": "A sentence usually has multiple frames and the frame annotations may overlap. There may be two ways in which spans overlap (Figure 1 ): (a) one frame annotation is completely embedded in the other frame annotation and (b) some of the frame elements overlap (in terms of text spans). We now present the three frame semantic tree kernel representations that handle these overlapping issues, along with providing a meaningful semantic kernel representation for the tasks addressed in this paper.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 131,
                        "end": 132,
                        "text": "1",
                        "ref_id": "FIGREF1"
                    }
                ],
                "eq_spans": [],
                "section": "Semantic trees (FrameForest,",
                "sec_num": "4.5"
            },
            {
                "text": "For each of the following representations, we assume that for each sentence s, we have the set of semantic frames, F s = {F = F EE, [F E 1 , F E 2 , . . . , F E n ] } with each frame F having an FEE and a list of FEs. . We illustrate the structures using sentence (5).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Semantic trees (FrameForest,",
                "sec_num": "4.5"
            },
            {
                "text": "We first create a tree for each frame annotation F in the sentence. Consider a frame,",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "FrameForest Tree Representation",
                "sec_num": "4.5.1"
            },
            {
                "text": "F = F EE, [F E 1 , F E 2 , . . . , F E n ] .",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "FrameForest Tree Representation",
                "sec_num": "4.5.1"
            },
            {
                "text": "For the purposes of tree construction, we treat F EE as another F E (call it F E 0 ) of type Target. For each F E i , we choose the subtree from the dependency parse tree that is the smallest subtree containing all words annotated as F E i by Semafor. Call this subtree extracted from the dependency parse DepT ree_F E i . We then create a larger tree by adding DepT ree_F E i as a child of a new node labeled with frame element F E i : (F E i DepT ree_F E i ). Call this resulting tree SubTree_F E i . We then connect all the SubTree_F E i (i ∈ {0, 1, 2, . . . , n}) to a new root node labeled with the frame F : (F SubT ree_F E 0 . . . SubT ree_F E n ). This is the tree for a frame F . Since the sentence could have multiple frames, we connect the forest of frame trees to a new node called ROOT . in FrameForest refers to the subtree (bought (T1-Ind) (from T2-Grp)). Ind refers to individual and Grp refers to group.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "FrameForest Tree Representation",
                "sec_num": "4.5.1"
            },
            {
                "text": "We prune away all subtrees that do not contain the target entities. We refer to the resulting tree as FrameForest. For example, in Figure 2 , the left tree is the FrameForest tree for sentence (5). There are two frames in this sentence that appear in the final tree because both these frames contain the target entities and thus are not pruned away. The two frames are Commerce_buy and Statement. We first create trees for each of the frames. For the Com-merce_buy frame, there are three frame elements: Target (the frame evoking element), Buyer and Seller. For each frame element, we get the subtree from the dependency tree that contains all the words belonging to that frame element. The subtree for FEE Target is (bought T1-Ind (from T2-Grp)). The subtree for FE Buyer is (T1-Ind) and the subtree for FE Seller is (from T2-Grp). We connect these subtrees to their respective frame elements and connect the resulting subtrees to the frame (Commerce_buy). Similarly, we create a tree for the frame Statement. Finally, we connect all frame trees to the ROOT .",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 138,
                        "end": 139,
                        "text": "2",
                        "ref_id": "FIGREF2"
                    }
                ],
                "eq_spans": [],
                "section": "FrameForest Tree Representation",
                "sec_num": "4.5.1"
            },
            {
                "text": "In this representation, we have avoided the frame overlapping issues by repeating the common subtrees: the subtree (bought T1-Ind (from T2-Grp)) is repeated under the FEE Target of the Statement frame as well as under the FE Message of the Statement frame.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "FrameForest Tree Representation",
                "sec_num": "4.5.1"
            },
            {
                "text": "For the design of this tree, we deal with the two overlapping conditions shown in Figure 1 differently. If one frame is fully embedded in another frame, we add the former as a child of the latter frame. In Figure 2 , the frame Commerce_buy is fully embedded in the frame element Message of the frame Statement. Therefore, the frame subtree for Commerce_buy appears as a subtree of Message.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 89,
                        "end": 90,
                        "text": "1",
                        "ref_id": "FIGREF1"
                    },
                    {
                        "start": 213,
                        "end": 214,
                        "text": "2",
                        "ref_id": "FIGREF2"
                    }
                ],
                "eq_spans": [],
                "section": "FrameTree Tree Representation",
                "sec_num": "4.5.2"
            },
            {
                "text": "If the frames overlap partially, we copy over the overlapping portions of the structures to each of the frame sub-trees.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "FrameTree Tree Representation",
                "sec_num": "4.5.2"
            },
            {
                "text": "For the design of this representation, we remove all lexical nodes (struck out nodes in Figure 2 ) and trees that do not span any of the target entities (not shown in the figure). As a result, this structure is the smallest semantic structure that contains the two target entities. The right tree in Figure 2 is the FrameTree tree for sentence (5).",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 95,
                        "end": 96,
                        "text": "2",
                        "ref_id": "FIGREF2"
                    },
                    {
                        "start": 307,
                        "end": 308,
                        "text": "2",
                        "ref_id": "FIGREF2"
                    }
                ],
                "eq_spans": [],
                "section": "FrameTree Tree Representation",
                "sec_num": "4.5.2"
            },
            {
                "text": "We are using a partial tree kernel (PTK) for calculating the similarity of two trees (as detailed in section 5). The PTK does not skip over nodes of the tree that lie on the same path. For establishing an OBS social event between Coleman and the defendants, all the structure needs to encode is the fact that one target appears as a Speaker and the other appears in the Message (of the speaker). In Frame-Tree, this information is encoded but in an unclear manner -there are two nodes (Commerce_buy and Seller) that come in between the node Message and T2-Grp.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "FrameTreeProp Tree Representation",
                "sec_num": "4.5.3"
            },
            {
                "text": "For this reason, we copy the nodes labeled with the target annotations (T 1- * , T 2- * ) to all nodes (that are frame elements of a frame) on the path from them to the root in FrameTree. We call this variation of FrameTree, in which we propagate T 1 - * , T 2 - * nodes to the root, FrameTreeProp. For the running example, FrameTreeProp will be: (Statement (Speaker T1-Ind) (Message (Commerce_buy ...) (T2-Grp))). Using this tree representation, one of the sub-trees in the implicit feature space will be (Statement (Speaker T1-Ind) (Message (T2-Grp)), which encodes the relation between the two targets in a more direct manner as compared to FrameTree.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "FrameTreeProp Tree Representation",
                "sec_num": "4.5.3"
            },
            {
                "text": "We represent our data in form of feature vectors and tree structures. We use convolution kernels (Haussler, 1999) that make use of the dual form of Support Vector Machines (SVMs). In the dual form, the optimization problem that SVM solves is the following (Burges, 1998) :",
                "cite_spans": [
                    {
                        "start": 97,
                        "end": 113,
                        "text": "(Haussler, 1999)",
                        "ref_id": "BIBREF12"
                    },
                    {
                        "start": 256,
                        "end": 270,
                        "text": "(Burges, 1998)",
                        "ref_id": "BIBREF5"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Machine Learning",
                "sec_num": "5"
            },
            {
                "text": "max Σ i µ i -Σ i,j µ i µ j y i y j K(x i , x j ) s.t. Σ i µ i y i = 0 µ i ≥ 0 ∀i = 1, 2, . . . , l",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Machine Learning",
                "sec_num": "5"
            },
            {
                "text": "Here, x i is the input example, y i is the class of the example x i , µ i is the Lagrange multiplier associated with example x i , l is the number of training examples, and K is the kernel function that returns a similarity between two examples. More formally, K is the function, K : X × X → R, that maps a pair of objects belonging to the set X to a real number. For example, if we represent our input examples as feature vectors, the set X would be the set of feature vectors. For feature vectors, we use a linear kernel, i.e. K(x i , x j ) = x i • x j (dot product of the two vectors). For our tree representations, we use a Partial Tree Kernel (PTK), first proposed by Moschitti (2006) . PTK is a relaxed version of the Subset Tree (SST) kernel proposed by Collins and Duffy (2002) . A subset tree kernel measures the similarity between two trees by counting all subtrees common to the two trees. However, there is one constraint: all daughter nodes of a parent node must be included (in the sub-trees). In PTK, this constraint is removed. Therefore, in contrast to SST, PT kernels compare many more substructures. For a combination of feature vectors and tree representations, we simply use the linear combination of their respective kernels.",
                "cite_spans": [
                    {
                        "start": 673,
                        "end": 689,
                        "text": "Moschitti (2006)",
                        "ref_id": "BIBREF16"
                    },
                    {
                        "start": 761,
                        "end": 785,
                        "text": "Collins and Duffy (2002)",
                        "ref_id": "BIBREF7"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Machine Learning",
                "sec_num": "5"
            },
            {
                "text": "We present 5-fold cross-validation results on the ACE2005 corpus annotated for social events. Since the number of types of features and structures is not large (Table 2 ), we run an exhaustive set of 2 7 -1 = 127 experiments for each of three tasks: Social Event Detection (SED), Social Event Classification (SEC) and Social Network Extraction (SNE). To avoid over-fitting to a particular partition into folds, we run each 5-fold experiment 50 times, for 50 randomly generated partitions. The results reported in the following tables are all averaged over these 50 partitions. The absolute standard deviation on an average is less than 0.004. This means that the performance of our models across 50 random folds does not fluctuate and hence the system is robust. We use McNemar's significance test and refer to statistical significance as p < 0.05.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 167,
                        "end": 168,
                        "text": "2",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "Experiments and Results",
                "sec_num": "6"
            },
            {
                "text": "We report precision (P), recall (R) and F1 measure for the detection task, and % accuracy for the classification task. For both these tasks, our previous best performing system was PET_GR_SqGRW (which we refer to as AR2010). We use this as a baseline, and introduce two new baselines: the bag-of-words (BOW) baseline and a linear combination of BOW and AR2010, referred to as BOW_AR2010.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Social event detection (SED) and classification (SEC)",
                "sec_num": "6.1"
            },
            {
                "text": "Table 3 presents the results for these two tasks for various features and structures. The results show that our purely semantic models (RULES, BOF, FrameTree, FrameTreeProp) do not perform well alone. FrameForest, which encodes some lexical and syntactic level features (but is primarily semantic), also performs worse than the baselines when used alone. However, a combination of lexical, syntactic and semantic structures improves the performance by an absolute of 1.1% in F1-measure for SED (from 0.574 to 0.585). This gain is statistically significant. For SEC, the absolute gain from our best baseline (BOW_AR2010) is 0.8% in F1-measure (from 82.3 to 83.1), which is not statistically significant. However, the gain of 2% from our previously proposed best system (AR2010) is statistically significant. mantic parses. For example, Rule (4) correctly detects the social event in sentence (5), since Semafor correctly parses the input. In contrast, Semafor does not correctly parse the input sentence (1): it correctly identifies the Statement frame and its Message frame element, but it fails to find the Speaker. As a result, Rule (3) does not fire, even though the semantic structure is partially identified. This, we believe, highlights the main strength of tree kernels -they are able to learn semantic patterns, without requiring correctness or completeness of the semantic parse.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 6,
                        "end": 7,
                        "text": "3",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "Social event detection (SED) and classification (SEC)",
                "sec_num": "6.1"
            },
            {
                "text": "Out of the semantic structures we propose, FrameTreeProp adds the most value to the baseline system as compared to other semantic features and structures. This supports our intuition that we need to reduce unbounded semantic dependencies between the target entities by propagating the target entity tags to the top of the semantic tree. The top row gives the performance of the baseline. Each consecutive row shows the result of the baseline plus the feature/structure mentioned in that row.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Social event detection (SED) and classification (SEC)",
                "sec_num": "6.1"
            },
            {
                "text": "There have been recent efforts to extract networks from text (Elson et al., 2010; He et al., 2013) . However, these efforts extract a different type of network: a network of only bi-directional links, where the links are triggered by quotation marks. For example, Elson et al. (2010) and He et al. (2013) will extract an interaction link between Emma and Harriet in the following sentence. However, their system will not detect any interaction links in the other examples mentioned in this paper.",
                "cite_spans": [
                    {
                        "start": 61,
                        "end": 81,
                        "text": "(Elson et al., 2010;",
                        "ref_id": "BIBREF9"
                    },
                    {
                        "start": 82,
                        "end": 98,
                        "text": "He et al., 2013)",
                        "ref_id": "BIBREF13"
                    },
                    {
                        "start": 264,
                        "end": 283,
                        "text": "Elson et al. (2010)",
                        "ref_id": "BIBREF9"
                    },
                    {
                        "start": 288,
                        "end": 304,
                        "text": "He et al. (2013)",
                        "ref_id": "BIBREF13"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Related Work",
                "sec_num": "7"
            },
            {
                "text": "(6) \"Take it,\" said Emma, smiling, and pushing the paper towards Harriet \"it is for you. Take your own.\"",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Related Work",
                "sec_num": "7"
            },
            {
                "text": "Our approach to extract and classify social events builds on our previous work (Agarwal and Rambow, 2010) , which in turn builds on work from the relation extraction community (Nguyen et al., 2009) . Therefore, the task of relation extraction is most closely related to the tasks addressed in this paper. Researchers have used other notions of semantics in the literature such as latent semantic analysis (Plank and Moschitti, 2013) and relation-specific semantics (Zelenko et al., 2003; Culotta and Sorensen, 2004) . To the best of our knowledge, there is only one work that uses frame semantics for relation extraction (Harabagiu et al., 2005) . Harabagiu et al. (2005) propose a novel semantic kernel that incorporates frame parse information in the kernel computation that calculates similarity between two dependency trees. They, however, do not propose data representations that are based on frame parses and the resulting arborescent structures, instead adding features to syntactic trees. We believe the implicit feature space of kernels based on our data representation encode a richer and larger feature space than the one proposed by Harabagiu et al. (2005) .",
                "cite_spans": [
                    {
                        "start": 79,
                        "end": 105,
                        "text": "(Agarwal and Rambow, 2010)",
                        "ref_id": null
                    },
                    {
                        "start": 176,
                        "end": 197,
                        "text": "(Nguyen et al., 2009)",
                        "ref_id": "BIBREF17"
                    },
                    {
                        "start": 405,
                        "end": 432,
                        "text": "(Plank and Moschitti, 2013)",
                        "ref_id": "BIBREF18"
                    },
                    {
                        "start": 465,
                        "end": 487,
                        "text": "(Zelenko et al., 2003;",
                        "ref_id": "BIBREF20"
                    },
                    {
                        "start": 488,
                        "end": 515,
                        "text": "Culotta and Sorensen, 2004)",
                        "ref_id": "BIBREF8"
                    },
                    {
                        "start": 621,
                        "end": 645,
                        "text": "(Harabagiu et al., 2005)",
                        "ref_id": "BIBREF11"
                    },
                    {
                        "start": 648,
                        "end": 671,
                        "text": "Harabagiu et al. (2005)",
                        "ref_id": "BIBREF11"
                    },
                    {
                        "start": 1145,
                        "end": 1168,
                        "text": "Harabagiu et al. (2005)",
                        "ref_id": "BIBREF11"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Related Work",
                "sec_num": "7"
            },
            {
                "text": "This work has only scratched the surface of possibilities for using frame semantic features and tree structures for the task of social event extraction. We have shown that tree kernels are well suited to work with possibly inaccurate semantic parses in contrast to hand-crafted features that require the semantic parses to be completely accurate. We have also extended our previous work by designing and evaluating a full system for social network extraction.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Conclusion and Future Work",
                "sec_num": "8"
            },
            {
                "text": "A more natural data representation for semantic parses is a graph structure. We are actively exploring the design of semantic graph structures that may be brought to bear with the use of graph kernels (Vishwanathan et al., 2010) .",
                "cite_spans": [
                    {
                        "start": 201,
                        "end": 228,
                        "text": "(Vishwanathan et al., 2010)",
                        "ref_id": "BIBREF19"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Conclusion and Future Work",
                "sec_num": "8"
            },
            {
                "text": "An input example is a sentence with a pair of entity mentions between whom we predict and classify social events.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            }
        ],
        "back_matter": [
            {
                "text": "We would like to thank CCLS's IT heads, Hatim Diab and Manoj Pooleery, for providing the infrastructure support. This paper is based upon work supported in part by the DARPA DEFT Program. The views expressed are those of the authors and do not reflect the official policy or position of the Department of Defense or the U.S. Government.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Acknowledgments",
                "sec_num": null
            },
            {
                "text": "We see that none of the semantic features and structures alone outperform the baseline. However, a combination of structures from different levels of abstraction achieve the best performance: an absolute gain of 1.5% in F1 (statistically significant) when we use a hierarchical design (from 0.465 to 0.480).Comparing hierarchical verus OVA approaches, we observe that the hierarchical approach outperforms the OVA approach for all our models by a statistically significant margin. The performance for our best reported model (AR2010_FrameTreeProp) for OVA in terms precision, recall, and F1-measure is 0.375, 0.592, 0.459 respectively. This is statistically significantly worse than hierarchical approach (0.397, 0.608, 0.480).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "annex",
                "sec_num": null
            },
            {
                "text": "Performing well on SED is more important than SEC, because if a social event is not detected in the first place, the goodness of the SEC model is irrelevant. Therefore, the best feature and structure combination we report in this paper is a combination of AR2010 and FrameTreeProp.To gain insight into the how each type of semantic feature and structure contribute to our previously proposed lexical and syntactic model (AR2010), we perform experiments in which we add one semantic feature/structure at a time to AR2010. Table 4 presents the results for this study. We see that the hand-crafted RULES do not help in the overall task. We investigated the reason for RULES not being as helpful as we had expected. We found that when there is no social event, the rules fire in 7% of the cases. When there is a social event, they fire in 17% of cases. So while they fire more often when there is a social event, the percentage of cases in which they fire is small. We hypothesize that this is due the dependence of RULES on the correctness of se-",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 527,
                        "end": 528,
                        "text": "4",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "Discussion of results",
                "sec_num": "6.3"
            }
        ],
        "bib_entries": {
            "BIBREF0": {
                "ref_id": "b0",
                "title": "Automatic detection and classification of social events",
                "authors": [
                    {
                        "first": "Apoorv",
                        "middle": [],
                        "last": "Agarwal",
                        "suffix": ""
                    },
                    {
                        "first": "Owen",
                        "middle": [],
                        "last": "Rambow",
                        "suffix": ""
                    }
                ],
                "year": 2010,
                "venue": "Proceedings of the 2010 Conference on Empirical Methods in Natural Language Processing",
                "volume": "",
                "issue": "",
                "pages": "1024--1034",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Apoorv Agarwal and Owen Rambow. 2010. Auto- matic detection and classification of social events. In Proceedings of the 2010 Conference on Empiri- cal Methods in Natural Language Processing, pages 1024-1034, Cambridge, MA, October. Association for Computational Linguistics.",
                "links": null
            },
            "BIBREF1": {
                "ref_id": "b1",
                "title": "Annotation scheme for social network extraction from text",
                "authors": [
                    {
                        "first": "Apoorv",
                        "middle": [],
                        "last": "Agarwal",
                        "suffix": ""
                    },
                    {
                        "first": "Owen",
                        "middle": [
                            "C"
                        ],
                        "last": "Rambow",
                        "suffix": ""
                    },
                    {
                        "first": "Rebecca",
                        "middle": [
                            "J"
                        ],
                        "last": "Passonneau",
                        "suffix": ""
                    }
                ],
                "year": 2010,
                "venue": "Proceedings of the Fourth Linguistic Annotation Workshop",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Apoorv Agarwal, Owen C. Rambow, and Rebecca J. Passonneau. 2010. Annotation scheme for social network extraction from text. In Proceedings of the Fourth Linguistic Annotation Workshop.",
                "links": null
            },
            "BIBREF2": {
                "ref_id": "b2",
                "title": "Automatic extraction of social networks from literary text: A case study on alice in wonderland",
                "authors": [
                    {
                        "first": "Apoorv",
                        "middle": [],
                        "last": "Agarwal",
                        "suffix": ""
                    },
                    {
                        "first": "Anup",
                        "middle": [],
                        "last": "Kotalwar",
                        "suffix": ""
                    },
                    {
                        "first": "Owen",
                        "middle": [],
                        "last": "Rambow",
                        "suffix": ""
                    }
                ],
                "year": 2013,
                "venue": "the Proceedings of the 6th International Joint Conference on Natural Language Processing",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Apoorv Agarwal, Anup Kotalwar, and Owen Ram- bow. 2013a. Automatic extraction of social net- works from literary text: A case study on alice in wonderland. In the Proceedings of the 6th Interna- tional Joint Conference on Natural Language Pro- cessing (IJCNLP 2013).",
                "links": null
            },
            "BIBREF3": {
                "ref_id": "b3",
                "title": "Sinnet: Social interaction network extractor from text",
                "authors": [
                    {
                        "first": "Apoorv",
                        "middle": [],
                        "last": "Agarwal",
                        "suffix": ""
                    },
                    {
                        "first": "Anup",
                        "middle": [],
                        "last": "Kotalwar",
                        "suffix": ""
                    },
                    {
                        "first": "Jiehan",
                        "middle": [],
                        "last": "Zheng",
                        "suffix": ""
                    },
                    {
                        "first": "Owen",
                        "middle": [],
                        "last": "Rambow",
                        "suffix": ""
                    }
                ],
                "year": 2013,
                "venue": "Sixth International Joint Conference on Natural Language Processing",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Apoorv Agarwal, Anup Kotalwar, Jiehan Zheng, and Owen Rambow. 2013b. Sinnet: Social interaction network extractor from text. In Sixth International Joint Conference on Natural Language Processing, page 33.",
                "links": null
            },
            "BIBREF4": {
                "ref_id": "b4",
                "title": "The Berkeley FrameNet project",
                "authors": [
                    {
                        "first": "Collin",
                        "middle": [
                            "F"
                        ],
                        "last": "Baker",
                        "suffix": ""
                    },
                    {
                        "first": "J",
                        "middle": [],
                        "last": "Fillmore",
                        "suffix": ""
                    },
                    {
                        "first": "John",
                        "middle": [
                            "B"
                        ],
                        "last": "Lowe",
                        "suffix": ""
                    }
                ],
                "year": 1998,
                "venue": "36th Meeting of the Association for Computational Linguistics and 17th International Conference on Computational Linguistics (COLING-ACL'98)",
                "volume": "",
                "issue": "",
                "pages": "86--90",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Collin F. Baker, J. Fillmore, and John B. Lowe. 1998. The Berkeley FrameNet project. In 36th Meet- ing of the Association for Computational Linguis- tics and 17th International Conference on Computa- tional Linguistics (COLING-ACL'98), pages 86-90, Montréal.",
                "links": null
            },
            "BIBREF5": {
                "ref_id": "b5",
                "title": "A tutorial on support vector machines for pattern recognition",
                "authors": [
                    {
                        "first": "Chris",
                        "middle": [],
                        "last": "Burges",
                        "suffix": ""
                    }
                ],
                "year": 1998,
                "venue": "Data mining and knowledge discovery",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Chris Burges. 1998. A tutorial on support vector ma- chines for pattern recognition. Data mining and knowledge discovery.",
                "links": null
            },
            "BIBREF6": {
                "ref_id": "b6",
                "title": "Semafor: Frame argument resolution with log-linear models",
                "authors": [
                    {
                        "first": "Nathan",
                        "middle": [],
                        "last": "Desai Chen",
                        "suffix": ""
                    },
                    {
                        "first": "Dipanjan",
                        "middle": [],
                        "last": "Schneider",
                        "suffix": ""
                    },
                    {
                        "first": "Noah",
                        "middle": [
                            "A"
                        ],
                        "last": "Das",
                        "suffix": ""
                    },
                    {
                        "first": "",
                        "middle": [],
                        "last": "Smith",
                        "suffix": ""
                    }
                ],
                "year": 2010,
                "venue": "Proceedings of the 5th International Workshop on Semantic Evaluation",
                "volume": "",
                "issue": "",
                "pages": "264--267",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Desai Chen, Nathan Schneider, Dipanjan Das, and Noah A. Smith. 2010. Semafor: Frame argument resolution with log-linear models. In Proceedings of the 5th International Workshop on Semantic Evalu- ation, pages 264-267, Uppsala, Sweden, July. Asso- ciation for Computational Linguistics.",
                "links": null
            },
            "BIBREF7": {
                "ref_id": "b7",
                "title": "New ranking algorithms for parsing and tagging: Kernels over discrete structures, and the voted perceptron",
                "authors": [
                    {
                        "first": "Michael",
                        "middle": [],
                        "last": "Collins",
                        "suffix": ""
                    },
                    {
                        "first": "Nigel",
                        "middle": [],
                        "last": "Duffy",
                        "suffix": ""
                    }
                ],
                "year": 2002,
                "venue": "Proceedings of the 40th annual meeting on association for computational linguistics",
                "volume": "",
                "issue": "",
                "pages": "263--270",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Michael Collins and Nigel Duffy. 2002. New rank- ing algorithms for parsing and tagging: Kernels over discrete structures, and the voted perceptron. In Pro- ceedings of the 40th annual meeting on association for computational linguistics, pages 263-270. Asso- ciation for Computational Linguistics.",
                "links": null
            },
            "BIBREF8": {
                "ref_id": "b8",
                "title": "Dependency tree kernels for relation extraction",
                "authors": [
                    {
                        "first": "Aron",
                        "middle": [],
                        "last": "Culotta",
                        "suffix": ""
                    },
                    {
                        "first": "Jeffrey",
                        "middle": [],
                        "last": "Sorensen",
                        "suffix": ""
                    }
                ],
                "year": 2004,
                "venue": "Proceedings of the 42nd Meeting of the Association for Computational Linguistics (ACL'04), Main Volume",
                "volume": "",
                "issue": "",
                "pages": "423--429",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Aron Culotta and Jeffrey Sorensen. 2004. Dependency tree kernels for relation extraction. In Proceedings of the 42nd Meeting of the Association for Compu- tational Linguistics (ACL'04), Main Volume, pages 423-429, Barcelona, Spain, July.",
                "links": null
            },
            "BIBREF9": {
                "ref_id": "b9",
                "title": "Extracting social networks from literary fiction",
                "authors": [
                    {
                        "first": "David",
                        "middle": [
                            "K"
                        ],
                        "last": "Elson",
                        "suffix": ""
                    },
                    {
                        "first": "Nicholas",
                        "middle": [],
                        "last": "Dames",
                        "suffix": ""
                    },
                    {
                        "first": "Kathleen",
                        "middle": [
                            "R"
                        ],
                        "last": "Mckeown",
                        "suffix": ""
                    }
                ],
                "year": 2010,
                "venue": "Proceedings of the 48th Annual Meeting of the Association for Computational Linguistics",
                "volume": "",
                "issue": "",
                "pages": "138--147",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "David K. Elson, Nicholas Dames, and Kathleen R. McKeown. 2010. Extracting social networks from literary fiction. Proceedings of the 48th Annual Meeting of the Association for Computational Lin- guistics, pages 138-147.",
                "links": null
            },
            "BIBREF10": {
                "ref_id": "b10",
                "title": "Exploring various knowledge in relation extraction",
                "authors": [
                    {
                        "first": "Zhou",
                        "middle": [],
                        "last": "Guodong",
                        "suffix": ""
                    },
                    {
                        "first": "Su",
                        "middle": [],
                        "last": "Jian",
                        "suffix": ""
                    },
                    {
                        "first": "Zhang",
                        "middle": [],
                        "last": "Jie",
                        "suffix": ""
                    },
                    {
                        "first": "Zhang",
                        "middle": [],
                        "last": "Min",
                        "suffix": ""
                    }
                ],
                "year": 2005,
                "venue": "Proceedings of 43th Annual Meeting of the Association for Computational Linguistics",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Zhou GuoDong, Su Jian, Zhang Jie, and Zhang Min. 2005. Exploring various knowledge in relation ex- traction. In Proceedings of 43th Annual Meeting of the Association for Computational Linguistics.",
                "links": null
            },
            "BIBREF11": {
                "ref_id": "b11",
                "title": "Shallow semantics for relation extraction",
                "authors": [
                    {
                        "first": "Sanda",
                        "middle": [],
                        "last": "Harabagiu",
                        "suffix": ""
                    },
                    {
                        "first": "Cosmin",
                        "middle": [],
                        "last": "",
                        "suffix": ""
                    },
                    {
                        "first": "Adrian",
                        "middle": [],
                        "last": "Bejan",
                        "suffix": ""
                    },
                    {
                        "first": "Paul",
                        "middle": [],
                        "last": "Morarescu",
                        "suffix": ""
                    }
                ],
                "year": 2005,
                "venue": "International Joint Conference On Artificial Intelligence",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Sanda Harabagiu, Cosmin Adrian Bejan, and Paul Morarescu. 2005. Shallow semantics for relation extraction. In International Joint Conference On Ar- tificial Intelligence.",
                "links": null
            },
            "BIBREF12": {
                "ref_id": "b12",
                "title": "Convolution kernels on discrete structures",
                "authors": [
                    {
                        "first": "David",
                        "middle": [],
                        "last": "Haussler",
                        "suffix": ""
                    }
                ],
                "year": 1999,
                "venue": "",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "David Haussler. 1999. Convolution kernels on discrete structures. Technical report, University of Califor- nia at Santa Cruz.",
                "links": null
            },
            "BIBREF13": {
                "ref_id": "b13",
                "title": "Identification of speakers in novels",
                "authors": [
                    {
                        "first": "Hua",
                        "middle": [],
                        "last": "He",
                        "suffix": ""
                    },
                    {
                        "first": "Denilson",
                        "middle": [],
                        "last": "Barbosa",
                        "suffix": ""
                    },
                    {
                        "first": "Grzegorz",
                        "middle": [],
                        "last": "Kondrak",
                        "suffix": ""
                    }
                ],
                "year": 2013,
                "venue": "The 51st Annual Meeting of the Association for Computational Linguistics",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Hua He, Denilson Barbosa, and Grzegorz Kondrak. 2013. Identification of speakers in novels. The 51st Annual Meeting of the Association for Compu- tational Linguistics (ACL 2013).",
                "links": null
            },
            "BIBREF14": {
                "ref_id": "b14",
                "title": "Combining lexical, syntactic, and semantic features with maximum entropy models for extracting relations",
                "authors": [
                    {
                        "first": "Nanda",
                        "middle": [],
                        "last": "Kambhatla",
                        "suffix": ""
                    }
                ],
                "year": 2004,
                "venue": "Proceedings of the ACL 2004 on Interactive poster and demonstration sessions",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Nanda Kambhatla. 2004. Combining lexical, syntac- tic, and semantic features with maximum entropy models for extracting relations. In Proceedings of the ACL 2004 on Interactive poster and demonstra- tion sessions, page 22. Association for Computa- tional Linguistics.",
                "links": null
            },
            "BIBREF15": {
                "ref_id": "b15",
                "title": "Accurate unlexicalized parsing",
                "authors": [
                    {
                        "first": "Dan",
                        "middle": [],
                        "last": "Klein",
                        "suffix": ""
                    },
                    {
                        "first": "Christopher",
                        "middle": [
                            "D"
                        ],
                        "last": "Manning",
                        "suffix": ""
                    }
                ],
                "year": 2003,
                "venue": "Proceedings of the 41st Meeting of the Association for Computational Linguistics",
                "volume": "",
                "issue": "",
                "pages": "423--430",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Dan Klein and Christopher D. Manning. 2003. Accu- rate unlexicalized parsing. Proceedings of the 41st Meeting of the Association for Computational Lin- guistics, pages 423-430.",
                "links": null
            },
            "BIBREF16": {
                "ref_id": "b16",
                "title": "Efficient convolution kernels for dependency and constituent syntactic trees",
                "authors": [
                    {
                        "first": "Alessandro",
                        "middle": [],
                        "last": "Moschitti",
                        "suffix": ""
                    }
                ],
                "year": 2006,
                "venue": "Proceedings of the 17th European Conference on Machine Learning",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Alessandro Moschitti. 2006. Efficient convolution ker- nels for dependency and constituent syntactic trees. In Proceedings of the 17th European Conference on Machine Learning.",
                "links": null
            },
            "BIBREF17": {
                "ref_id": "b17",
                "title": "Convolution kernels on constituent, dependency and sequential structures for relation extraction",
                "authors": [
                    {
                        "first": "T",
                        "middle": [],
                        "last": "Truc-Vien",
                        "suffix": ""
                    },
                    {
                        "first": "Alessandro",
                        "middle": [],
                        "last": "Nguyen",
                        "suffix": ""
                    },
                    {
                        "first": "Giuseppe",
                        "middle": [],
                        "last": "Moschitti",
                        "suffix": ""
                    },
                    {
                        "first": "",
                        "middle": [],
                        "last": "Riccardi",
                        "suffix": ""
                    }
                ],
                "year": 2009,
                "venue": "Conference on Empirical Methods in Natural Language Processing",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Truc-Vien T. Nguyen, Alessandro Moschitti, and Giuseppe Riccardi. 2009. Convolution kernels on constituent, dependency and sequential structures for relation extraction. Conference on Empirical Methods in Natural Language Processing.",
                "links": null
            },
            "BIBREF18": {
                "ref_id": "b18",
                "title": "Embedding semantic similarity in tree kernels for domain adaptation of relation extraction",
                "authors": [
                    {
                        "first": "Barbara",
                        "middle": [],
                        "last": "Plank",
                        "suffix": ""
                    },
                    {
                        "first": "Alessandro",
                        "middle": [],
                        "last": "Moschitti",
                        "suffix": ""
                    }
                ],
                "year": 2013,
                "venue": "Proceedings of the 51st Annual Meeting of the Association for Computational Linguistics",
                "volume": "1",
                "issue": "",
                "pages": "1498--1507",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Barbara Plank and Alessandro Moschitti. 2013. Em- bedding semantic similarity in tree kernels for do- main adaptation of relation extraction. In Proceed- ings of the 51st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Pa- pers), pages 1498-1507, Sofia, Bulgaria, August. Association for Computational Linguistics.",
                "links": null
            },
            "BIBREF19": {
                "ref_id": "b19",
                "title": "Graph kernels",
                "authors": [
                    {
                        "first": "Nicol",
                        "middle": [
                            "N"
                        ],
                        "last": "Svn Vishwanathan",
                        "suffix": ""
                    },
                    {
                        "first": "Risi",
                        "middle": [],
                        "last": "Schraudolph",
                        "suffix": ""
                    },
                    {
                        "first": "Karsten",
                        "middle": [
                            "M"
                        ],
                        "last": "Kondor",
                        "suffix": ""
                    },
                    {
                        "first": "",
                        "middle": [],
                        "last": "Borgwardt",
                        "suffix": ""
                    }
                ],
                "year": 2010,
                "venue": "The Journal of Machine Learning Research",
                "volume": "11",
                "issue": "",
                "pages": "1201--1242",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "SVN Vishwanathan, Nicol N Schraudolph, Risi Kon- dor, and Karsten M Borgwardt. 2010. Graph ker- nels. The Journal of Machine Learning Research, 11:1201-1242.",
                "links": null
            },
            "BIBREF20": {
                "ref_id": "b20",
                "title": "Kernel methods for relation extraction",
                "authors": [
                    {
                        "first": "Dmitry",
                        "middle": [],
                        "last": "Zelenko",
                        "suffix": ""
                    },
                    {
                        "first": "Chinatsu",
                        "middle": [],
                        "last": "Aone",
                        "suffix": ""
                    },
                    {
                        "first": "Anthony",
                        "middle": [],
                        "last": "Richardella",
                        "suffix": ""
                    }
                ],
                "year": 2003,
                "venue": "The Journal of Machine Learning Research",
                "volume": "3",
                "issue": "",
                "pages": "1083--1106",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Dmitry Zelenko, Chinatsu Aone, and Anthony Richardella. 2003. Kernel methods for relation extraction. The Journal of Machine Learning Re- search, 3:1083-1106.",
                "links": null
            },
            "BIBREF21": {
                "ref_id": "b21",
                "title": "Extracting relations with integrated information using kernel methods",
                "authors": [
                    {
                        "first": "Shubin",
                        "middle": [],
                        "last": "Zhao",
                        "suffix": ""
                    },
                    {
                        "first": "Ralph",
                        "middle": [],
                        "last": "Grishman",
                        "suffix": ""
                    }
                ],
                "year": 2005,
                "venue": "Proceedings of the 43rd Meeting of the ACL",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Shubin Zhao and Ralph Grishman. 2005. Extract- ing relations with integrated information using ker- nel methods. In Proceedings of the 43rd Meeting of the ACL.",
                "links": null
            }
        },
        "ref_entries": {
            "FIGREF0": {
                "num": null,
                "text": "followed by removal of stop words and Porter Stemming. We convert each example ( x) to a set of three boolean vectors: { b 1 , b 2 , b 3 }. b 1 is the occurrence of words before the first target, b 2 between the two targets and b 3 after the second target. Here the first target and second target are defined in terms of the surface order of words. Though these features have been previously proposed for relation extraction on ACE (GuoDong et al., 2005), they have not been utilized for the task we address in this paper.",
                "uris": null,
                "fig_num": null,
                "type_str": "figure"
            },
            "FIGREF1": {
                "num": null,
                "text": "Figure 1: Two overlapping scenarios for frame annotations of a sentence, where F 1, F 2 are frames.",
                "uris": null,
                "fig_num": "1",
                "type_str": "figure"
            },
            "FIGREF2": {
                "num": null,
                "text": "Figure 2: Semantic trees for the sentence \"Coleman claimed [he] T 1-Ind bought drugs from the [defendants] T 2-Grp .\". The tree on the left is FrameForest and the tree on the right is FrameTree. in FrameForest refers to the subtree (bought (T1-Ind) (from T2-Grp)). Ind refers to individual and Grp refers to group.",
                "uris": null,
                "fig_num": "2",
                "type_str": "figure"
            },
            "TABREF1": {
                "content": "<table><tr><td/><td>SED</td><td>SEC</td><td>SNE Hier.</td></tr><tr><td/><td>(F1)</td><td>(%A)</td><td>(F1)</td></tr><tr><td>AR2010</td><td colspan=\"3\">0.574 81.1 0.465</td></tr><tr><td>+ RULES</td><td colspan=\"3\">0.576 80.8 0.465</td></tr><tr><td>+ BOF</td><td colspan=\"3\">0.569 80.7 0.459</td></tr><tr><td>+ FrameForest</td><td colspan=\"3\">0.571 82.6 0.472</td></tr><tr><td>+ FrameTree</td><td colspan=\"3\">0.579 81.5 0.473</td></tr><tr><td>+ FrameTreeProp</td><td colspan=\"3\">0.585 82.0 0.480</td></tr></table>",
                "type_str": "table",
                "text": "A study to show which semantic features and structures add the most value to the baseline.",
                "html": null,
                "num": null
            }
        }
    }
}