{
    "paper_id": "E99-1005",
    "header": {
        "generated_with": "S2ORC 1.0.0",
        "date_generated": "2023-06-16T12:06:59.542220Z"
    },
    "title": "Determinants of Adjective-Noun Plausibility",
    "authors": [
        {
            "first": "Maria",
            "middle": [],
            "last": "Lapata",
            "suffix": "",
            "affiliation": {},
            "email": ""
        },
        {
            "first": "Scott",
            "middle": [],
            "last": "Mcdonald",
            "suffix": "",
            "affiliation": {},
            "email": "scottm@cogsci.ed.ac.uk"
        },
        {
            "first": "Frank",
            "middle": [],
            "last": "Keller",
            "suffix": "",
            "affiliation": {},
            "email": "keller@cogsci.ed.ac.uk"
        }
    ],
    "year": "",
    "venue": null,
    "identifiers": {},
    "abstract": "This paper explores the determinants of adjective-noun plausibility by using correlation analysis to compare judgements elicited from human subjects with five corpus-based variables: co-occurrence frequency of the adjective-noun pair, noun frequency, conditional probability of the noun given the adjective, the log-likelihood ratio, and Resnik's (1993) selectional association measure. The highest correlation is obtained with the co-occurrence frequency, which points to the strongly lexicalist and collocational nature of adjective-noun combinations.",
    "pdf_parse": {
        "paper_id": "E99-1005",
        "_pdf_hash": "",
        "abstract": [
            {
                "text": "This paper explores the determinants of adjective-noun plausibility by using correlation analysis to compare judgements elicited from human subjects with five corpus-based variables: co-occurrence frequency of the adjective-noun pair, noun frequency, conditional probability of the noun given the adjective, the log-likelihood ratio, and Resnik's (1993) selectional association measure. The highest correlation is obtained with the co-occurrence frequency, which points to the strongly lexicalist and collocational nature of adjective-noun combinations.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Abstract",
                "sec_num": null
            }
        ],
        "body_text": [
            {
                "text": "Research on linguistic plausibility has focused mainly on the effects of argument plausibility during the processing of locally ambiguous sentences. Psycholinguists have investigated whether the plausibility of the direct object affects reading times for sentences like (1). Here, argument plausibility refers to \"pragmatic plausibility\" or \"local semantic fit\" (Holmes et al., 1989) , and judgements of plausibility are typically obtained by asking subjects to rate sentence fragments containing verb-argument combinations (as an example consider the bracketed parts of the sentences in (1)). Such experiments typically use an ordinal scale for plausibility (e.g., from 1 to 7).",
                "cite_spans": [
                    {
                        "start": 362,
                        "end": 383,
                        "text": "(Holmes et al., 1989)",
                        "ref_id": "BIBREF10"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "(1) a. [The senior senator regretted the decision] had ever been made public.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "b. [The senior senator regretted the reporter] had ever seen the report.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "The majority of research has focussed on investigating the effect of rated plausibility for verb-object combinations in human sentence processing (Garnsey et al., 1997; Pickering and Traxler, 1998) . However, plausibility effects have also been observed for adjectivenoun combinations in a head-modifier relationship. Murphy (1990) has shown that typical adjectivenoun phrases (e.g., salty olives) are easier to interpret in comparison to atypical ones (e.g., sweet olives). Murphy provides a schema-based explanation for this finding by postulating that in typical adjective-noun phrases, the adjective modifies part of the noun's schema and consequently it is understood more quickly, whereas in atypical combinations, the adjective modifies non-schematic aspects of the noun, which leads to interpretation difficulties. Smadja (1991) argues that the reason people prefer strong tea to powerful tea and powerful car to strong car is neither purely syntactic nor purely semantic, but rather lexical.",
                "cite_spans": [
                    {
                        "start": 146,
                        "end": 168,
                        "text": "(Garnsey et al., 1997;",
                        "ref_id": "BIBREF9"
                    },
                    {
                        "start": 169,
                        "end": 197,
                        "text": "Pickering and Traxler, 1998)",
                        "ref_id": "BIBREF17"
                    },
                    {
                        "start": 318,
                        "end": 331,
                        "text": "Murphy (1990)",
                        "ref_id": "BIBREF15"
                    },
                    {
                        "start": 823,
                        "end": 836,
                        "text": "Smadja (1991)",
                        "ref_id": "BIBREF21"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "A similar argument is put forward by Cruse (1986) , who observes that the adjective spotless collocates well with the noun kitchen, relatively worse with the noun complexion and not all with the noun taste. According to Cruse, words like spotless have idiosyncratic collocational restrictions: differences in the degree of acceptability of the adjective and its collocates do not seem to depend on the meaning of the individual words.",
                "cite_spans": [
                    {
                        "start": 37,
                        "end": 49,
                        "text": "Cruse (1986)",
                        "ref_id": "BIBREF5"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "Acquiring plausibility ratings for word combinations (e.g., adjective-noun, verb-object, noun-noun) can be useful in particular for language generation. Consider a generator which has to make a choice between spotless kitchen and flawless kitchen. An empirical model of plausibility could predict that spotless kitchen is a plausible lexical choice, while flawless kitchen is not.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Motivation",
                "sec_num": "1.1"
            },
            {
                "text": "Adjective-noun combinations can be hard to generate given their collocational status. For a generator which selects words solely on semantic grounds without taking into account lexical constraints, the choice between spotless kitchen and flawless kitchen may look equivalent. Current work in natural language generation (Knight and Hatzivassiloglou, 1995; Langkilde and Knight, 1998) has shown that corpus-based knowledge can be used to address lexical choice noncompositionally.",
                "cite_spans": [
                    {
                        "start": 320,
                        "end": 355,
                        "text": "(Knight and Hatzivassiloglou, 1995;",
                        "ref_id": "BIBREF12"
                    },
                    {
                        "start": 356,
                        "end": 383,
                        "text": "Langkilde and Knight, 1998)",
                        "ref_id": "BIBREF13"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Motivation",
                "sec_num": "1.1"
            },
            {
                "text": "In the work reported here we acquire plausibility ratings for adjective-noun combinations by eliciting judgements from human subjects, and examine the extent to which different corpus-based models correlate with human intuitions about the \"goodness of fit\" for a range of adjective-noun combinations.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Motivation",
                "sec_num": "1.1"
            },
            {
                "text": "The research presented in this paper is similar in motivation to Resnik's (1993) work on selectional restrictions. Resnik evaluated his informationtheoretic model of selectional constraints against human plausibility ratings for verb-object combinations, and showed that, in most cases, his model assigned higher selectional association scores to verb-object combinations which were judged more plausible by human subjects.",
                "cite_spans": [
                    {
                        "start": 65,
                        "end": 80,
                        "text": "Resnik's (1993)",
                        "ref_id": "BIBREF18"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Motivation",
                "sec_num": "1.1"
            },
            {
                "text": "We test five corpus-based models against human plausibility judgements:",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Motivation",
                "sec_num": "1.1"
            },
            {
                "text": "1. Familiarity of adjective-noun pair. We operationalise familiarity as co-occurrence frequency in a large corpus. We calculate the co-occurrence frequency of adjective-noun pairs in order to examine whether high corpus frequency is correlated with plausibility, and correspondingly low corpus frequency with implausibility.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Motivation",
                "sec_num": "1.1"
            },
            {
                "text": "2. Familiarity of head noun. We compare rated plausibility with the corpus frequency of the head noun, the motivation being that highly frequent nouns are more familiar than less frequent ones, and consequently may affect the judged plausibility of the whole noun phrase.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Motivation",
                "sec_num": "1.1"
            },
            {
                "text": "3. Conditional probability. Our inclusion of the conditional probability, P(noun I adjective), as a predictor variable also relies on the prediction that plausibility is correlated with corpus frequency. It differs from simple co-occurrence frequency in that it additionally takes the overall adjective frequency into account.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Motivation",
                "sec_num": "1.1"
            },
            {
                "text": "4. Coliocational status. We employ the loglikelihood ratio as a measure of the collocational status of the adjective-noun pair (Dunning, 1993; Daille, 1996) . If we assume that plausibility differences between strong tea and powerful tea or guilty verdict and guilty cat reflect differences in collocational status (i.e., appearing together more often than expected by their individual occurrence frequencies), as opposed to being semantic in nature, then the log-likelihood ratio may also predict adjective-noun plausibility.",
                "cite_spans": [
                    {
                        "start": 127,
                        "end": 142,
                        "text": "(Dunning, 1993;",
                        "ref_id": "BIBREF8"
                    },
                    {
                        "start": 143,
                        "end": 156,
                        "text": "Daille, 1996)",
                        "ref_id": "BIBREF7"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Motivation",
                "sec_num": "1.1"
            },
            {
                "text": "5. Selectional association. Finally, we evaluate plausibility ratings against Resnik's (1993) measure of selectional association. This measure is attractive because it combines statistical and knowledge-based methods. By exploiting a knowledge-based taxonomy, it can capture conceptual information about lexical items and hence can make predictions about word combinations which have not been seen in the corpus.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Motivation",
                "sec_num": "1.1"
            },
            {
                "text": "In the following section we describe our method for eliciting plausibility judgements for adjective-noun combinations. Section 3 reports the results of using the five corpus-based models as predictors of adjectivenoun plausibility. Finally, section 4 offers some discussion of future work, and section 5 concluding remarks.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Motivation",
                "sec_num": "1.1"
            },
            {
                "text": "In order to evaluate the different corpus-based models of adjective-noun plausibility introduced above, we first needed to establish an independent measure of plausibility. The standard approach used in experimental psycholinguistics is to elicit judgements from human subjects; in this section we describe our method for assembling the set of experimental materials and collecting plausibility ratings for these stimuli.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Collecting Plausibility Ratings",
                "sec_num": "2"
            },
            {
                "text": "The ideal test of any of the proposed models of adjective-noun plausibility will be with randomly-chosen materials. We chose 30 adjectives according to a set of minimal criteria (detailed below), and paired each adjective with a noun selected randomly from three different frequency ranges, which were defined by co-occurrence counts in the 100 million word British National Corpus (BNC; Burnard (1995) ). The experimental design thus consisted of one factor, Frequency Band, with three levels (High, Medium, and Low).",
                "cite_spans": [
                    {
                        "start": 388,
                        "end": 402,
                        "text": "Burnard (1995)",
                        "ref_id": "BIBREF1"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Method Materials and Design.",
                "sec_num": "2.1"
            },
            {
                "text": "We chose the adjectives to be minimally ambiguous: each adjective had exactly two senses according to WordNet (Miller et al., 1990) and was unambiguously tagged as \"adjective\" 98.6% of the time, measured as the number of different part-of-speech tags assigned to the word in the BNC. The 30 adjectives ranged in BNC frequency from 1.9 to 49.1 per million.",
                "cite_spans": [
                    {
                        "start": 110,
                        "end": 131,
                        "text": "(Miller et al., 1990)",
                        "ref_id": "BIBREF14"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Method Materials and Design.",
                "sec_num": "2.1"
            },
            {
                "text": "We identified adjective-noun pairs by using Gsearch (Corley et al., 1999) , a chart parser which detects syntactic patterns in a tagged corpus by exploiting a userspecified context free grammar and a syntactic query. Gsearch was run on a lemmatised version of the BNC so as to compile a comprehensive corpus count of all nouns occurring in a modifier-head relationship with each of the 30 adjectives. Examples of the syntactic patterns the parser identified are given in Table 1 . From the syntactic analysis provided by the parser we extracted a table containing the adjective and the head of the noun phrase following it. In the case of compound nouns, we only included sequences of two nouns, and considered the rightmost occurring noun as the head.",
                "cite_spans": [
                    {
                        "start": 52,
                        "end": 73,
                        "text": "(Corley et al., 1999)",
                        "ref_id": null
                    }
                ],
                "ref_spans": [
                    {
                        "start": 477,
                        "end": 478,
                        "text": "1",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "Method Materials and Design.",
                "sec_num": "2.1"
            },
            {
                "text": "From the retrieved adjective-noun pairs, we removed all pairs where the noun had a BNC frequency of less than 10 per million, as we wanted to reduce the risk of plausibility ratings being influenced by the presence of a noun unfamiliar to the subjects. Finally, for each adjective we divided the set of pairs into three \"bands\" (High, Medium, and Low), based on an equal division of the range of log-transformed co-occurrence frequency, and randomly chose one noun from each band. Example stimuli are shown in Table 2 . The mean log co-occurrence frequencies were 3.839, 2.066 and .258, for the High, Medium, and Low groups, respectively.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 516,
                        "end": 517,
                        "text": "2",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "Method Materials and Design.",
                "sec_num": "2.1"
            },
            {
                "text": "30 filler items were also included, in order to ensure subjects produced a wide range of plausibility ratings. These consisted of 30 adjective-noun combinations that were not found in a modifier-head relation in the BNC, and were also judged highly implausible by the authors.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Method Materials and Design.",
                "sec_num": "2.1"
            },
            {
                "text": "Procedure. The experimental paradigm was magnitude estimation (ME), a technique standardly used in psychophysics to measure judgements of sensory stimuli (Stevens, 1975) , which Bard et al. (1996) and Cowart (1997) have applied to the elicitation of linguistic judgements. The ME procedure requires subjects to estimate the magnitude of physical stimuli by assigning numerical values proportional to the stimulus magnitude they perceive. In contrast to the 5-or 7-point scale conventionally used to measure human intuitions, ME employs an interval scale, and therefore produces data for which parametric inferential statistics are valid.",
                "cite_spans": [
                    {
                        "start": 154,
                        "end": 169,
                        "text": "(Stevens, 1975)",
                        "ref_id": null
                    },
                    {
                        "start": 178,
                        "end": 196,
                        "text": "Bard et al. (1996)",
                        "ref_id": "BIBREF0"
                    },
                    {
                        "start": 201,
                        "end": 214,
                        "text": "Cowart (1997)",
                        "ref_id": "BIBREF4"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Method Materials and Design.",
                "sec_num": "2.1"
            },
            {
                "text": "ME requires subjects to assign numbers to a series of linguistic stimuli in a proportional fashion. Subjects are first exposed to a modulus item, which they assign an arbitrary number. All other stimuli are rated proportional to the modulus. In this way, each subject can establish their own rating scale, thus yielding maximally fine-graded data and avoiding the known problems with the conventional ordinal scales forlinguistic data (Bard et al., 1996; Cowart, 1997; Schfitze, 1996) .",
                "cite_spans": [
                    {
                        "start": 435,
                        "end": 454,
                        "text": "(Bard et al., 1996;",
                        "ref_id": "BIBREF0"
                    },
                    {
                        "start": 455,
                        "end": 468,
                        "text": "Cowart, 1997;",
                        "ref_id": "BIBREF4"
                    },
                    {
                        "start": 469,
                        "end": 484,
                        "text": "Schfitze, 1996)",
                        "ref_id": null
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Method Materials and Design.",
                "sec_num": "2.1"
            },
            {
                "text": "In the present experiment, subjects were presented with adjective-noun pairs and were asked to rate the degree of adjective-noun fit proportional to a modulus item. The experiment was carried out using WebExp, a set of Java-Classes for administering psycholinguistic studies over the Word-Wide Web (Keller et al., 1998) . Subjects first saw a set of instructions that explained the ME technique and included some exampies, and had to fill in a short questionnaire including basic demographic information. Each subject saw all 120 items used in the experiment (3 x 30 experimental items and 30 fillers).",
                "cite_spans": [
                    {
                        "start": 298,
                        "end": 319,
                        "text": "(Keller et al., 1998)",
                        "ref_id": "BIBREF11"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Method Materials and Design.",
                "sec_num": "2.1"
            },
            {
                "text": "Subjects. The experiment was completed by 24 unpaid volunteers, all native speakers of English. Subjects were recruited via postings to local Usenet newsgroups.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Method Materials and Design.",
                "sec_num": "2.1"
            },
            {
                "text": "As is standard in magnitude estimation studies, statistical tests were done using geometric means to normalise the data (the geometric mean is the mean of the logarithms of the ratings). An analysis of variance (ANOVA) indicated that the Frequency Band effect was significant, in both by-subjects and by-items analyses: FI(2, 46) = 79.09, p < .001; F2(2, 58) = 19.99, p < .001. The geometric mean of the ratings for adjective-noun combinations in the High band was 2.966, compared to Medium items at 2.660 and Low pairs at 2.271.1 Post-hoc Tukey tests indicated that the differences between all pairs of conditions were significant at o~ = .01, except for the difference between the High and Medium bands in the by-items analysis, which was significant at o~ = .05. These results are perhaps unsurprising: pairs that are more familiar are rated as more plausible than combinations that are less familiar. In the next section we explore the linear relationship between plausibility and co-occurrence frequency further, using correlation analysis.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Results and Discussion",
                "sec_num": "2.2"
            },
            {
                "text": "We correlated rated plausibility (Plaus) with the following five corpus-based variables: (1) logtransformed co-occurrence frequency (CoocF), measured as the number of times the adjective-noun pair occurs in the BNC; (2) log-transformed noun frequency (NounF), measured as the number of times the head noun occurs in the BNC; (3) conditional probability (CondP) of the noun given the adjective estimated as shown in equation ( 2); (4) collocational status, 2 estimated using the log-likelihood statistic (LLRatio); and (5) Resnik's measure of selectional association (SelAssoc), which measures the semantic fit of a particular semantic class c as an argument to a predicate pi. The selectional association between class c and predicate Pi is given in equations ( 3) and (4). More specifically, selectional association represents the contribution of a particular semantic class c to the total quantity of information provided by a predicate about the semantic class of its argument, when measured as the relative entropy between the prior distri-I For comparison, the filler items had a mean rating of .998.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Method",
                "sec_num": "3.1"
            },
            {
                "text": "2Mutual information, though potentially of interest as a measure of collocational status, was not tested due to its well-known property of overemphasising the significance of rare events (Church and Hanks, 1990) In the case of adjective-noun combinations, the selectional association measures the semantic fit of an adjective and each of the semantic classes of the nouns it co-occurs with. We estimated the probabilities P(c I Pi) and P(c) similarly to Resnik (1993) by using relative frequencies from the BNC, together with WordNet (Miller et al., 1990) as a source of taxonomic semantic class information. Although the selectional association is a function of the predicate and all semantic classes it potentially selects for, following Resnik's method for verb-object evaluation, we compared human plausibility judgements with the maximum value for the selectional association for each adjective-noun combination.",
                "cite_spans": [
                    {
                        "start": 187,
                        "end": 211,
                        "text": "(Church and Hanks, 1990)",
                        "ref_id": "BIBREF2"
                    },
                    {
                        "start": 534,
                        "end": 555,
                        "text": "(Miller et al., 1990)",
                        "ref_id": "BIBREF14"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Method",
                "sec_num": "3.1"
            },
            {
                "text": "Table 3 shows the models' predictions for three sample stimuli. The first row contains the geometric mean of the subjects' responses.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 6,
                        "end": 7,
                        "text": "3",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "Method",
                "sec_num": "3.1"
            },
            {
                "text": "The five corpus-based variables were submitted to a correlation analysis (see Tables 5 and 4 ). The highest correlation with judged plausibility was obtained with the familiarity of the adjective-noun combination (as operationalised by corpus co-occurrence frequency). Three other variables were also significantly correlated with plausibility ratings: the conditional probability P(noun [ adjective), the log-likelihood ratio, and Resnik's selectional association measure. We discuss each predictor variable in more detail: I. Familiarity of adjective-noun pair. Logtransformed corpus co-occurrence frequency was significantly correlated with plausibility (Pearson r = .570, n = 90, p < .01). This verifies the Frequency Band effect discovered by the ANOVA, in an analysis which compares the individual co-occurrence frequency for each item with rated plausibility, instead of collapsing 30 pairs together into an equivalence class. Familiarity appears to be a strong determinant of adjective-noun plausibility.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 85,
                        "end": 86,
                        "text": "5",
                        "ref_id": "TABREF3"
                    },
                    {
                        "start": 91,
                        "end": 92,
                        "text": "4",
                        "ref_id": "TABREF2"
                    }
                ],
                "eq_spans": [],
                "section": "Results",
                "sec_num": "3.2"
            },
            {
                "text": "2. Familiarity of head noun. Log frequency of the head noun was not significantly correlated with plausibility (r = .098), which suggests that adjective-noun plausibility judgements are not influenced by noun familiarity.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Results",
                "sec_num": "3.2"
            },
            {
                "text": "3. Conditional probability. The probability of the noun given the adjective was significantly correlated with plausibility (r = .220, p < .05). This is unsurprising, as conditional probability was also correlated with co-occurrence frequency (r = .497, p < .01).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Results",
                "sec_num": "3.2"
            },
            {
                "text": "4. Collocational status. The log-likelihood statistic yielded a significant correlation with plausibility (r = .350, p < .01), a fact that supports the collocational nature of plausible adjectivenoun combinations. The log-likelihood ratio was in turn correlated with co-occurrence frequency (r = .725, p < .01) and conditional probability (r = .405, p < .01).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Results",
                "sec_num": "3.2"
            },
            {
                "text": "5. Selectional association. Resnik's measure of selectional association was also significantly correlated with plausibility (r = -.269, p < .05). .22",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Results",
                "sec_num": "3.2"
            },
            {
                "text": "Table 3 : Models' prediction for hungry and its three paired noun heads However, it should be noted that selectional association was negatively correlated with plausibility, although Resnik found the measure was positively correlated with the judged plausibility of verb-object combinations, consistent with its information-theoretic motivation. Resnik's metric was also negatively correlated with cooccurrence frequency (r = -.226, p < .05), but there was no correlation with noun frequency, conditional probability, or log-likelihood ratio.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 6,
                        "end": 7,
                        "text": "3",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "Plaus",
                "sec_num": null
            },
            {
                "text": "Since several of the corpus-based variables were intercorrelated, we also calculated the squared semipartial correlations between plausibility and each corpusbased variable. This allows the unique relationship between each predictor and plausibility (removing the effects of the other independent variables) to be determined. Co-occurrence frequency accounted uniquely for 15.52% of the variance in plausibility ratings, while noun frequency, conditional probability, loglikelihood ratio, and selectional association accounted for .51%, .53%, .41% and 1.7% of the variance, respectively. This confirms co-occurrence frequency as the best predictor of adjective-noun plausibility.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Plaus",
                "sec_num": null
            },
            {
                "text": "One explanation for the negative correlation between selectional association and plausibility, also pointed out by Resnik, is the difference between verb-object and adjective-noun combinations: combinations of the latter type are more lexical than conceptual in nature and hence cannot be accounted for on purely semantic or syntactic grounds. The abstraction provided by a semantic taxonomy is at odds with the idiosyncratic (i.e., lexical) nature of adjective-noun co-occurrences. Consider for instance the adjective hungry. The class (entity) yields the highest selectional association value for the highest rated pair hungry animal. But (entity) also yields the highest association for the lowest rated pair hungry application (A(hungry, (entity}) = .50 in both cases). The highest association for hungry pleasure, on the other hand, is given by the class (act) (A(hungry, (act)) = .22). This demonstrates how the method tends to prefer the most frequent classes in the taxonomy (e.g., (entity), (act)) over less frequent, but intuitively more plausible classes (e.g., (feeling) for pleasure and (use} for application).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Plaus",
                "sec_num": null
            },
            {
                "text": "This is a general problem with the estimation of the probability of a class of a given predicate in Resnik's method, as the probability is assumed to be uniform for all classes of a given noun with which the predicate co-occurs. Although the improvements suggested by Ribas (1994) try to remedy this by taking the different senses of a given word into account and implementing selectional restrictions in the form of weighted disjunctions, the experiments reported here indicate that methods based on taxonomic knowledge have difficulties capturing the idiosyncratic (i.e., lexicalist) nature of adjective-noun combinations.",
                "cite_spans": [
                    {
                        "start": 268,
                        "end": 280,
                        "text": "Ribas (1994)",
                        "ref_id": "BIBREF19"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Plaus",
                "sec_num": null
            },
            {
                "text": "Finally, idiosyncrasies in WordNet itself influence the performance of Resnik's model. One problem is that sense distinctions in WordNet axe often too fine-grained (Palmer (1999) makes a similar observation). Furthermore, there is considerable redundancy in the definition of word senses. Consider the noun application: it has 27 classes in WordNet which include (code), (coding system), (software), (communication}, (writing) and (written communication}. It is difficult to see how (code} or (coding system} is not (software} or (writing) is not (written communication).",
                "cite_spans": [
                    {
                        "start": 164,
                        "end": 178,
                        "text": "(Palmer (1999)",
                        "ref_id": "BIBREF16"
                    },
                    {
                        "start": 400,
                        "end": 426,
                        "text": "(communication}, (writing)",
                        "ref_id": null
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Plaus",
                "sec_num": null
            },
            {
                "text": "The fine granularity and the degree of redundancy in the taxonomy bias the estimation of the frequency of a given class. Resnik's model cannot distinguish classes which are genuinely frequent from classes which are infrequent but yet overly specified.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Plaus",
                "sec_num": null
            },
            {
                "text": "Although familiarity of the adjective-noun combination proved to be the most predictive measure of judged plausibility, it is obvious that this measure will fail for adjective-noun pairs that never co-occur at all in the training corpus. Is a zero co-occurrence count merely the result of insufficient evidence, or is it a reflection of a linguistic constraint? We plan to conduct another rating experiment, this time with a selection of stimuli that have a co-occurrence frequency of zero in the BNC. These data will allow a further test of Resnik's selectional association measure. We also plan to investigate the application of similarity-based smoothing (Dagan et ai., 1999) to zero co-occurrence counts, as this method is specifically aimed at distinguishing between unobserved events which are likely to occur in language from those that are not. Plausibility ratings provide a suitable test of the psychological validity of co-occurrence frequencies \"recreated\" with this method.",
                "cite_spans": [
                    {
                        "start": 658,
                        "end": 678,
                        "text": "(Dagan et ai., 1999)",
                        "ref_id": null
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Future Work",
                "sec_num": "4"
            },
            {
                "text": "This paper explored the determinants of linguistic plausibility, a concept that is potentially relevant for lexical choice in natural language generation systems. Adjective-noun plausibility served as a test bed for a number of corpus-based models of linguistic plausibility. Plausibility judgements were obtained from human subjects for 90 randomly selected adjective-noun pairs. The ratings revealed a clear effect of familiarity of the adjective-noun pair (operationalised by corpus co-occurrence frequency).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Conclusions",
                "sec_num": "5"
            },
            {
                "text": "In a correlation analysis we compared judged plausibility with the predictions of five corpus-based variables. The highest correlation was obtained with the co-occurrence frequency of the adjective-noun pair. Conditional probability, the log-likelihood ratio, and Resnik's (1993) selectional association measure were also significantly correlated with plausibility ratings. The correlation with Resnik's measure was negative, contrary to the predictions of his model. This points to a problem with his technique for estimating word class frequencies, which is aggravated by the collocational nature of noun-adjective combinations.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Conclusions",
                "sec_num": "5"
            },
            {
                "text": "Overall, the results confirm the strongly lexicalist and collocational nature of adjective-noun combinations. This fact could be exploited in a generation system by taking into account corpus co-occurrence counts for adjective-noun pairs (which can be obtained straightforwardly) during lexical choice. Future research has to identify how this approach can be generalised to unseen data.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Conclusions",
                "sec_num": "5"
            }
        ],
        "back_matter": [
            {
                "text": "The authors acknowledge the support of the Alexander S. Onassis Foundation (Lapata), the UK Economic and Social Research Council (Keller, Lapata), the Natural Sciences and Engineering Research Council of Canada, and the ORS Awards Scheme (McDonald).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Acknowledgements",
                "sec_num": null
            }
        ],
        "bib_entries": {
            "BIBREF0": {
                "ref_id": "b0",
                "title": "Magnitude estimation of linguistic acceptability",
                "authors": [
                    {
                        "first": "Ellen Gurman",
                        "middle": [],
                        "last": "Bard",
                        "suffix": ""
                    },
                    {
                        "first": "Dan",
                        "middle": [],
                        "last": "Robertson",
                        "suffix": ""
                    },
                    {
                        "first": "Antonella",
                        "middle": [],
                        "last": "Sorace",
                        "suffix": ""
                    }
                ],
                "year": 1996,
                "venue": "Language",
                "volume": "72",
                "issue": "1",
                "pages": "32--68",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Ellen Gurman Bard, Dan Robertson, and Antonella Sorace. 1996. Magnitude estimation of linguistic acceptability. Language, 72(1):32-68.",
                "links": null
            },
            "BIBREF1": {
                "ref_id": "b1",
                "title": "Users Guide for the British National Corpus. British National Corpus Consortium",
                "authors": [
                    {
                        "first": "Lou",
                        "middle": [],
                        "last": "Burnard",
                        "suffix": ""
                    }
                ],
                "year": 1995,
                "venue": "",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Lou Burnard, 1995. Users Guide for the British Na- tional Corpus. British National Corpus Consor- tium, Oxford University Computing Service.",
                "links": null
            },
            "BIBREF2": {
                "ref_id": "b2",
                "title": "Word association norms, mutual informations, and lexicography",
                "authors": [
                    {
                        "first": "Kenneth",
                        "middle": [
                            "Ward"
                        ],
                        "last": "Church",
                        "suffix": ""
                    },
                    {
                        "first": "Patrick",
                        "middle": [],
                        "last": "Hanks",
                        "suffix": ""
                    }
                ],
                "year": 1990,
                "venue": "Computational Linguistics",
                "volume": "16",
                "issue": "1",
                "pages": "22--29",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Kenneth Ward Church and Patrick Hanks. 1990. Word association norms, mutual informations, and lexicography. Computational Linguistics, 16(1):22-29.",
                "links": null
            },
            "BIBREF4": {
                "ref_id": "b4",
                "title": "Experimental Syntax: Applying Objective Methods to Sentence Judgments",
                "authors": [
                    {
                        "first": "Wayne",
                        "middle": [],
                        "last": "Cowart",
                        "suffix": ""
                    }
                ],
                "year": 1997,
                "venue": "",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Wayne Cowart. 1997. Experimental Syntax: Applying Objective Methods to Sentence Judgments. Sage Publications, Thousand Oaks, CA.",
                "links": null
            },
            "BIBREF5": {
                "ref_id": "b5",
                "title": "Lexical Semantics. Cambridge Textbooks in Linguistics",
                "authors": [
                    {
                        "first": "D",
                        "middle": [
                            "A"
                        ],
                        "last": "Cruse",
                        "suffix": ""
                    }
                ],
                "year": 1986,
                "venue": "",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "D. A. Cruse. 1986. Lexical Semantics. Cam- bridge Textbooks in Linguistics. Cambridge Uni- versity Press, Cambridge.",
                "links": null
            },
            "BIBREF6": {
                "ref_id": "b6",
                "title": "Similarity-based models of word cooccurrence probabilities",
                "authors": [
                    {
                        "first": "Ido",
                        "middle": [],
                        "last": "Dagan",
                        "suffix": ""
                    },
                    {
                        "first": "Lillian",
                        "middle": [],
                        "last": "Lee",
                        "suffix": ""
                    },
                    {
                        "first": "Fernando",
                        "middle": [],
                        "last": "Pereira",
                        "suffix": ""
                    }
                ],
                "year": 1999,
                "venue": "Machine Learning",
                "volume": "34",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Ido Dagan, Lillian Lee, and Fernando Pereira. 1999. Similarity-based models of word cooccurrence probabilities. Machine Learning, 34(1).",
                "links": null
            },
            "BIBREF7": {
                "ref_id": "b7",
                "title": "Study and implementation of combined techniques for automatic extraction of terminology",
                "authors": [
                    {
                        "first": "B6atrice",
                        "middle": [],
                        "last": "Daille",
                        "suffix": ""
                    }
                ],
                "year": 1996,
                "venue": "The Balancing Act: Combining Symbolic and Statistical Approaches to Language",
                "volume": "",
                "issue": "",
                "pages": "49--66",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "B6atrice Daille. 1996. Study and implementation of combined techniques for automatic extraction of terminology. In Judith Klavans and Philip Resnik, editors, The Balancing Act: Combining Symbolic and Statistical Approaches to Language, pages 49- 66. MIT Press, Cambridge, MA.",
                "links": null
            },
            "BIBREF8": {
                "ref_id": "b8",
                "title": "Accurate methods for the statistics of surprise and coincidence",
                "authors": [
                    {
                        "first": "Ted",
                        "middle": [],
                        "last": "Dunning",
                        "suffix": ""
                    }
                ],
                "year": 1993,
                "venue": "Computational Linguistics",
                "volume": "19",
                "issue": "1",
                "pages": "61--74",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Ted Dunning. 1993. Accurate methods for the statis- tics of surprise and coincidence. Computational Linguistics, 19( 1 ):61-74.",
                "links": null
            },
            "BIBREF9": {
                "ref_id": "b9",
                "title": "The contributions of verb bias and plausibility to the comprehension of temporarily ambiguous sentences",
                "authors": [
                    {
                        "first": "Susan",
                        "middle": [
                            "M"
                        ],
                        "last": "Garnsey",
                        "suffix": ""
                    },
                    {
                        "first": "J",
                        "middle": [],
                        "last": "Neai",
                        "suffix": ""
                    },
                    {
                        "first": "Elisabeth",
                        "middle": [
                            "M"
                        ],
                        "last": "Pearlmutter",
                        "suffix": ""
                    },
                    {
                        "first": "Melanie",
                        "middle": [
                            "A"
                        ],
                        "last": "Myers",
                        "suffix": ""
                    },
                    {
                        "first": "",
                        "middle": [],
                        "last": "Lotocky",
                        "suffix": ""
                    }
                ],
                "year": 1997,
                "venue": "Journal of Memory and Language",
                "volume": "37",
                "issue": "1",
                "pages": "58--93",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Susan M. Garnsey, NeaI J. Pearlmutter, Elisabeth M. Myers, and Melanie A. Lotocky. 1997. The contri- butions of verb bias and plausibility to the compre- hension of temporarily ambiguous sentences. Jour- nal of Memory and Language, 37(1 ):58-93.",
                "links": null
            },
            "BIBREF10": {
                "ref_id": "b10",
                "title": "Lexical expectations in parsing complement-verb sentences",
                "authors": [
                    {
                        "first": "V",
                        "middle": [
                            "M"
                        ],
                        "last": "Holmes",
                        "suffix": ""
                    },
                    {
                        "first": "L",
                        "middle": [],
                        "last": "Stowe",
                        "suffix": ""
                    },
                    {
                        "first": "L",
                        "middle": [],
                        "last": "Cupples",
                        "suffix": ""
                    }
                ],
                "year": 1989,
                "venue": "Journal of Memory and Language",
                "volume": "28",
                "issue": "6",
                "pages": "668--689",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "V. M. Holmes, L. Stowe, and L. Cupples. 1989. Lexical expectations in parsing complement-verb sentences. Journal of Memory and Language, 28(6):668-689.",
                "links": null
            },
            "BIBREF11": {
                "ref_id": "b11",
                "title": "Web-Exp: A Java toolbox for web-based psychological experiments",
                "authors": [
                    {
                        "first": "Frank",
                        "middle": [],
                        "last": "Keller",
                        "suffix": ""
                    },
                    {
                        "first": "Martin",
                        "middle": [],
                        "last": "Corley",
                        "suffix": ""
                    },
                    {
                        "first": "Steffan",
                        "middle": [],
                        "last": "Corley",
                        "suffix": ""
                    },
                    {
                        "first": "Lars",
                        "middle": [],
                        "last": "Konieczny",
                        "suffix": ""
                    },
                    {
                        "first": "Amalia",
                        "middle": [],
                        "last": "Todirascu",
                        "suffix": ""
                    }
                ],
                "year": 1998,
                "venue": "",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Frank Keller, Martin Corley, Steffan Corley, Lars Konieczny, and Amalia Todirascu. 1998. Web- Exp: A Java toolbox for web-based psychological experiments. Technical Report HCRC/TR-99, Hu- man Communication Research Centre, University of Edinburgh.",
                "links": null
            },
            "BIBREF12": {
                "ref_id": "b12",
                "title": "Two-level, many paths generation",
                "authors": [
                    {
                        "first": "Kevin",
                        "middle": [],
                        "last": "Knight",
                        "suffix": ""
                    },
                    {
                        "first": "Vasileios",
                        "middle": [],
                        "last": "Hatzivassiloglou",
                        "suffix": ""
                    }
                ],
                "year": 1995,
                "venue": "Proceedings of the 33rd Annual Meeting of the Association for Computational Linguistics",
                "volume": "",
                "issue": "",
                "pages": "252--260",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Kevin Knight and Vasileios Hatzivassiloglou. 1995. Two-level, many paths generation. In Proceedings of the 33rd Annual Meeting of the Association for Computational Linguistics, pages 252-260, Cam- bridge, MA.",
                "links": null
            },
            "BIBREF13": {
                "ref_id": "b13",
                "title": "Generation that exploits corpus-based statistical knowledge",
                "authors": [
                    {
                        "first": "Irene",
                        "middle": [],
                        "last": "Langkilde",
                        "suffix": ""
                    },
                    {
                        "first": "Kevin",
                        "middle": [],
                        "last": "Knight",
                        "suffix": ""
                    }
                ],
                "year": 1998,
                "venue": "Proceedings of the 17th International Conference on Computational Linguistics and 36th Annual Meeting of the Association for Computational Linguistics",
                "volume": "",
                "issue": "",
                "pages": "704--710",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Irene Langkilde and Kevin Knight. 1998, Gener- ation that exploits corpus-based statistical knowl- edge. In Proceedings of the 17th International Con- ference on Computational Linguistics and 36th An- nual Meeting of the Association for Computational Linguistics, pages 704-710, Montr6al.",
                "links": null
            },
            "BIBREF14": {
                "ref_id": "b14",
                "title": "Introduction to WordNet: an on-line lexical database",
                "authors": [
                    {
                        "first": "George",
                        "middle": [
                            "A"
                        ],
                        "last": "Miller",
                        "suffix": ""
                    },
                    {
                        "first": "Richard",
                        "middle": [],
                        "last": "Beckwith",
                        "suffix": ""
                    },
                    {
                        "first": "Christiane",
                        "middle": [],
                        "last": "Fellbaum",
                        "suffix": ""
                    },
                    {
                        "first": "Derek",
                        "middle": [],
                        "last": "Gross",
                        "suffix": ""
                    },
                    {
                        "first": "Katherine",
                        "middle": [
                            "J"
                        ],
                        "last": "Miller",
                        "suffix": ""
                    }
                ],
                "year": 1990,
                "venue": "International Journal of Lexicography",
                "volume": "3",
                "issue": "4",
                "pages": "235--244",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "George A. Miller, Richard Beckwith, Christiane Fellbaum, Derek Gross, and Katherine J. Miller. 1990. Introduction to WordNet: an on-line lexical database. International Journal of Lexicography, 3(4):235-244.",
                "links": null
            },
            "BIBREF15": {
                "ref_id": "b15",
                "title": "Noun phrase interpretation and noun combination",
                "authors": [
                    {
                        "first": "Gregory",
                        "middle": [
                            "L"
                        ],
                        "last": "Murphy",
                        "suffix": ""
                    }
                ],
                "year": 1990,
                "venue": "Journal of Memory and Language",
                "volume": "29",
                "issue": "3",
                "pages": "259--288",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Gregory L. Murphy. 1990. Noun phrase interpreta- tion and noun combination. Journal of Memory and Language, 29(3):259-288.",
                "links": null
            },
            "BIBREF16": {
                "ref_id": "b16",
                "title": "Consistent criteria for sense distinctions",
                "authors": [
                    {
                        "first": "Martha",
                        "middle": [],
                        "last": "Palmer",
                        "suffix": ""
                    }
                ],
                "year": 1999,
                "venue": "Computers and the Humanities",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Martha Palmer. 1999. Consistent criteria for sense distinctions. Computers and the Humanities, to ap- pear.",
                "links": null
            },
            "BIBREF17": {
                "ref_id": "b17",
                "title": "Plausibility and recovery from garden paths: An eyetracking study",
                "authors": [
                    {
                        "first": "Martin",
                        "middle": [
                            "J"
                        ],
                        "last": "Pickering",
                        "suffix": ""
                    },
                    {
                        "first": "Martin",
                        "middle": [
                            "J"
                        ],
                        "last": "Traxler",
                        "suffix": ""
                    }
                ],
                "year": 1998,
                "venue": "Journal of Experimental Psychology: Learning Memory and Cognition",
                "volume": "24",
                "issue": "4",
                "pages": "940--961",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Martin J. Pickering and Martin J. Traxler. 1998. Plau- sibility and recovery from garden paths: An eye- tracking study. Journal of Experimental Psychol- ogy: Learning Memory and Cognition, 24(4):940- 961.",
                "links": null
            },
            "BIBREF18": {
                "ref_id": "b18",
                "title": "Selection and Information: A Class-Based Approach to Lexical Relationships",
                "authors": [
                    {
                        "first": "Philip",
                        "middle": [],
                        "last": "Stuart",
                        "suffix": ""
                    },
                    {
                        "first": "Resnik",
                        "middle": [],
                        "last": "",
                        "suffix": ""
                    }
                ],
                "year": 1993,
                "venue": "",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Philip Stuart Resnik. 1993. Selection and Informa- tion: A Class-Based Approach to Lexical Relation- ships. Ph.D. thesis, University of Pennsylvania.",
                "links": null
            },
            "BIBREF19": {
                "ref_id": "b19",
                "title": "On learning more appropriate selectional restrictions",
                "authors": [
                    {
                        "first": "Francesc",
                        "middle": [],
                        "last": "Ribas",
                        "suffix": ""
                    }
                ],
                "year": 1994,
                "venue": "Proceedings of the 32nd Annual Meeting of the Association for Computational Linguistics",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Francesc Ribas. 1994. On learning more appropri- ate selectional restrictions. In Proceedings of the 32nd Annual Meeting of the Association for Com- putational Linguistics, Las Cruces, NM.",
                "links": null
            },
            "BIBREF20": {
                "ref_id": "b20",
                "title": "The Empirical Base of Linguistics: Grammaticality Judgments and Linguistic Methodology",
                "authors": [
                    {
                        "first": "Carson",
                        "middle": [
                            "T"
                        ],
                        "last": "Schiitze",
                        "suffix": ""
                    }
                ],
                "year": 1996,
                "venue": "",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Carson T. Schiitze. 1996. The Empirical Base of Lin- guistics: Grammaticality Judgments and Linguis- tic Methodology. University of Chicago Press, Chicago.",
                "links": null
            },
            "BIBREF21": {
                "ref_id": "b21",
                "title": "Macrocoding the lexicon with co-occurrence knowledge",
                "authors": [
                    {
                        "first": "Frank",
                        "middle": [],
                        "last": "Smadja",
                        "suffix": ""
                    }
                ],
                "year": 1991,
                "venue": "Lexical Acquisition: Using Online Resources to Build a Lexicon",
                "volume": "",
                "issue": "",
                "pages": "165--189",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Frank Smadja. 1991. Macrocoding the lexicon with co-occurrence knowledge. In Uri Zernik, ed- itor, Lexical Acquisition: Using Online Resources to Build a Lexicon, pages 165-189. Erlbaum, Hills- dale, NJ.",
                "links": null
            },
            "BIBREF22": {
                "ref_id": "b22",
                "title": "Psychophysics: Introduction to its Perceptual Neural and Social Prospects",
                "authors": [],
                "year": 1975,
                "venue": "",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Stanley S. Stevens, editor. 1975. Psychophysics: Introduction to its Perceptual Neural and Social Prospects. John Wiley, New York.",
                "links": null
            }
        },
        "ref_entries": {
            "FIGREF0": {
                "num": null,
                "text": "A(pi, c) = I. e(c I Pi)\" log P(c I Pi _______~) rli P(c) (4) rli=~-~P(clpi).logP(Cplc;i) C",
                "uris": null,
                "fig_num": "3",
                "type_str": "figure"
            },
            "TABREF0": {
                "content": "<table><tr><td>Pattern</td><td/><td/><td>Example</td><td/><td/></tr><tr><td colspan=\"2\">adjective noun</td><td/><td colspan=\"3\">educational material</td></tr><tr><td colspan=\"6\">adjective specifier noun usual weekly classes</td></tr><tr><td colspan=\"3\">adjective noun noun</td><td colspan=\"4\">environmental health officers</td></tr><tr><td colspan=\"6\">Table 1: Example of noun-adjective patterns</td></tr><tr><td/><td/><td colspan=\"4\">Co-occurrence Frequency Band</td></tr><tr><td>Adjective</td><td>High</td><td>l</td><td colspan=\"2\">Medium</td><td>I</td><td>Low</td></tr><tr><td>hungry</td><td colspan=\"6\">animal 1.79 pleasure 1.38 application</td><td>0</td></tr><tr><td>guilty</td><td colspan=\"3\">verdict 3.91 secret</td><td colspan=\"2\">2.56 cat</td><td>0</td></tr><tr><td colspan=\"2\">temporary job</td><td colspan=\"2\">4.71 post</td><td colspan=\"2\">2.07 cap</td><td>.69</td></tr><tr><td>naughty</td><td>girl</td><td colspan=\"2\">2.94 dog</td><td/><td>1.6 lunch</td><td>.69</td></tr><tr><td colspan=\"7\">Table 2: Example stimuli (with log co-occurrence frequencies in the BNC)</td></tr><tr><td colspan=\"3\">bution of classes p(c) and the posterior distribution</td><td/><td/><td/></tr><tr><td colspan=\"3\">p(c I pi) of the argument classes for a particular pred-</td><td/><td/><td/></tr><tr><td>icate Pi.</td><td/><td/><td/><td/><td/></tr><tr><td colspan=\"3\">f (adjective, noun) (2) P(noun l adjective) = f (adjective)</td><td/><td/><td/></tr></table>",
                "type_str": "table",
                "text": ".",
                "html": null,
                "num": null
            },
            "TABREF2": {
                "content": "<table><tr><td colspan=\"6\">II Plaus t CoocF I NounF I CondP I</td><td>LLRatio</td><td>SelAssoc</td></tr><tr><td>Min</td><td/><td>.770</td><td>0</td><td>6.988</td><td>.0002</td><td>.02</td><td>.100</td></tr><tr><td>Max</td><td colspan=\"2\">3.240</td><td>5.037</td><td>11.929</td><td>.2139</td><td>1734.88</td><td>!.000</td></tr><tr><td>Mean</td><td colspan=\"2\">2.632</td><td>2.054</td><td>9.411</td><td>.0165</td><td>176.24</td><td>.288</td></tr><tr><td>Std Dev</td><td/><td>.529</td><td>1.583</td><td>1.100</td><td>.0312</td><td>334.23</td><td>.170</td></tr><tr><td/><td/><td/><td>Plaus</td><td>CoocF</td><td colspan=\"2\">NounF I CondP</td><td>LLRatio</td></tr><tr><td>CoocF</td><td/><td/><td>.570**</td><td/><td/><td/></tr><tr><td>NounF</td><td/><td/><td>.098</td><td>.221\"</td><td/><td/></tr><tr><td>CondP</td><td/><td/><td>.220*</td><td>.497**</td><td>.008</td><td/></tr><tr><td>LLRatio</td><td/><td/><td>.350**</td><td>.725**</td><td>.001</td><td>.405**</td></tr><tr><td colspan=\"2\">SelAssoc</td><td colspan=\"2\">-.269*</td><td>-.226*</td><td>-.191</td><td>-.097</td><td>.015</td></tr><tr><td/><td/><td colspan=\"5\">*p &lt; .05 (2-tailed) **p &lt; .01 (2-tailed)</td></tr></table>",
                "type_str": "table",
                "text": "Descriptive statistics for the six experimental variables",
                "html": null,
                "num": null
            },
            "TABREF3": {
                "content": "<table/>",
                "type_str": "table",
                "text": "Correlation matrix for plausibility and the five corpus-based variables",
                "html": null,
                "num": null
            }
        }
    }
}