{
    "paper_id": "H05-1062",
    "header": {
        "generated_with": "S2ORC 1.0.0",
        "date_generated": "2023-06-16T12:28:36.321313Z"
    },
    "title": "Robust Named Entity extraction from large spoken archives",
    "authors": [
        {
            "first": "Benoît",
            "middle": [],
            "last": "Favre",
            "suffix": "",
            "affiliation": {
                "laboratory": "MMP Laboratory Colombes",
                "institution": "",
                "location": {
                    "settlement": "Thales",
                    "country": "France"
                }
            },
            "email": "benoit.favre@fr.thalesgroup.com"
        },
        {
            "first": "Frédéric",
            "middle": [],
            "last": "Béchet",
            "suffix": "",
            "affiliation": {
                "laboratory": "",
                "institution": "University of Avignon",
                "location": {
                    "settlement": "Avignon",
                    "country": "France"
                }
            },
            "email": "frederic.bechet@univ-avignon.fr"
        },
        {
            "first": "Pascal",
            "middle": [],
            "last": "Nocéra",
            "suffix": "",
            "affiliation": {
                "laboratory": "",
                "institution": "University of Avignon",
                "location": {
                    "settlement": "Avignon",
                    "country": "France"
                }
            },
            "email": "pascal.nocera@univ-avignon.fr"
        }
    ],
    "year": "",
    "venue": null,
    "identifiers": {},
    "abstract": "Traditional approaches to Information Extraction (IE) from speech input simply consist in applying text based methods to the output of an Automatic Speech Recognition (ASR) system. If it gives satisfaction with low Word Error Rate (WER) transcripts, we believe that a tighter integration of the IE and ASR modules can increase the IE performance in more difficult conditions. More specifically this paper focuses on the robust extraction of Named Entities from speech input where a temporal mismatch between training and test corpora occurs. We describe a Named Entity Recognition (NER) system, developed within the French Rich Broadcast News Transcription program ESTER, which is specifically optimized to process ASR transcripts and can be integrated into the search process of the ASR modules. Finally we show how some metadata information can be collected in order to adapt NER and ASR models to new conditions and how they can be used in a task of Named Entity indexation of spoken archives.",
    "pdf_parse": {
        "paper_id": "H05-1062",
        "_pdf_hash": "",
        "abstract": [
            {
                "text": "Traditional approaches to Information Extraction (IE) from speech input simply consist in applying text based methods to the output of an Automatic Speech Recognition (ASR) system. If it gives satisfaction with low Word Error Rate (WER) transcripts, we believe that a tighter integration of the IE and ASR modules can increase the IE performance in more difficult conditions. More specifically this paper focuses on the robust extraction of Named Entities from speech input where a temporal mismatch between training and test corpora occurs. We describe a Named Entity Recognition (NER) system, developed within the French Rich Broadcast News Transcription program ESTER, which is specifically optimized to process ASR transcripts and can be integrated into the search process of the ASR modules. Finally we show how some metadata information can be collected in order to adapt NER and ASR models to new conditions and how they can be used in a task of Named Entity indexation of spoken archives.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Abstract",
                "sec_num": null
            }
        ],
        "body_text": [
            {
                "text": "Named Entity Recognition (NER) is a crucial step in many Information Extraction (IE) tasks. It has been a specific task in several evaluation pro-grams such as the Message Understanding Conferences (MUC), the Conferences on Natural Language Learning (CoNLL), the DARPA HUB-5 program or more recently the French ESTER Rich Transcription program on Broadcast News data. Most of these conferences have studied the impact of using transcripts generated by an Automatic Speech Recognition (ASR) system rather than written texts. It appears from these studies that unlike other IE tasks, NER performance is greatly affected by the Word Error Rate (WER) of the transcripts processed. To tackle this problem, different ideas have been proposed: modeling explicitly the ASR errors (Palmer and Ostendorf, 2001) or using the ASR system alternate hypotheses found in word lattices (Saraclar and Sproat, 2004) . However performance in NER decreases dramatically when processing high WER transcripts like the ones that are obtained with unmatched conditions between the ASR training model and the data to process. This paper investigates this phenomenon in the framework of the NER task of the French Rich Transcription program of Broadcast News ESTER (Gravier et al., 2004) . Several issues are addressed:",
                "cite_spans": [
                    {
                        "start": 772,
                        "end": 800,
                        "text": "(Palmer and Ostendorf, 2001)",
                        "ref_id": "BIBREF11"
                    },
                    {
                        "start": 869,
                        "end": 896,
                        "text": "(Saraclar and Sproat, 2004)",
                        "ref_id": "BIBREF14"
                    },
                    {
                        "start": 1238,
                        "end": 1260,
                        "text": "(Gravier et al., 2004)",
                        "ref_id": "BIBREF9"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "• how to jointly optimize the ASR and the NER models ?",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "• what is the impact in term of ASR and NER performance of a temporal mismatch between the corpora used to train and test the models and how can it be recovered by means of metadata information ?",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "• Can metadata information be used for indexing large spoken archives ?",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "After a quick overview of related works in IE from speech input, we present the ESTER evaluation program ; then we introduce a NER system tightly integrated to the ASR process and show how it can successfully index high WER spoken databases thanks to metadata.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "The NIST Topic Detection and Tracking (Fiscus and Doddington, 2002) and TREC document retrieval evaluation programs has studied the impact of recognition errors in the overall performance of Information Extraction systems for tasks like story segmentation or topic detection and retrieval. This impact has been shown to be very limited compared to clean text corpora. The main explanation for this phenomenon is the redundancy effect: themes, topics are very likely to be represented in texts by many occurrences of salient words characterizing them. Therefore, even if some of these words are missing, numerical Information Extraction methods can use the remaining salient words and discard the noise generated by ASR errors. However, this phenomenon is not true for tasks related to the extraction of fine grained entities, like Named Entities. Indeed, several studies have shown that F-measure and WER are strongly correlated : 0.7 points of F-measure lost for each additional 1% of WER according to (Miller et al., 2000) on the experiments of 1998 NIST Hub-4 evaluations (Przybocki et al., 1999) .",
                "cite_spans": [
                    {
                        "start": 38,
                        "end": 67,
                        "text": "(Fiscus and Doddington, 2002)",
                        "ref_id": "BIBREF8"
                    },
                    {
                        "start": 1003,
                        "end": 1024,
                        "text": "(Miller et al., 2000)",
                        "ref_id": "BIBREF10"
                    },
                    {
                        "start": 1075,
                        "end": 1099,
                        "text": "(Przybocki et al., 1999)",
                        "ref_id": "BIBREF12"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Information extraction from large spoken archives",
                "sec_num": "2"
            },
            {
                "text": "Despite the continuous improvement of ASR techniques, high WER transcriptions are inevitable in difficult conditions like those found in large spoken archives like in the MALACH project (Ramabhadran et al., 2003) . Moreover, Named Entities extraction performance is greatly affected by a mismatch between training and testing data. This is due mainly because proper names, which represent most of the Named Entity items, are a very dynamic category of words, strongly related to the period of time representing the documents to process. Therefore this mismatch is inevitable when dealing with archives spreading over a long period of time and containing multiple domain information.",
                "cite_spans": [
                    {
                        "start": 186,
                        "end": 212,
                        "text": "(Ramabhadran et al., 2003)",
                        "ref_id": "BIBREF13"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Information extraction from large spoken archives",
                "sec_num": "2"
            },
            {
                "text": "One way of tackling this problem is to gather metadata information related to the documents to process. This information can be newspaper corpora related to the same period of time, abstract describing the document content, or simply lists of terms or entities likely to occur. Although such collected data can be used to update the ASR and NER models, the potential gain is rather small unless the metadata corpus gathered fits perfectly the document to process and is of a reasonable size. But another way of exploiting this metadata information is to use it as set of index terms that are going to be explicitly looked for in the processed documents. We present in section 7 an implementation of this idea that uses word lattices as input. • persons (pers): human beings, fiction characters, animals;",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Information extraction from large spoken archives",
                "sec_num": "2"
            },
            {
                "text": "• locations (loc): geographical, traffic lines, electronic and real addresses, dial numbers;",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "The ESTER Named Entity evaluation program",
                "sec_num": "3"
            },
            {
                "text": "• organizations (org): political, business, non profit;",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "The ESTER Named Entity evaluation program",
                "sec_num": "3"
            },
            {
                "text": "• geo-socio-political groups (gsp): clans, families, nations, administrative regions;",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "The ESTER Named Entity evaluation program",
                "sec_num": "3"
            },
            {
                "text": "• amounts (amount): durations, money, lengths, temperature, age, weight and speed;",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "The ESTER Named Entity evaluation program",
                "sec_num": "3"
            },
            {
                "text": "• time (time): relative and absolute time expressions, hours;",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "The ESTER Named Entity evaluation program",
                "sec_num": "3"
            },
            {
                "text": "• products (prod): art, printings, awards and vehicles;",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "The ESTER Named Entity evaluation program",
                "sec_num": "3"
            },
            {
                "text": "• facilities (fac): buildings, monuments.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "The ESTER Named Entity evaluation program",
                "sec_num": "3"
            },
            {
                "text": "This data is divided in 3 sets: a training set (84%), a development set(8%) and a test set (8%). There is a 6 month gap difference between the training corpus and the test corpus while the development corpus matches the training data from a temporal point of view: the training corpus contains Broadcast News spreading from 2002 to December 2003; the development corpus contains news from 2003; the test corpus has been recorded in October 2004. There are also 2 new radio channels in the test corpus which were not in the training data.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "The ESTER Named Entity evaluation program",
                "sec_num": "3"
            },
            {
                "text": "For these reasons the development data is called the matched corpus as the recording conditions match those of the training corpus and the test data is called the unmatched corpus. As a consequence, we can study the effect of unmatched conditions on ASR as well as IE performance and propose solutions for dealing with this problem.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "The ESTER Named Entity evaluation program",
                "sec_num": "3"
            },
            {
                "text": "One of the main characteristics of the ESTER corpus is the size of the NE tagset and the high ambiguity rate among the NE categories (eg. administrative regions and geographical locations): 83% of the matched corpus entities occur in the training corpus and 40% of them are ambiguous whereas only 61% of the unmatched corpus entities occur in the training corpus and 32% of them are ambiguous.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "The ESTER Named Entity evaluation program",
                "sec_num": "3"
            },
            {
                "text": "The most commonly used measures for evaluating NE extraction performance are Slot Error Rate (SER) and F-measure. SER is very similar to WER because it takes into account fine grained errors like insertions, deletions and substitutions (entity type and extent). The scoring process is based on the same alignment between reference and hypothesis data than the one obtained for measuring WER and SER is known for being more accurate and penalizing than F-measure. Both measures weights can be adjusted to favor recall or precision and therefore adapted to a specific task.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "The ESTER Named Entity evaluation program",
                "sec_num": "3"
            },
            {
                "text": "SER = 100 * e∈E αe|e| |Ref slots| F β = (1+β 2 )RP R+β 2 P R = |Correct slots| |Ref slots| P = |Correct slots| |Hyp slots|",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "The ESTER Named Entity evaluation program",
                "sec_num": "3"
            },
            {
                "text": "with e ∈ E being an error type (insertion, deletion, type, extent, type+extent, multiple) and α e its weight (resp. 1, 1, .5, .5, .8, 1.5) ; P is the precision and R the recall; F 1 is used in this paper.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "The ESTER Named Entity evaluation program",
                "sec_num": "3"
            },
            {
                "text": "As previously mentioned in section 2, WER and SER performance are strongly correlated. Besides the intrinsic difficulties of ASR (robustness to noise, speaker variation, lack of coverage of the Language Models used, . . . ), there is a source of errors which is particularly important in IE from speech input: the Out-Of-Vocabulary (OOV) word phenomenon. Indeed, ASR models are built on huge textual corpus and only contain the most frequent words to limit computation and memory usage. If this is the right approach to WER reduction, it is certainly not valuable to information extraction where unlikely events are considered as important. For instance, many document retrieval models use inverse document frequency (rareness) as a word weighting parameter. So, unlikely proper names are not in reach of the ASR transcription system and hence cannot be spotted by a Named Entity extraction module.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Extracting NE from written text vs. ASR output",
                "sec_num": "4"
            },
            {
                "text": "In addition to Out-of-Vocabulary words, two other phenomenons have also a strong impact on NER performance: the insertion of erroneous proper names that automatically trigger the insertion of an entity and spontaneous speech phenomenons. These speech dysfluencies (hesitations, filled pauses, false starts...) reduce the quality of the transcript because they are usually not covered by language models (built from textual data) or artificially introduced. One should remove these from the transcript to improve the quality of the labeling.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Extracting NE from written text vs. ASR output",
                "sec_num": "4"
            },
            {
                "text": "In order to deal with ASR errors two approaches have been proposed:",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Extracting NE from written text vs. ASR output",
                "sec_num": "4"
            },
            {
                "text": "• modeling explicitly the ASR errors, thanks to a development corpus and a set of confidence measures, in order to detect the possible errors of the 1-best word string hypothesis (with the type of errors) before extracting the NEs (Palmer and Ostendorf, 2001) ;",
                "cite_spans": [
                    {
                        "start": 231,
                        "end": 259,
                        "text": "(Palmer and Ostendorf, 2001)",
                        "ref_id": "BIBREF11"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Extracting NE from written text vs. ASR output",
                "sec_num": "4"
            },
            {
                "text": "• exploiting a search space bigger than the 1-best hypothesis alone, either by taking into account an n-best list (Zhai et al., 2004) or the whole word lattice (Saraclar and Sproat, 2004) .",
                "cite_spans": [
                    {
                        "start": 114,
                        "end": 133,
                        "text": "(Zhai et al., 2004)",
                        "ref_id": "BIBREF16"
                    },
                    {
                        "start": 160,
                        "end": 187,
                        "text": "(Saraclar and Sproat, 2004)",
                        "ref_id": "BIBREF14"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Extracting NE from written text vs. ASR output",
                "sec_num": "4"
            },
            {
                "text": "The method proposed in this paper is close to this second approach where the whole word lattice output by the ASR system is used in order to increase NER performance from noisy input.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Extracting NE from written text vs. ASR output",
                "sec_num": "4"
            },
            {
                "text": "We will present also in the next section a new strategy for adapting NER models to ASR transcripts, based on one of the main characteristics of such transcripts: a closed vocabulary is used by the ASR system. To our knowledge this has never been fully exploited by NER systems. Indeed while the key point of NER systems on written text is their generalization capabilities when processing unknown words, this feature is not relevant for ASR transcripts as the system cannot generate words out of the lexicon (there are no unknown words). Therefore we propose here to fully exploit this constraint (close vocabulary): since the OOV words cannot appear in the ASR transcripts, the NER models can by over-trained on the words belonging to the ASR lexicon. This is going to be developed in the next section.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Extracting NE from written text vs. ASR output",
                "sec_num": "4"
            },
            {
                "text": "We have developed in this study two NER systems: one is based on the freely available NLP tool Lingpipe 1 , adapted and trained on the French ESTER corpus and dedicated to process text input. This system is going to be called NER text in the experiment section. The second NER system has been developed for this study and is specifically built for being tightly integrated with the ASR processes. The two main features of this system, called NER asr in the following, are its ability to process word lattices and the fact that the NER models are trained for a specific ASR lexicon. These two systems are going to be presented in the next sections.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Robust Named Entity extraction",
                "sec_num": "5"
            },
            {
                "text": "Among all the different methods that have been proposed for NER, one can find rule based models (Cunningham et al., 2002) , Maximum Entropy models (Brothwick et al., 1998) , Conditionnal Random Fields or probabilistic HMM-based models (Bikel et al., 1999) .",
                "cite_spans": [
                    {
                        "start": 96,
                        "end": 121,
                        "text": "(Cunningham et al., 2002)",
                        "ref_id": "BIBREF6"
                    },
                    {
                        "start": 147,
                        "end": 171,
                        "text": "(Brothwick et al., 1998)",
                        "ref_id": "BIBREF4"
                    },
                    {
                        "start": 235,
                        "end": 255,
                        "text": "(Bikel et al., 1999)",
                        "ref_id": "BIBREF3"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Text-based NER system: NER text",
                "sec_num": "5.1"
            },
            {
                "text": "Lingpipe implements an HMM-based model. It maximizes the probability of a tag sequence T i over 1 Lingpipe: http://alias-i.com/lingpipe/ a word sequence W i . A context of two preceding words and one preceding tag is used to approximate this probability. Generalization is done through a simple process: words occurring with low frequency are replaced by feature based categories (capitalized, contains digits, . . . ). In this approach, there must be one tag per word. Words starting and ending entities are labeled with special tags. Because some features are lacking in ASR transcripts (e.g. capitalization, digits, sentence boundaries, . . . ) some word lists for each kind of features are added as presented in (Appelt and Martin, 1999).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Text-based NER system: NER text",
                "sec_num": "5.1"
            },
            {
                "text": "Errors occurring in ASR output lead NER systems to overgenerate NE detections. This is due to both erroneous words insertions in the ASR transcripts as well as some abusive generalization made by the NER systems. If these generalization capabilities are very important for processing unknown words in written texts, they can be an handicap in a closedvocabulary situation like the one observed when processing ASR output. In order to reduce and control the insertion rate of our NER system, we implemented a two level approach: the first level is made of NE grammars coded as Finite State Machine (FSM) transducers and the second level is a statistical HMM-based tagger.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "ASR-based NER system: NER asr",
                "sec_num": "5.2"
            },
            {
                "text": "To each NE category is attached a set of regular grammars, extracted from the ESTER training corpus and generalized thanks to the annotation guidelines and web-gathered word lists. Theses grammars are represented by Finite State Machines (FSMs) (thanks to the AT&T GRM/FSM toolkit (Allauzen et al., 2003) ). These FSMs are transducers that accept word sequences on the input symbols and output NE labels on the output symbols. They are all grouped together in a single transducer, called T gram , with a filler model that accepts any string of words. Because these FSMs are lexicalized with the words of the ASR lexicon, one can control the generalization capabilities of the grammars thanks to the occurrence contexts of these words in the training corpus. During the NER process, the first step is to compose the FSM representing the NE transducer and the output of the ASR module (either a 1-best word string or a word lattice, both encoded as an FSM called G).",
                "cite_spans": [
                    {
                        "start": 281,
                        "end": 304,
                        "text": "(Allauzen et al., 2003)",
                        "ref_id": "BIBREF0"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "NE transducers",
                "sec_num": "5.2.1"
            },
            {
                "text": "The result of the composition of the NE transducer with the ASR output is an FSM (G • T gram ) containing all the possible parsing made by the NE grammars. In order to find the best analysis a statistical model is used to decide between entity types and entities boundaries. This model is a 2nd order n-gram model (trigram) represented by a weighted FSM (called T tagger ) with the same framework as the grammars. The most likely NE label sequence is obtained by finding the best path in the FSM: G • T gram • T tagger . This corresponds to maximize the following probability:",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "NE tagger",
                "sec_num": "5.2.2"
            },
            {
                "text": "P W = n i=1 P (W i , T i |W i-1 , T i-1 , W i-2 , T i-2 )",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "NE tagger",
                "sec_num": "5.2.2"
            },
            {
                "text": "This model is similar to the one implemented in Lingpipe but it uses different smoothing methods. Similarly, first and last words of entities are represented by special tags (this helps getting more accurate boundaries) and low frequency words (appearing less than a fixed number of times in the training corpus) are generalized using their Part-Of-Speech tags. The key points of this approach are that it has a better control of the generalization capabilities than a feature based NER system, thanks to the NE grammars; it integrates the closed vocabulary constraint of the ASR systems; and it is not limited to the 1best word hypothesis but can use the full ASR search space (through word lattices) in order to detect entities. Processing word lattices allows us to output, at the end of the extraction process, an n-best list of NE hypotheses. To each hypothesis are attached two scores:",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "NE tagger",
                "sec_num": "5.2.2"
            },
            {
                "text": "• the likelihood score given by the ASR model to the best word string supporting this NE hypothesis in the word lattice;",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "NE tagger",
                "sec_num": "5.2.2"
            },
            {
                "text": "• the probability P (W n , T n , . . . , W 0 , T 0 ) given by the NE tagger to the sequence of NE labels T 0 , . . . , T n and the sequence of words W 0 , . . . , W n .",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "NE tagger",
                "sec_num": "5.2.2"
            },
            {
                "text": "From this n-best list we can estimate the Oracle performance of the NER system. This measure is the recall measure upper bound than can be obtained by extracting all the possible entities from a word lattice, thanks to the NE transducers, and simulating a perfect strategy that always take the right decision in choosing among all the possible entities.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "NE tagger",
                "sec_num": "5.2.2"
            },
            {
                "text": "Decision strategies on such an n-best of NE hypothesis can also involve other levels of information on the document to process like the date or the theme, for example. In the evaluation presented in the next section we compare this Oracle performance measure to the results of the simplest decision strategy which consists in choosing the NE hypothesis with the highest likelihood.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "NE tagger",
                "sec_num": "5.2.2"
            },
            {
                "text": "The evaluation presented in Tables 1 and 2 Figure 2 shows the results obtained on the ASR transcripts.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 35,
                        "end": 36,
                        "text": "1",
                        "ref_id": null
                    },
                    {
                        "start": 41,
                        "end": 42,
                        "text": "2",
                        "ref_id": null
                    },
                    {
                        "start": 50,
                        "end": 51,
                        "text": "2",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "Evaluation",
                "sec_num": "5.3"
            },
            {
                "text": "As expected on manually transcribed data, NER text obtains better results than NER asr (which has poorer generalization capabilities). On the ASR outputs the results obtained by both systems are comparable however NER asr has the advantage of processing word lattices, leading to an interesting Oracle performance. We are studying now more elaborate decision strategies in order to take fully advantage of this feature.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Evaluation",
                "sec_num": "5.3"
            },
            {
                "text": "The decrease in F-measure observed between the reference and the ASR transcripts is similar to the one obtained in other studies (Miller et al., 2000) . One observation that can be made on these results is the impact of the time mismatch between the training and the test corpora. A 6 month difference in the unmatched corpus leads to a very big drop in both SER and F-measure. This can be explained by the fact that NEs are very time-dependent. We are going now to present some methods developed to tackle this problem.",
                "cite_spans": [
                    {
                        "start": 129,
                        "end": 150,
                        "text": "(Miller et al., 2000)",
                        "ref_id": "BIBREF10"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Evaluation",
                "sec_num": "5.3"
            },
            {
                "text": "The only mismatch between the training and the unmatched corpus of our experiments is a 6 months temporal mismatch, therefore we collected a corpus of newsletters made on a daily basis by the French newspaper Le Monde corresponding to these 6 months. These newsletters contain an abstract of the news of each day. We make the following two hypotheses:",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Updating Language and NE models with metadata information",
                "sec_num": "6"
            },
            {
                "text": "• firstly these newsletters are related to the same time period as the unmatched corpus, therefore integrating them into the ASR models (lex-icon+Language Model) should help reducing the OOV word effect;",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Updating Language and NE models with metadata information",
                "sec_num": "6"
            },
            {
                "text": "• secondly because they represent an abstract of the news of each day, the Named Entities occurring in a particular newsletter should contain all the major events of the corresponding day and therefore constitutes a useful list of terms that can be used for indexing a Broadcast News document related to the same period of time.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Updating Language and NE models with metadata information",
                "sec_num": "6"
            },
            {
                "text": "This newsletter corpus contains 1M words and after being tagged by the NER text system, 140k entities were extracted. To check the relevance of this corpus for adapting the models to the unmatched test corpus, we studied the distribution of the words and the entities for each day, from January to December 2004. The unmatched test corpus is made of Broadcast News ranging from October 10th to October 16th 2004. The following observations were made: 72% of the NEs and 60% of the words contained in them occur only one day in this corpus; the intersection of the NEs occurring in both the newsletter of a particular day and the entities belonging to the unmatched test corpus shows a peak, illustrated by figure 3 , for the days of the test corpus; at this peak, 25% of the NEs are used the same day in the two corpora. The first observation matches those presented in (Whittaker, 2001) and validates our approach which consists in carefully adapting the ASR and NER models with data corresponding to the exact period of time as the one of the documents to process: by taking into account a larger period of time for the adaptation corpus, the necessity of restraining the models to the most frequent entities would lead to discard low frequency terms that can be crucial for characterizing the news of a given day.",
                "cite_spans": [
                    {
                        "start": 870,
                        "end": 887,
                        "text": "(Whittaker, 2001)",
                        "ref_id": "BIBREF15"
                    }
                ],
                "ref_spans": [
                    {
                        "start": 713,
                        "end": 714,
                        "text": "3",
                        "ref_id": "FIGREF2"
                    }
                ],
                "eq_spans": [],
                "section": "NE distribution analysis",
                "sec_num": "6.1"
            },
            {
                "text": "If the second observation clearly highlights the correlation between the NE distribution in both corpora, it also points out that only 25% of the entities of the unmatched corpus occur in the newsletters corresponding to the same days. Therefore the potential improvement in the overall NER performance is clearly limited. This will be confirmed in the next section, however one can think that if these entities are shared, for a given day, by both corpora, it is because they represent the key topics of this day and therefore they can be considered as very relevant indexing terms for applications like document retrieval. This last point is developed in section 7.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "NE distribution analysis",
                "sec_num": "6.1"
            },
            {
                "text": "Several studies (Whittaker, 2001; Federico and Bertoldi, 2001; Chen et al., 2004) propose adaptation methods of a general language model to the possibly small corpora extracted from these kinds of metadata information (an overview of these methods can be found in (Bellegarda, 2004) ). Depending on the adaptation method and the kind of metadata information used, some gains in performance have been reported. But it appears that the choice of the metadata and the size of the adaptation corpus collected are critical in this adaptation process: if the adaptation corpus is not exactly related to the topics of the document to process, no real gains are obtained (e.g. (Chen et al., 2004) reports that the best gains were obtained with a story-based adaptation method).",
                "cite_spans": [
                    {
                        "start": 16,
                        "end": 33,
                        "text": "(Whittaker, 2001;",
                        "ref_id": "BIBREF15"
                    },
                    {
                        "start": 34,
                        "end": 62,
                        "text": "Federico and Bertoldi, 2001;",
                        "ref_id": "BIBREF7"
                    },
                    {
                        "start": 63,
                        "end": 81,
                        "text": "Chen et al., 2004)",
                        "ref_id": "BIBREF5"
                    },
                    {
                        "start": 264,
                        "end": 282,
                        "text": "(Bellegarda, 2004)",
                        "ref_id": "BIBREF2"
                    },
                    {
                        "start": 669,
                        "end": 688,
                        "text": "(Chen et al., 2004)",
                        "ref_id": "BIBREF5"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Model adaptation",
                "sec_num": "6.2"
            },
            {
                "text": "From all these previous works, our system implements the following adaptation process:",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Model adaptation",
                "sec_num": "6.2"
            },
            {
                "text": "• the text corpus corresponding to the newsletters is added to the ASR language model by means of a linear interpolation;",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Model adaptation",
                "sec_num": "6.2"
            },
            {
                "text": "• proper names occuring twice or more in the newsletter corpus are added to the ASR lexicon;",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Model adaptation",
                "sec_num": "6.2"
            },
            {
                "text": "• for the same days as those of the unmatched corpus, this cutoff is suppressed and all the proper names are added;",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Model adaptation",
                "sec_num": "6.2"
            },
            {
                "text": "• the Named Entity wordlists and grammars are also enriched with these proper names and entities extracted from the collected corpus.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Model adaptation",
                "sec_num": "6.2"
            },
            {
                "text": "1K new proper names were added to the 65K word ASR lexicon. The general OOV reduction obtained was 0.14% leading to an absolute WER reduction of 0.3%. Similarly the SER decreased of about 0.3% thanks to this adaptation and the Oracle recall measure in the word lattices was improved by an absolute 3%. These improvements are not significant enough to justify the use of this kind of metadata information for improving the general performance of both ASR and NER processes. However, if we focus now on the entities occurring in the newsletters corresponding to the exact days of the unmatched corpus, the improvement is much more significant, as presented in the next section.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Model adaptation",
                "sec_num": "6.2"
            },
            {
                "text": "As previously mentioned, 25% of the unmatched corpus entities occur in the newsletters corresponding to the same day as those of the unmatched test. In order to measure the improvement obtained with our adaptation technique on these particular entities, we did the following experiment:",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Named Entity Indexation",
                "sec_num": "7"
            },
            {
                "text": "• a set of 352 entities was selected from the newsletters related to same period of time as the test, these entities represent the indexing terms that are going to be looked for in the word lattices of the unmatched corpus;",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Named Entity Indexation",
                "sec_num": "7"
            },
            {
                "text": "• the NER asr system was then applied to these word lattices with two conditions: the word lattices and the NER models before adaptation and those obtained after adaptation with the newsletter corpus;",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Named Entity Indexation",
                "sec_num": "7"
            },
            {
                "text": "• precision, recall, F-measure and Oracle error rate were estimated for both conditions.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Named Entity Indexation",
                "sec_num": "7"
            },
            {
                "text": "Condition Prec. Recall F-m Oracle no adaptation 87.0 75.7 80.9 83.6 with adaptation 87.5 83.9 85.7 92",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Named Entity Indexation",
                "sec_num": "7"
            },
            {
                "text": "Figure 4 : Extraction results on the selected NEs on the unmatched corpus with and without adaptation of the ASR and NER models on the newsletter corpus",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 7,
                        "end": 8,
                        "text": "4",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "Named Entity Indexation",
                "sec_num": "7"
            },
            {
                "text": "As we can see in table 4, the adaptation process increases very significantly the recall measure of the NE extraction. This is particularly relevant in some IE tasks like the document retrieval task.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Named Entity Indexation",
                "sec_num": "7"
            },
            {
                "text": "We have presented in this paper a robust Named Entity Recognition system dedicated to process ASR transcripts. The FSM-based approach allows us to control the generalization capabilities of the system while the statistical tagger provides good labeling decisions. The main feature of this system is its ability to extract n-best lists of NE hypothesis from word lattices leaving the decision strategy choosing to either emphasize the recall or the precision of the extraction, according to the task targeted. A comparison between this approach and a standard approach based on the NLP tools Lingpipe validates our hypotheses. This integration of the ASR and the NER processes is particularly important in difficult conditions like those that can be found in large spoken archives where the training corpus does not match all the documents to process. A study of the use of metadata information in order to adapt the ASR and NER models to a specific situation showed that if the overall improvement is small, some salient information related to the metadata added can be better extracted by means of this adaptation.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Conclusion",
                "sec_num": "8"
            }
        ],
        "back_matter": [],
        "bib_entries": {
            "BIBREF0": {
                "ref_id": "b0",
                "title": "Generalized algorithms for constructing statistical language models",
                "authors": [
                    {
                        "first": "Cyril",
                        "middle": [],
                        "last": "Allauzen",
                        "suffix": ""
                    },
                    {
                        "first": "Mehryar",
                        "middle": [],
                        "last": "Mohri",
                        "suffix": ""
                    },
                    {
                        "first": "Brian",
                        "middle": [],
                        "last": "Roark",
                        "suffix": ""
                    }
                ],
                "year": 2003,
                "venue": "ACL'03",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Cyril Allauzen, Mehryar Mohri, and Brian Roark. 2003. Generalized algorithms for constructing statistical lan- guage models. In ACL'03, Sapporo, Japan.",
                "links": null
            },
            "BIBREF1": {
                "ref_id": "b1",
                "title": "Named entity extraction from speech: Approach and results using the TextPro system",
                "authors": [
                    {
                        "first": "D",
                        "middle": [],
                        "last": "Appelt",
                        "suffix": ""
                    },
                    {
                        "first": "D",
                        "middle": [],
                        "last": "Martin",
                        "suffix": ""
                    }
                ],
                "year": 1999,
                "venue": "Proceedings Darpa Broadcast News Workshop",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "D. Appelt and D. Martin. 1999. Named entity extraction from speech: Approach and results using the TextPro system. In Proceedings Darpa Broadcast News Work- shop.",
                "links": null
            },
            "BIBREF2": {
                "ref_id": "b2",
                "title": "Statistical language model adaptation: review and perspectives",
                "authors": [
                    {
                        "first": "Jerome",
                        "middle": [
                            "R"
                        ],
                        "last": "Bellegarda",
                        "suffix": ""
                    }
                ],
                "year": 2004,
                "venue": "",
                "volume": "42",
                "issue": "",
                "pages": "93--108",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Jerome R. Bellegarda. 2004. Statistical language model adaptation: review and perspectives. Speech Commu- nication, 42 Issue 1:93-108.",
                "links": null
            },
            "BIBREF3": {
                "ref_id": "b3",
                "title": "An algorithm that learns what's in a name",
                "authors": [
                    {
                        "first": "M",
                        "middle": [],
                        "last": "Daniel",
                        "suffix": ""
                    },
                    {
                        "first": "Richard",
                        "middle": [
                            "L"
                        ],
                        "last": "Bikel",
                        "suffix": ""
                    },
                    {
                        "first": "Ralph",
                        "middle": [
                            "M"
                        ],
                        "last": "Schwartz",
                        "suffix": ""
                    },
                    {
                        "first": "",
                        "middle": [],
                        "last": "Weischedel",
                        "suffix": ""
                    }
                ],
                "year": 1999,
                "venue": "",
                "volume": "24",
                "issue": "",
                "pages": "211--231",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Daniel M. Bikel, Richard L. Schwartz, and Ralph M. Weischedel. 1999. An algorithm that learns what's in a name. volume 24, pages 211-231.",
                "links": null
            },
            "BIBREF4": {
                "ref_id": "b4",
                "title": "Exploiting diverse knowledge sources via maximum entropy in named entity recognition",
                "authors": [
                    {
                        "first": "Andrew",
                        "middle": [],
                        "last": "Brothwick",
                        "suffix": ""
                    },
                    {
                        "first": "John",
                        "middle": [],
                        "last": "Sterling",
                        "suffix": ""
                    },
                    {
                        "first": "Eugene",
                        "middle": [],
                        "last": "Agichtein",
                        "suffix": ""
                    },
                    {
                        "first": "Ralph",
                        "middle": [],
                        "last": "Grishman",
                        "suffix": ""
                    }
                ],
                "year": 1998,
                "venue": "",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Andrew Brothwick, John Sterling, Eugene Agichtein, and Ralph Grishman. 1998. Exploiting diverse knowl- edge sources via maximum entropy in named entity recognition.",
                "links": null
            },
            "BIBREF5": {
                "ref_id": "b5",
                "title": "Dynamic language modeling for broadcast news",
                "authors": [
                    {
                        "first": "Langzhou",
                        "middle": [],
                        "last": "Chen",
                        "suffix": ""
                    },
                    {
                        "first": "Jean-Luc",
                        "middle": [],
                        "last": "Gauvain",
                        "suffix": ""
                    },
                    {
                        "first": "Lori",
                        "middle": [],
                        "last": "Lamel",
                        "suffix": ""
                    },
                    {
                        "first": "Gilles",
                        "middle": [],
                        "last": "Adda",
                        "suffix": ""
                    }
                ],
                "year": 2004,
                "venue": "International Conference on Speech and Language Processing",
                "volume": "",
                "issue": "",
                "pages": "1281--1284",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Langzhou Chen, Jean-Luc Gauvain, Lori Lamel, and Gilles Adda. 2004. Dynamic language modeling for broadcast news. In In International Conference on Speech and Language Processing, pages 1281-1284.",
                "links": null
            },
            "BIBREF6": {
                "ref_id": "b6",
                "title": "GATE: A framework and graphical development environment for robust NLP tools and applications",
                "authors": [
                    {
                        "first": "H",
                        "middle": [],
                        "last": "Cunningham",
                        "suffix": ""
                    },
                    {
                        "first": "D",
                        "middle": [],
                        "last": "Maynard",
                        "suffix": ""
                    },
                    {
                        "first": "K",
                        "middle": [],
                        "last": "Bontcheva",
                        "suffix": ""
                    },
                    {
                        "first": "V",
                        "middle": [],
                        "last": "Tablan",
                        "suffix": ""
                    }
                ],
                "year": 2002,
                "venue": "Proceedings of the 40th Anniversary Meeting of the Association for Computational Linguistics",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "H. Cunningham, D. Maynard, K. Bontcheva, and V. Tablan. 2002. GATE: A framework and graphi- cal development environment for robust NLP tools and applications. In Proceedings of the 40th Anniversary Meeting of the Association for Computational Linguis- tics.",
                "links": null
            },
            "BIBREF7": {
                "ref_id": "b7",
                "title": "Broadcast news LM adaptation using contemporary texts",
                "authors": [
                    {
                        "first": "M",
                        "middle": [],
                        "last": "Federico",
                        "suffix": ""
                    },
                    {
                        "first": "N",
                        "middle": [],
                        "last": "Bertoldi",
                        "suffix": ""
                    }
                ],
                "year": 2001,
                "venue": "Proceedings of European Conference on Speech Communication and Technology (Eurospeech)",
                "volume": "",
                "issue": "",
                "pages": "239--242",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "M. Federico and N. Bertoldi. 2001. Broadcast news LM adaptation using contemporary texts. In Proceedings of European Conference on Speech Communication and Technology (Eurospeech), pages 239-242, Aal- borg, Denmark.",
                "links": null
            },
            "BIBREF8": {
                "ref_id": "b8",
                "title": "Topic detection and tracking evaluation overview. Topic detection and tracking: event-based information organization",
                "authors": [
                    {
                        "first": "Jonathan",
                        "middle": [
                            "G"
                        ],
                        "last": "Fiscus",
                        "suffix": ""
                    },
                    {
                        "first": "George",
                        "middle": [
                            "R"
                        ],
                        "last": "Doddington",
                        "suffix": ""
                    }
                ],
                "year": 2002,
                "venue": "",
                "volume": "",
                "issue": "",
                "pages": "17--31",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Jonathan G. Fiscus and George R. Doddington. 2002. Topic detection and tracking evaluation overview. Topic detection and tracking: event-based information organization, pages 17-31.",
                "links": null
            },
            "BIBREF9": {
                "ref_id": "b9",
                "title": "ESTER, une campagne d'évaluation des systèmes d'indexation automatique d'émissions radiophoniques en franc ¸ais",
                "authors": [
                    {
                        "first": "G",
                        "middle": [],
                        "last": "Gravier",
                        "suffix": ""
                    },
                    {
                        "first": "J",
                        "middle": [
                            "F"
                        ],
                        "last": "Bonastre",
                        "suffix": ""
                    },
                    {
                        "first": "E",
                        "middle": [],
                        "last": "Geoffrois",
                        "suffix": ""
                    },
                    {
                        "first": "S",
                        "middle": [],
                        "last": "Galliano",
                        "suffix": ""
                    },
                    {
                        "first": "K",
                        "middle": [],
                        "last": "Mctait",
                        "suffix": ""
                    },
                    {
                        "first": "K",
                        "middle": [],
                        "last": "Choukri",
                        "suffix": ""
                    }
                ],
                "year": 2004,
                "venue": "Proc. Journées d'Etude sur la Parole (JEP)",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "G. Gravier, J.F. Bonastre, E. Geoffrois, S. Galliano, K. McTait, and K. Choukri. 2004. ESTER, une cam- pagne d'évaluation des systèmes d'indexation automa- tique d'émissions radiophoniques en franc ¸ais. In Proc. Journées d'Etude sur la Parole (JEP).",
                "links": null
            },
            "BIBREF10": {
                "ref_id": "b10",
                "title": "Named entity extraction from noisy input: Speech and OCR",
                "authors": [
                    {
                        "first": "David",
                        "middle": [],
                        "last": "Miller",
                        "suffix": ""
                    },
                    {
                        "first": "Sean",
                        "middle": [],
                        "last": "Boisen",
                        "suffix": ""
                    },
                    {
                        "first": "Richard",
                        "middle": [],
                        "last": "Schwartz",
                        "suffix": ""
                    },
                    {
                        "first": "Rebecca",
                        "middle": [],
                        "last": "Stone",
                        "suffix": ""
                    },
                    {
                        "first": "Ralph",
                        "middle": [],
                        "last": "Weischedel",
                        "suffix": ""
                    }
                ],
                "year": 2000,
                "venue": "Proceedings of ANLP-NAACL 2000",
                "volume": "",
                "issue": "",
                "pages": "316--324",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "David Miller, Sean Boisen, Richard Schwartz, Rebecca Stone, and Ralph Weischedel. 2000. Named entity extraction from noisy input: Speech and OCR. In Pro- ceedings of ANLP-NAACL 2000, pages 316-324.",
                "links": null
            },
            "BIBREF11": {
                "ref_id": "b11",
                "title": "Improving information extraction by modeling errors in speech recognizer output",
                "authors": [
                    {
                        "first": "D",
                        "middle": [
                            "D"
                        ],
                        "last": "Palmer",
                        "suffix": ""
                    },
                    {
                        "first": "M",
                        "middle": [],
                        "last": "Ostendorf",
                        "suffix": ""
                    }
                ],
                "year": 2001,
                "venue": "Proceedings of the First International Conference on Human Language Technology Research",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "D. D. Palmer and M. Ostendorf. 2001. Improving in- formation extraction by modeling errors in speech rec- ognizer output. In Proceedings of the First Interna- tional Conference on Human Language Technology Research.",
                "links": null
            },
            "BIBREF12": {
                "ref_id": "b12",
                "title": "Hub-4 Information Extraction Evaluation",
                "authors": [
                    {
                        "first": "M",
                        "middle": [
                            "A"
                        ],
                        "last": "Przybocki",
                        "suffix": ""
                    },
                    {
                        "first": "J",
                        "middle": [
                            "G"
                        ],
                        "last": "Fiscus",
                        "suffix": ""
                    },
                    {
                        "first": "J",
                        "middle": [
                            "S"
                        ],
                        "last": "Garofolo",
                        "suffix": ""
                    },
                    {
                        "first": "D",
                        "middle": [
                            "S"
                        ],
                        "last": "Pallett",
                        "suffix": ""
                    }
                ],
                "year": 1998,
                "venue": "Proceedings Of The DARPA Broadcast News Workshop",
                "volume": "",
                "issue": "",
                "pages": "13--18",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "M. A. Przybocki, J. G. Fiscus, J. S. Garofolo, and D. S. Pallett. 1999. 1998 Hub-4 Information Extraction Evaluation. In Proceedings Of The DARPA Broad- cast News Workshop, pages 13-18. Morgan Kaufmann Publishers.",
                "links": null
            },
            "BIBREF13": {
                "ref_id": "b13",
                "title": "Towards automatic transcription of large spoken archives -english ASR for the MALACH project",
                "authors": [
                    {
                        "first": "Jing",
                        "middle": [],
                        "last": "Bhuvana Ramabhadran",
                        "suffix": ""
                    },
                    {
                        "first": "Michael",
                        "middle": [],
                        "last": "Huang",
                        "suffix": ""
                    },
                    {
                        "first": "",
                        "middle": [],
                        "last": "Picheny",
                        "suffix": ""
                    }
                ],
                "year": 2003,
                "venue": "Proc. IEEE International Conference on Acoustics, Speech and Signal Processing",
                "volume": "",
                "issue": "",
                "pages": "216--219",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Bhuvana Ramabhadran, Jing Huang, and Michael Picheny. 2003. Towards automatic transcription of large spoken archives -english ASR for the MALACH project. In Proc. IEEE International Conference on Acoustics, Speech and Signal Processing, ICASSP, pages 216-219.",
                "links": null
            },
            "BIBREF14": {
                "ref_id": "b14",
                "title": "Lattice-based search for spoken utterance retrieval",
                "authors": [
                    {
                        "first": "Murat",
                        "middle": [],
                        "last": "Saraclar",
                        "suffix": ""
                    },
                    {
                        "first": "Richard",
                        "middle": [],
                        "last": "Sproat",
                        "suffix": ""
                    }
                ],
                "year": 2004,
                "venue": "HLT-NAACL 2004: Main Proceedings",
                "volume": "",
                "issue": "",
                "pages": "129--136",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Murat Saraclar and Richard Sproat. 2004. Lattice-based search for spoken utterance retrieval. In HLT-NAACL 2004: Main Proceedings, pages 129-136, Boston, Massachusetts, USA. Association for Computational Linguistics.",
                "links": null
            },
            "BIBREF15": {
                "ref_id": "b15",
                "title": "Temporal adaptation of language models",
                "authors": [
                    {
                        "first": "E",
                        "middle": [
                            "W D"
                        ],
                        "last": "Whittaker",
                        "suffix": ""
                    }
                ],
                "year": 2001,
                "venue": "Adaptation Methods for Speech Recognition, ISCA Tutorial and Research Workshop (ITRW), August. LM Adaptation for information retrieval of spoken news/radio programs",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "E. W. D. Whittaker. 2001. Temporal adaptation of lan- guage models. In Adaptation Methods for Speech Recognition, ISCA Tutorial and Research Workshop (ITRW), August. LM Adaptation for information re- trieval of spoken news/radio programs (i.e. Speech- Bot).",
                "links": null
            },
            "BIBREF16": {
                "ref_id": "b16",
                "title": "Using n-best lists for named entity recognition from chinese speech",
                "authors": [
                    {
                        "first": "Lufeng",
                        "middle": [],
                        "last": "Zhai",
                        "suffix": ""
                    },
                    {
                        "first": "Pascale",
                        "middle": [],
                        "last": "Fung",
                        "suffix": ""
                    },
                    {
                        "first": "Richard",
                        "middle": [],
                        "last": "Schwartz",
                        "suffix": ""
                    },
                    {
                        "first": "Marine",
                        "middle": [],
                        "last": "Carpuat",
                        "suffix": ""
                    },
                    {
                        "first": "Dekai",
                        "middle": [],
                        "last": "Wu",
                        "suffix": ""
                    }
                ],
                "year": 2004,
                "venue": "HLT-NAACL 2004: Short Papers",
                "volume": "",
                "issue": "",
                "pages": "37--40",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Lufeng Zhai, Pascale Fung, Richard Schwartz, Marine Carpuat, and Dekai Wu. 2004. Using n-best lists for named entity recognition from chinese speech. In HLT-NAACL 2004: Short Papers, pages 37-40, Boston, Massachusetts, USA. Association for Compu- tational Linguistics.",
                "links": null
            }
        },
        "ref_entries": {
            "FIGREF0": {
                "num": null,
                "text": "Figure1presents SER and F-measure on the two test sets (matched and unmatched) for the text oriented (NER text ) and the speech oriented (NER asr ) NER systems, on clean text (manual transcripts). Figure2shows the results obtained on the ASR transcripts.As expected on manually transcribed data, NER text obtains better results than NER asr (which",
                "uris": null,
                "fig_num": "1",
                "type_str": "figure"
            },
            "FIGREF2": {
                "num": null,
                "text": "Figure 3: Percentage of entities of the unmatched corpus occuring at least n days earlier or later in the newsletter corpus (at a window of 0 days, entities appear on the same day in both corpus).",
                "uris": null,
                "fig_num": "3",
                "type_str": "figure"
            },
            "TABREF1": {
                "content": "<table><tr><td colspan=\"2\">corpus</td><td colspan=\"2\">matched</td><td colspan=\"2\">unmatched</td></tr><tr><td colspan=\"2\">tagger</td><td colspan=\"4\">SER F-m SER F-m</td></tr><tr><td colspan=\"2\">NER text</td><td>21</td><td>84</td><td>27</td><td>79</td></tr><tr><td colspan=\"2\">NER asr</td><td>23</td><td>84</td><td>37</td><td>74</td></tr><tr><td colspan=\"2\">WER</td><td>0</td><td/><td>0</td><td/></tr><tr><td colspan=\"6\">Figure 1: F-measure and Slot Error Rate measures</td></tr><tr><td colspan=\"6\">on the ESTER reference corpora (matched and un-</td></tr><tr><td colspan=\"4\">matched) for both NER systems</td><td/><td/></tr><tr><td>corpus</td><td colspan=\"2\">matched</td><td/><td colspan=\"2\">unmatched</td></tr><tr><td>tagger</td><td colspan=\"5\">SER F-m SER F-m Oracle</td></tr><tr><td>NER text</td><td>42</td><td>72</td><td>55</td><td>63</td><td>61.9</td></tr><tr><td>NER asr</td><td>41</td><td>73</td><td>54</td><td>63</td><td>76.9</td></tr><tr><td>WER</td><td/><td>21.2</td><td/><td>26.4</td><td/></tr><tr><td colspan=\"6\">Figure 2: F-measure, Slot Error Rate and Oracle re-</td></tr><tr><td colspan=\"6\">call measures on the ASR output of the matched and</td></tr><tr><td colspan=\"6\">unmatched corpora for both NER systems</td></tr></table>",
                "type_str": "table",
                "text": "is performed using the Slot Error Rate and the F-measure on the matched and unmatched corpora presented in section 3.",
                "html": null,
                "num": null
            }
        }
    }
}