{
    "paper_id": "N07-1072",
    "header": {
        "generated_with": "S2ORC 1.0.0",
        "date_generated": "2023-06-16T12:12:37.386935Z"
    },
    "title": "Computing Semantic Similarity between Skill Statements for Approximate Matching",
    "authors": [
        {
            "first": "Feng",
            "middle": [],
            "last": "Pan",
            "suffix": "",
            "affiliation": {
                "laboratory": "",
                "institution": "USC Information Sciences Institute IBM T. J. Watson Research Center Marina del Rey",
                "location": {
                    "postCode": "90292, 10532",
                    "settlement": "Hawthorne",
                    "region": "CA, NY"
                }
            },
            "email": "pan@isi.edu"
        },
        {
            "first": "Robert",
            "middle": [
                "G"
            ],
            "last": "Farrell",
            "suffix": "",
            "affiliation": {
                "laboratory": "",
                "institution": "USC Information Sciences Institute IBM T. J. Watson Research Center Marina del Rey",
                "location": {
                    "postCode": "90292, 10532",
                    "settlement": "Hawthorne",
                    "region": "CA, NY"
                }
            },
            "email": ""
        }
    ],
    "year": "",
    "venue": null,
    "identifiers": {},
    "abstract": "This paper explores the problem of computing text similarity between verb phrases describing skilled human behavior for the purpose of finding approximate matches. Four parsers are evaluated on a large corpus of skill statements extracted from an enterprise-wide expertise taxonomy. A similarity measure utilizing common semantic role features extracted from parse trees was found superior to an information-theoretic measure of similarity and comparable to the level of human agreement.",
    "pdf_parse": {
        "paper_id": "N07-1072",
        "_pdf_hash": "",
        "abstract": [
            {
                "text": "This paper explores the problem of computing text similarity between verb phrases describing skilled human behavior for the purpose of finding approximate matches. Four parsers are evaluated on a large corpus of skill statements extracted from an enterprise-wide expertise taxonomy. A similarity measure utilizing common semantic role features extracted from parse trees was found superior to an information-theoretic measure of similarity and comparable to the level of human agreement.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Abstract",
                "sec_num": null
            }
        ],
        "body_text": [
            {
                "text": "Knowledge-intensive industries need to become more efficient at deploying the right expertise as quickly and smoothly as possible, thus it is desired to have systems that can quickly match and deploy skilled individuals to meet customer needs. The searches in most of the current matching systems are based on exact matches between skill statements. However, exact matching is very likely to miss individuals who are very good matches to the job but didn't select the exact skills that appeared in the open job description.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "It is always hard for individuals to find the perfect skills to describe their skill sets. For example, an individual might not know whether to choose a skill stating that refers to \"maintaining\" a given product or \"supporting\" it or whether to choose a skill about maintaining a \"database\" or about maintaining \"DB2\". Thus, it is desirable for the job search system to be able to find approximate matches, instead of only exact matches, between available individuals and open job positions. More specifically, a skill similarity computation is needed to allow searches to be expanded to related skills, and return more potential matches.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "In this paper, we present our work on developing a skill similarity computation based upon semantic commonalities between skill statements. Although there has been much work on text similarity metrics (Lin, 1998a; Corley and Mihalcea, 2005) , most approaches treat texts as a bag of words and try to find shared words with certain statistical properties based on corpus frequencies. As a result, the structural information in the text is ignored in these approaches. We will describe a new semantic approach that takes the structural information of the text into consideration and matches skill statements on corresponding semantic roles. We will demonstrate that it can outperform standard statistical text similarity techniques, and reach the level of human agreement.",
                "cite_spans": [
                    {
                        "start": 201,
                        "end": 213,
                        "text": "(Lin, 1998a;",
                        "ref_id": null
                    },
                    {
                        "start": 214,
                        "end": 240,
                        "text": "Corley and Mihalcea, 2005)",
                        "ref_id": null
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "In Section 2, we first describe the skill statements we extracted from an enterprise-wide expertise taxonomy. In Section 3, we describe the performance of a standard statistical approach on this task. This motivates our semantic approach of matching skill statements on corresponding semantic roles. We also compare and evaluate the performance of four natural language parsers (the Charniak parser, the Stanford parser, the ESG parser, and MINIPAR) for the purpose of our task. An inter-rater agreement study and evaluation of our approach will be presented in Section 4. We end with a discussion and conclusion.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "An expertise taxonomy is a standardized, enterprise-wide language and structure to describe job role requirements and people capabilities (skill sets) across a corporation. In the taxonomy we utilize for this study, skills are associated with job roles. The taxonomy has 10667 skills. Each skill has a title, for example, \"Advise BAAN eBusiness ASP.\" We refer to this title as the skill statement.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Skill Statements",
                "sec_num": "2"
            },
            {
                "text": "The official taxonomy update policies require that skill statements be verb phrases using one of 18 valid skill verbs (e.g., Advise, Architect, Code, Design, Implement, Sell, and Support) .",
                "cite_spans": [
                    {
                        "start": 144,
                        "end": 187,
                        "text": "Code, Design, Implement, Sell, and Support)",
                        "ref_id": null
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Skill Statements",
                "sec_num": "2"
            },
            {
                "text": "In this section, we first explain a statistical information-theoretic approach we used as a baseline, and show examples of how it performs for our task. The error analysis of this approach motivates our semantic approach that takes the structural information of the text into consideration. In the remainder of this section, we describe how we extract semantic role information from the syntactic parse trees of the skill statements. Four natural language parsers are compared and evaluated for the purpose of our task.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Computing Semantic Similarities between Skill Statements",
                "sec_num": "3"
            },
            {
                "text": "In order to compute semantic similarities between skill statements, we first adopted one of the standard statistical approaches to the problem of computing text similarities based on Lin's informationtheoretic similarity measure (Lin 1998a ). Lin defined the commonality between A and B as",
                "cite_spans": [
                    {
                        "start": 229,
                        "end": 239,
                        "text": "(Lin 1998a",
                        "ref_id": null
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Statistical Approach",
                "sec_num": "3.1"
            },
            {
                "text": ")) , ( ( B A common I where common(A, B) is a proportion that states the commonalities between A and B and where the amount of information in proposition s is",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Statistical Approach",
                "sec_num": "3.1"
            },
            {
                "text": ") ( log ) ( s P s I - =",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Statistical Approach",
                "sec_num": "3.1"
            },
            {
                "text": "The similarity between A and B is then defined as the ratio between the amount of information needed to state the commonality of A and B and the information needed to fully describe A and B: The words are stemmed first so that the words with the same root (e.g., managing & management) can be found as commonalities between two skill statements. A stop-word list is also used so that the commonly used words in most of the documents (e.g., the, a) are not used as features. A formal evaluation of this approach will be presented in Section 4 where the similarity between 75 pairs of skill statements will be evaluated against human judgments, but we discuss some examples here.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Statistical Approach",
                "sec_num": "3.1"
            },
            {
                "text": "In order to see how to improve Lin's statistical similarity measure, we examine sample skill statement pairs which achieve high similarity scores from Lin's measure but were rated consistently as dissimilar by human subjects in our evaluation. Advise on Money Center Banking In these two examples, although many words are shared between the two pairs of skill statements (Advise Business Knowledge of ... for FEM for the first pair; Advise on Money for the second pair), they are not similar to human judges. We conjecture that this judgment of dissimilarity is due to the differences between the key components of the skill statements (CAD functionality vs. Process in the first pair; Money Market vs. Money Center Banking in the second pair).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Statistical Approach",
                "sec_num": "3.1"
            },
            {
                "text": "This kind of error is common for most statistical approaches to the problem, where common information is computed without considering the structural information in the text. From the above examples, we can see that the similarity computation would be more accurate if the verb phrases match on corresponding semantic roles, instead of matching words from any location in the skill statements. By identifying semantic roles, we can provide more weights to those semantic roles critical for our task, i.e., the key components of the skill statements.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Statistical Approach",
                "sec_num": "3.1"
            },
            {
                "text": "The following example shows the kind of semantic roles we want to be able to identify and assign.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Identifying and Assigning Semantic Roles",
                "sec_num": "3.2"
            },
            {
                "text": "[",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Identifying and Assigning Semantic Roles",
                "sec_num": "3.2"
            },
            {
                "text": "action Apply] [ theme Knowledge of [ concept IBM E- business Middleware]] to [ purpose PLM Solu- tions]",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Identifying and Assigning Semantic Roles",
                "sec_num": "3.2"
            },
            {
                "text": "In this example, \"Apply\" is the \"action\" of the skill; \"Knowledge of IBM E-business Middleware\" is the \"theme\" of the skill, where the \"concept\" semantic role (IBM E-business Middleware) specifies the key component of the skill requirement and is the most important role for skill matching; \"PLM Solutions\" is the \"purpose\" of the skill.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Identifying and Assigning Semantic Roles",
                "sec_num": "3.2"
            },
            {
                "text": "Our goal was to extract all such semantic role patterns for all the skill statements, and match on corresponding semantic roles. Although there exists some automatic semantic role taggers (Gildea and Jurafsky, 2002; Giuglea and Moschitti, 2006) , most of them were trained on PropBank (Palmer et. al., 2005) and/or FrameNet (Johnson et. al., 2003) , and perform much worse in other corpora (Pradhan et. al., 2004) . Our corpus is from a very different domain (information technology) and there are many domain-specific terms in the skill statements, such as product names, company names, and company-specific nomenclature for product offerings. Given this, we would expect poor performance from these automatic semantic role taggers. Moreover, the semantic role information we need to extract is more detailed and deeper than most of the automatic semantic role taggers can identify and extract (e.g., the \"concept\" role embedded within the \"theme\" role).",
                "cite_spans": [
                    {
                        "start": 188,
                        "end": 215,
                        "text": "(Gildea and Jurafsky, 2002;",
                        "ref_id": "BIBREF4"
                    },
                    {
                        "start": 216,
                        "end": 244,
                        "text": "Giuglea and Moschitti, 2006)",
                        "ref_id": "BIBREF5"
                    },
                    {
                        "start": 285,
                        "end": 307,
                        "text": "(Palmer et. al., 2005)",
                        "ref_id": "BIBREF15"
                    },
                    {
                        "start": 324,
                        "end": 347,
                        "text": "(Johnson et. al., 2003)",
                        "ref_id": "BIBREF8"
                    },
                    {
                        "start": 390,
                        "end": 413,
                        "text": "(Pradhan et. al., 2004)",
                        "ref_id": "BIBREF18"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Identifying and Assigning Semantic Roles",
                "sec_num": "3.2"
            },
            {
                "text": "We developed a specialized parser that extracts semantic role patterns from each of the 18 skill verbs. This semantic role parser can achieve a much higher performance than the general-purpose semantic role taggers. The inputs needed for the semantic role parser are syntactic parse trees generated by a natural language parse of the original skill statements.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Identifying and Assigning Semantic Roles",
                "sec_num": "3.2"
            },
            {
                "text": "We first used the Charniak parser (2000) to parse the original skill statements. However, among all the 10667 skill statements, 1217 were not parsed as verb phrases, leading to very poor performance. After examining the error cases, we found that abbreviations are used widely in the skill statements. For example, Advise Solns Supp Bus Proc Reeng for E&E Eng Procs These abbreviations made the system unable to determine the part of speech of some words, resulting in incorrect parses. Thus, the first step of the preprocessing was to expand abbreviations.",
                "cite_spans": [
                    {
                        "start": 18,
                        "end": 40,
                        "text": "Charniak parser (2000)",
                        "ref_id": null
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Preprocessing for Parsing",
                "sec_num": "3.3"
            },
            {
                "text": "There were 225 valid abbreviations already identified by the expertise taxonomy team. However, we found many abbreviations that appeared in the skill statements but were not listed there. Since most abbreviations are not words found in a dictionary, in order to find the abbreviations that appear frequently in the skill statements, we first found all the words in the skill statements that were not in WordNet (Miller, 1990) . We then ranked them based on their frequencies, and manually identified high frequency abbreviations. Using this approach, we added another 187 abbreviations to the list (a total of 412).",
                "cite_spans": [
                    {
                        "start": 411,
                        "end": 425,
                        "text": "(Miller, 1990)",
                        "ref_id": "BIBREF14"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Preprocessing for Parsing",
                "sec_num": "3.3"
            },
            {
                "text": "From the error cases, we also found that many words were mistagged as proper nouns, For example, \"Technically\" in Advise Technically for Simulation was parsed as a proper noun. We realized the reason for this error was that all the words, except for prepositions, are capitalized in the original statements and the parser tends to tag them as proper nouns. To solve this problem, we changed all the capitalized words to lower case, except for the first word and the acronyms (words that have all letters capitalized, e.g., IBM). After applying these two steps of preprocessing, we parsed the skill statements again. This time, more than 200 additional skill statements were parsed as verb phrases after the preprocessing.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Preprocessing for Parsing",
                "sec_num": "3.3"
            },
            {
                "text": "When we examined the error cases more closely, we found the errors occur mostly when the skill verbs can be both a noun and a verb (e.g., design, plan) . In those cases, the parser may parse the entire statement as one noun phrase, instead of a verb phrase. In order to disambiguate such cases, we added a subject (\"Employees\") to all the skill statements to convert them into full sentences. After applying this additional step of preprocessing, we parsed the skill statements again. This time, only 28 skill statements were not parsed as sentences containing verb phrases, a significant improvement. The remaining errors were due to the use of some words as skill verbs, e.g., \"architect\"1 , not recognized as verbs by the parser.",
                "cite_spans": [
                    {
                        "start": 138,
                        "end": 151,
                        "text": "design, plan)",
                        "ref_id": null
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Preprocessing for Parsing",
                "sec_num": "3.3"
            },
            {
                "text": "While the Charniak parser performed well in our initial verb phrase (VP) test, we decided to compare the Charniak parser's performance with other parsers. For this evaluation, we compared it with the Stanford parser, the ESG parser, and MINIPAR.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Parser Evaluation and Comparison",
                "sec_num": "3.4"
            },
            {
                "text": "The Stanford parser (Klein and Manning, 2003) is an unlexicalized statistical syntactic parser that was trained on the same corpus as the Charniak parser (the Penn TreeBank). Its parse tree has the same structure as the Charniak parser.",
                "cite_spans": [
                    {
                        "start": 20,
                        "end": 45,
                        "text": "(Klein and Manning, 2003)",
                        "ref_id": "BIBREF10"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Parser Evaluation and Comparison",
                "sec_num": "3.4"
            },
            {
                "text": "The ESG (English Slot Grammar) parser (McCord, 1980 ) is a rule-based parser based on the slot grammar where each phrase has a head and dependent elements, and is also marked with a syntactic role.",
                "cite_spans": [
                    {
                        "start": 38,
                        "end": 51,
                        "text": "(McCord, 1980",
                        "ref_id": "BIBREF13"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Parser Evaluation and Comparison",
                "sec_num": "3.4"
            },
            {
                "text": "MINIPAR (Lin, 1998b) , as a dependency parser, is very similar to the ESG parser in terms of its output. It represents sentence structures as a set of dependency relationships between head words.",
                "cite_spans": [
                    {
                        "start": 8,
                        "end": 20,
                        "text": "(Lin, 1998b)",
                        "ref_id": null
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Parser Evaluation and Comparison",
                "sec_num": "3.4"
            },
            {
                "text": "Since our purpose is to use the syntactic parses as inputs to extract semantic role patterns, the correctness of the bracketing of the parses and the syntactic labels of the phrases (e.g., NP, VP, and PP) are the most important information for our purposes, whereas the POS (Part-Of-Speech) labels of individual words (e.g., nouns vs. proper nouns) are not that important (also, there are too many domain-specific terms in our data). Thus, our evaluation of the parses is only on the correctness of the bracketing and the syntactic labels of the phrases, not the correctness of the entire parse. For our task, the correctness of the prepositional phrase attachment is especially important for extracting accurate semantic role patterns (Gildea and Jurafsky, 2002) ]. Thus the parser needs to correctly attach \"of IBM E-business Middleware\" to \"Knowledge\" and attach \"to PLM Solutions\" to \"Apply\", not \"Knowledge\".",
                "cite_spans": [
                    {
                        "start": 736,
                        "end": 763,
                        "text": "(Gildea and Jurafsky, 2002)",
                        "ref_id": "BIBREF4"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Parser Evaluation and Comparison",
                "sec_num": "3.4"
            },
            {
                "text": "To evaluate the performance of the parsers, we randomly picked 100 skill statements from our corpus, preprocessed them, and then parsed them using the four different parsers. We then evaluated the parses using the above evaluation measures. The parses were rated as correct or incorrect. No partial score was given. Figure 1 shows the evaluation results. The error analysis reveals four major sources of error for all the parsers, most of which are specific to the domain we are working on:",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 323,
                        "end": 324,
                        "text": "1",
                        "ref_id": "FIGREF0"
                    }
                ],
                "eq_spans": [],
                "section": "Parser Evaluation and Comparison",
                "sec_num": "3.4"
            },
            {
                "text": "(1) Many domain specific terms and acronyms.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Parser Evaluation and Comparison",
                "sec_num": "3.4"
            },
            {
                "text": "For example, \"SAP\" in \"Employees advise on SAP R/3 logistics basic data.\" was always tagged as a verb by the parsers. (2) Many long noun phrases. For example, \"Employees perform JD edwards foundation suite address book.\" (3) Some specialized use of punctuation. For example, \"Employees perform business transportation consultant-logistics.sys.\" (4) Prepositional phrase attachment can be difficult. For example, in \"Employees apply IBM infrastructure knowledge for IDBS\", \"for IDBS\" should attach to \"apply\", but many parsers mistakenly attach it to \"IBM infrastructure knowledge\". We noticed that MINIPAR performed much worse compared with the other parsers. The main reason is that it always parses the phrase \"VERB knowledge of Y\" (e.g., \"Employees apply knowledge of web technologies.\") incorrectly --the parse result always mistakenly attaches \"of Y\" (e.g., of web technologies) to the VERB (e.g., apply), not \"knowledge\". Since there were so many of phrases in the test set and in the corpus, this kind of error significantly reduced the performance for our task. These kinds of errors on prepositional phrase attachment in MINIPAR were also mentioned in (Pantel and Lin, 2000) .",
                "cite_spans": [
                    {
                        "start": 1161,
                        "end": 1183,
                        "text": "(Pantel and Lin, 2000)",
                        "ref_id": "BIBREF16"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Parser Evaluation and Comparison",
                "sec_num": "3.4"
            },
            {
                "text": "From the evaluation and comparison results we can see that the Charniak parser performs the best for our task among all the four parsers. This result is consistent with a more thorough evaluation (Swanson and Gordon, 2006 ) on a different corpus with a set of different target verbs, which showed the Charniak parser performed the best among three parsers (including the Stanford parser and MINPAR) for labeling semantic roles. We note that although the ESG parser performed a little worse than the Charniak parser, its parses contain much richer syntactic (e.g., subject, object) and semantic (e.g., word senses) slot-filling information, which can be very useful to many natural language applications.",
                "cite_spans": [
                    {
                        "start": 196,
                        "end": 221,
                        "text": "(Swanson and Gordon, 2006",
                        "ref_id": "BIBREF21"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Parser Evaluation and Comparison",
                "sec_num": "3.4"
            },
            {
                "text": "From the parse trees generated by the Charniak parser, we first automatically extracted patterns for each of the 18 skill verbs (e.g., \"Advise on NP for NP\"), and then we manually identified the semantic roles. For example, the semantic role patterns identified for the skill verb \"Advise\" are:",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Extracted Semantic Role Patterns",
                "sec_num": "3.5"
            },
            {
                "text": "• Advise [Theme] (for [Purpose]) • Advise (technically) on/about [Theme] (for [Purpose]) • Advise clients/customers/employees/users on/regarding [Theme]",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Extracted Semantic Role Patterns",
                "sec_num": "3.5"
            },
            {
                "text": "The corpus also contains embedded sub-semanticrole patterns, for example, for the \"Theme\" role we extracted the following sub-patterns:",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Extracted Semantic Role Patterns",
                "sec_num": "3.5"
            },
            {
                "text": "• (application) knowledge of/for [Concept] • sales of [Concept] • (technical) implementation of [Concept]",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Extracted Semantic Role Patterns",
                "sec_num": "3.5"
            },
            {
                "text": "We have extracted and identified a total of 74 such semantic role patterns from the skill statements.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Extracted Semantic Role Patterns",
                "sec_num": "3.5"
            },
            {
                "text": "In order to evaluate the two approaches (semantic role parsing and statistical) to computing semantic similarity of skill statements in our domain, we first conducted an experiment to evaluate how humans agree on this task, which also provides us with an upper bound accuracy for the task.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Evaluation",
                "sec_num": "4"
            },
            {
                "text": "To assess inter-rater agreement, we randomly selected 75 skill pairs from the expertise taxonomy.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Inter-Rater Agreement and Upper Bound Accuracy",
                "sec_num": "4.1"
            },
            {
                "text": "Since random pairs of verbs would have little or no similarity, we selected skill pairs that share the same job role, or same secondary or primary job category, or from across the entire expertise taxonomy.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Inter-Rater Agreement and Upper Bound Accuracy",
                "sec_num": "4.1"
            },
            {
                "text": "These 75 skill pairs are then given to three raters to independently judge their similarities on a 5 point scale from 1 as very similar to 5 as very dissimilar. Since this 5 point scale is very finegrained, we also converted the judgments to a more coarse-grained measure --binary judgment: 1 and 2 count as similar; 3-5 as not similar.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Inter-Rater Agreement and Upper Bound Accuracy",
                "sec_num": "4.1"
            },
            {
                "text": "The metric we used is the kappa statistic (Carletta, 1996) , which factors out the agreement that is expected by chance:",
                "cite_spans": [
                    {
                        "start": 42,
                        "end": 58,
                        "text": "(Carletta, 1996)",
                        "ref_id": "BIBREF1"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Inter-Rater Agreement and Upper Bound Accuracy",
                "sec_num": "4.1"
            },
            {
                "text": ") ( 1 ) ( ) ( E P E P A P - - = κ",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Inter-Rater Agreement and Upper Bound Accuracy",
                "sec_num": "4.1"
            },
            {
                "text": "where P(A) is the observed agreement among the raters, and P(E) is the expected agreement, i.e., the probability that the raters agree by chance.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Inter-Rater Agreement and Upper Bound Accuracy",
                "sec_num": "4.1"
            },
            {
                "text": "Since the judgment on the 5 point scale is ordinal data, the weighted kappa statistic is used to take the distance of disagreement into consideration (e.g., the disagreement between 1 and 2 is smaller than that between 1 and 5).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Inter-Rater Agreement and Upper Bound Accuracy",
                "sec_num": "4.1"
            },
            {
                "text": "The inter-rater agreement results for both the fine-grained and coarse-grained judgments are shown in Table 1 . In general, a kappa value above 0.80 represents perfect agreement, 0.60-0.80 represents significant agreement, 0.40-0.60 represents moderate agreement, and 0.20-0.40 is fair agreement (Chklovski and Mihalcea, 2003) . We can see that the agreement on the fine-grained judgment is moderate, whereas the agreement on the coarsegrained (binary) judgment is significant.",
                "cite_spans": [
                    {
                        "start": 296,
                        "end": 326,
                        "text": "(Chklovski and Mihalcea, 2003)",
                        "ref_id": "BIBREF3"
                    }
                ],
                "ref_spans": [
                    {
                        "start": 108,
                        "end": 109,
                        "text": "1",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "Inter-Rater Agreement and Upper Bound Accuracy",
                "sec_num": "4.1"
            },
            {
                "text": "Fine-Grained Coarse-Grained Kappa 0.412 0.602 Table 1 . Inter-Rater Agreement Results.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 52,
                        "end": 53,
                        "text": "1",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "Inter-Rater Agreement and Upper Bound Accuracy",
                "sec_num": "4.1"
            },
            {
                "text": "From the inter-rater agreement evaluation, we can also get an upper bound accuracy for our task, i.e., human agreement without factoring out the agreement expected by chance (i.e., P(A) in the kappa statistic). The average P(A) for the coarsegrained (binary) judgment is 0.81, and that constitutes the upper bound accuracy for our task.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Inter-Rater Agreement and Upper Bound Accuracy",
                "sec_num": "4.1"
            },
            {
                "text": "We use the 75 skill pairs as test data to evaluate our semantic similarity approach against human judgments. Considering the reliability of the data, only the coarse-grained (binary) judgments are used. The gold standard is obtained by majority voting from the three raters, i.e., for a given skill pair, if two or more raters judge it as similar, then the gold standard answer is \"similar\", otherwise it is \"not similar\".",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Evaluation of the Statistical Approach",
                "sec_num": "4.2"
            },
            {
                "text": "We first evaluated Lin's statistical approach described in Section 3.1. Among 75 skill pairs, 53 of them were rated correctly according to the human judgments, that is, 70.67% accuracy. The error analysis shows that many of the errors can be corrected if the skills are matched on their corresponding semantic roles. We then evaluated the utility of the extracted semantic role information to see whether it can outperform the statistical approach.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Evaluation of the Statistical Approach",
                "sec_num": "4.2"
            },
            {
                "text": "For simplicity, we will only report on evaluating semantic role matching on the \"concept\" role that specifies the key component of the skills, as introduced in Section 3.2. There are at least two straightforward ways of performing semantic role matching for the skill similarity computation: 1) match on the entire semantic role; 2) match on the head nouns only. But both have their drawbacks: the first approach is too strict and will miss many similar skill statements; the second approach may not only miss the similar skill statements, e.g., Perform [Web Services Planning]2 Perform [Web Services Assessment] but also misclassify dissimilar ones as similar, e.g.,",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Evaluation of Semantic Role Matching Approach",
                "sec_num": "4.3"
            },
            {
                "text": "In order to solve these problems, we used a simple matching criterion from Tversky (1977) . The similarity of two texts t 1 and t 2 is determined by: Similarity(t 1 , t 2 ) = This equation states that two texts are similar if shared features are a large percentage of the total features. We set a threshold of 0.5, requiring that at least 50% of the features be shared. We apply this criterion to the text contained in the \"concept\" role.",
                "cite_spans": [
                    {
                        "start": 75,
                        "end": 89,
                        "text": "Tversky (1977)",
                        "ref_id": "BIBREF22"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Advise about [Async Transfer Mode (ATM) Solutions] Advise about [CTI Solutions]",
                "sec_num": null
            },
            {
                "text": "The words in the calculation are preprocessed first: abbreviations are expanded, stop-words are excluded (e.g., the and of don't count as shared words), and the remaining words are stemmed (e.g., manager and management are counted as shared words), as was done in our previous information-theoretic approach. Words connected by punctuation (e.g., e-business, software/hardware) are treated as separate words. For example,",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Advise about [Async Transfer Mode (ATM) Solutions] Advise about [CTI Solutions]",
                "sec_num": null
            },
            {
                "text": "Advise on [Field/Force Management] for Telecom Apply Knowledge of [Basic Field Force Automation] The shared words between the two \"concept\" roles (bracketed) are \"Field\" and \"Force\", and their shared percentage is (2*2)/7 = 57.14% > 50%, so they are similar.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Advise about [Async Transfer Mode (ATM) Solutions] Advise about [CTI Solutions]",
                "sec_num": null
            },
            {
                "text": "We have also evaluated this approach on our test set with the 75 skill pairs. Among 75 skill pairs, 60 of them were rated correctly (i.e., 80% accuracy), which significantly outperforms the statistical approach, and is very close to the upper bound accuracy, i.e., human agreement (81%), as shown in Figure 2 . The difference between this approach and Lin's information content approach is that this computation is local --no corpus statistics is used. Also, using this approach, it is easier to set an intuitive threshold (e.g., 50%) for a classification problem (e.g., similar or not for our task). With this approach, however, there are also cases that are mistagged as similar, for example, Apply Knowledge of [Basic Field Force Automation] Advise on [Sales Force Automation] Although \"Field Force Automation\" and \"Sales Force Automation\" seem similar on their surface form, they are two quite different concepts. Deeper domain knowledge (such as an ontology) is needed to distinguish such cases.",
                "cite_spans": [
                    {
                        "start": 714,
                        "end": 744,
                        "text": "[Basic Field Force Automation]",
                        "ref_id": null
                    }
                ],
                "ref_spans": [
                    {
                        "start": 307,
                        "end": 308,
                        "text": "2",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "Advise about [Async Transfer Mode (ATM) Solutions] Advise about [CTI Solutions]",
                "sec_num": null
            },
            {
                "text": "We have also investigated several approaches to improving the semantic role text similarity measure we described. One approach is to also consider similarities between skill verbs. In this example:",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Discussion",
                "sec_num": "5"
            },
            {
                "text": "Implement Domino Mail Manager Develop for Domino Mail Manager although the key components of the skill statements (Domino Mail Manager) are the same, their skill verbs are different (implement vs. develop for). The skills required for \"implementing\" a system or software product are usually different from those required for \"developing for\" the same system or software product. This example shows that a semantic similarity computation between skill verbs is required to distinguishing such cases.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Discussion",
                "sec_num": "5"
            },
            {
                "text": "Many approaches to the problem of word/concept similarities are based on taxonomies, e.g., WordNet. The simplest approach is to count the number of nodes on the shortest path between two concepts in the taxonomy (Quillian, 1972) . The fewer nodes on the path, the more similar the two concepts are. The assumption for this shortest path approach is that the links in the taxonomy represent uniform distances. However, in most taxonomies, sibling concepts deep in the taxonomy are usually more closely related than those higher up. Different approaches have been proposed to discount the depth of the concepts to overcome the problem. Budanitsky and Hirst (2006) thoroughly evaluated six of the approaches (Hirst and St-Onge, Leacock and Chodorow, Jiang and Conrath, Lin, Resnik, Wu and Palmer) , and found that Jiang and Conrath (1997) was superior to the other approaches based on their evaluation experiments.",
                "cite_spans": [
                    {
                        "start": 212,
                        "end": 228,
                        "text": "(Quillian, 1972)",
                        "ref_id": "BIBREF19"
                    },
                    {
                        "start": 634,
                        "end": 661,
                        "text": "Budanitsky and Hirst (2006)",
                        "ref_id": "BIBREF0"
                    },
                    {
                        "start": 747,
                        "end": 793,
                        "text": "Jiang and Conrath, Lin, Resnik, Wu and Palmer)",
                        "ref_id": null
                    },
                    {
                        "start": 811,
                        "end": 835,
                        "text": "Jiang and Conrath (1997)",
                        "ref_id": "BIBREF7"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Discussion",
                "sec_num": "5"
            },
            {
                "text": "For our task, we compared two approaches to computing skill verb similarities: shortest path vs. Jiang and Conrath. Since the words are compared based on their specific senses, we first manually assigned one most appropriate sense for each of the 18 skill verbs from WordNet. We then used the library developed by Pedersen et al. (2004) to compute their similarity scores.",
                "cite_spans": [
                    {
                        "start": 314,
                        "end": 336,
                        "text": "Pedersen et al. (2004)",
                        "ref_id": "BIBREF17"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Discussion",
                "sec_num": "5"
            },
            {
                "text": "Table 2 shows the top nine pairs of skill verbs with the highest similarity scores from the two approaches. We can see that the two approaches agree on the top four pairs, but disagree on the rest in the list. One intuitive example is the pair \"Lead\" and \"Manage\" which is ranked the 5 th by the Jiang and Conrath approach but ranked the 46 th by the shortest path approach. It seems that the Jiang and Conrath approach matches better with our human intuition for this example. While we didn't compare these results with human performance, in general most of the similar skill verb pairs listed in the table don't look very similar for our domain. This may be due to the fact that WordNet is a generalpurpose taxonomy --although we have already selected the most appropriate sense for each verb, their relationship represented in the taxonomy may still be quite different from the relationship in our domain. A domain-specific taxonomy for skill verbs may improve the performance. The other reason may be due to the structure of WordNet's verb taxonomy, as mentioned in (Resnik and Diab, 2000) , which is considerably wider and shallower than WordNet's noun taxonomy. A different verb lexicon, e.g., VerbNet (Kipper et al., 2000) , can be explored.",
                "cite_spans": [
                    {
                        "start": 1070,
                        "end": 1093,
                        "text": "(Resnik and Diab, 2000)",
                        "ref_id": "BIBREF20"
                    },
                    {
                        "start": 1208,
                        "end": 1229,
                        "text": "(Kipper et al., 2000)",
                        "ref_id": "BIBREF9"
                    }
                ],
                "ref_spans": [
                    {
                        "start": 6,
                        "end": 7,
                        "text": "2",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "Discussion",
                "sec_num": "5"
            },
            {
                "text": "In this paper, we have presented our work on a semantic similarity computation for skill statements in natural language. We compared and evaluated four different natural language parsers for our task, and matched skills on their corresponding semantic roles extracted from the parse trees generated by one of these parsers. The evaluation results showed that the skill similarity computation based on semantic role matching can outperform a standard statistical approach and reach the level of human agreement.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Conclusion",
                "sec_num": "6"
            },
            {
                "text": "The extracted semantic role information can also be incorporated into the standard statistical approaches as additional features. One way is to give higher weights to those semantic role features deemed most important. This approach has achieved a high performance for a text categorization task when combining extracted keywords with the full text (Hulth and Megyesi, 2006) .",
                "cite_spans": [
                    {
                        "start": 349,
                        "end": 374,
                        "text": "(Hulth and Megyesi, 2006)",
                        "ref_id": "BIBREF6"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Conclusion",
                "sec_num": "6"
            },
            {
                "text": "We have shown that good results can be achieved for a domain-specific text matching task by performing a simple word-based feature comparison on corresponding structural elements of texts. We have shown that the structural elements of importance can be identified by domain-specific pattern analysis of corresponding parse trees. We believe this approach can generalize to other domains where phrases, sentences, or other short texts need to be compared.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Conclusion",
                "sec_num": "6"
            },
            {
                "text": "\"Architect\" has no verb sense in WordNet and many other dictionaries, but it does have a verb sense in the Oxford English Dictionary (http://dictionary.oed.com/).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            },
            {
                "text": "The \"concept\" role is identified with brackets, and the head nouns are italic.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            }
        ],
        "back_matter": [
            {
                "text": "The majority of this work was performed while the first author was a summer intern at IBM T. J. Watson Research Center in Hawthorne, NY. Thanks to Yael Ravin and Jennifer Lai for supporting this work, Brian White for his help on the software, Michael McCord for assistance with the IBM ESG parser, and the IBM Expertise Taxonomy team for letting us use their data.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Acknowledgements",
                "sec_num": null
            },
            {
                "text": "Jiang and Conrath ",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Shortest Path",
                "sec_num": null
            }
        ],
        "bib_entries": {
            "BIBREF0": {
                "ref_id": "b0",
                "title": "Evaluating WordNetbased Measures of Lexical Semantic Relatedness",
                "authors": [
                    {
                        "first": "A",
                        "middle": [],
                        "last": "Budanitsky",
                        "suffix": ""
                    },
                    {
                        "first": "G",
                        "middle": [],
                        "last": "Hirst",
                        "suffix": ""
                    }
                ],
                "year": 2006,
                "venue": "Computational Linguistics",
                "volume": "32",
                "issue": "1",
                "pages": "13--47",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "A. Budanitsky and G. Hirst. 2006. Evaluating WordNet- based Measures of Lexical Semantic Relatedness. Computational Linguistics. 32(1):13-47.",
                "links": null
            },
            "BIBREF1": {
                "ref_id": "b1",
                "title": "Assessing agreement on classification tasks: the kappa statistic",
                "authors": [
                    {
                        "first": "J",
                        "middle": [],
                        "last": "Carletta",
                        "suffix": ""
                    }
                ],
                "year": 1996,
                "venue": "Computational Linguistics",
                "volume": "22",
                "issue": "2",
                "pages": "249--254",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "J. Carletta. 1996. Assessing agreement on classification tasks: the kappa statistic. Computational Linguistics, 22(2):249-254.",
                "links": null
            },
            "BIBREF2": {
                "ref_id": "b2",
                "title": "A maximum-entropy-inspired parser",
                "authors": [
                    {
                        "first": "E",
                        "middle": [],
                        "last": "Charniak",
                        "suffix": ""
                    }
                ],
                "year": 2000,
                "venue": "Proceedings of NAACL",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "E. Charniak. 2000. A maximum-entropy-inspired parser. In Proceedings of NAACL.",
                "links": null
            },
            "BIBREF3": {
                "ref_id": "b3",
                "title": "Exploiting Agreement and Disagreement of Human Annotators for Word Sense Disambiguation",
                "authors": [
                    {
                        "first": "T",
                        "middle": [],
                        "last": "Chklovski",
                        "suffix": ""
                    },
                    {
                        "first": "R",
                        "middle": [],
                        "last": "Mihalcea",
                        "suffix": ""
                    }
                ],
                "year": 2003,
                "venue": "Proceedings of RANLP",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "T. Chklovski and R. Mihalcea. 2003. Exploiting Agree- ment and Disagreement of Human Annotators for Word Sense Disambiguation. In Proceedings of RANLP.",
                "links": null
            },
            "BIBREF4": {
                "ref_id": "b4",
                "title": "Automatic labeling of semantic roles",
                "authors": [
                    {
                        "first": "D",
                        "middle": [],
                        "last": "Gildea",
                        "suffix": ""
                    },
                    {
                        "first": "D",
                        "middle": [],
                        "last": "Jurafsky",
                        "suffix": ""
                    }
                ],
                "year": 2002,
                "venue": "Computational Linguistics",
                "volume": "28",
                "issue": "3",
                "pages": "245--288",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "D. Gildea and D. Jurafsky. 2002. Automatic labeling of semantic roles. Computational Linguistics, 28(3): 245 -288.",
                "links": null
            },
            "BIBREF5": {
                "ref_id": "b5",
                "title": "Semantic Role Labeling via FrameNet, VerbNet and PropBank",
                "authors": [
                    {
                        "first": "A",
                        "middle": [],
                        "last": "Giuglea",
                        "suffix": ""
                    },
                    {
                        "first": "A",
                        "middle": [],
                        "last": "Moschitti",
                        "suffix": ""
                    }
                ],
                "year": 2006,
                "venue": "Proceedings of COLING-ACL",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "A. Giuglea and A. Moschitti. 2006. Semantic Role La- beling via FrameNet, VerbNet and PropBank. In Proceedings of COLING-ACL.",
                "links": null
            },
            "BIBREF6": {
                "ref_id": "b6",
                "title": "A Study on Automatically Extracted Keywords in Text Categorization",
                "authors": [
                    {
                        "first": "A",
                        "middle": [],
                        "last": "Hulth",
                        "suffix": ""
                    },
                    {
                        "first": "B",
                        "middle": [
                            "B"
                        ],
                        "last": "Megyesi",
                        "suffix": ""
                    }
                ],
                "year": 2006,
                "venue": "Proceedings of COLING-ACL",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "A. Hulth and B. B. Megyesi. 2006. A Study on Auto- matically Extracted Keywords in Text Categoriza- tion. In Proceedings of COLING-ACL.",
                "links": null
            },
            "BIBREF7": {
                "ref_id": "b7",
                "title": "Semantic similarity based on corpus statistics and lexical taxonomy",
                "authors": [
                    {
                        "first": "J",
                        "middle": [
                            "J"
                        ],
                        "last": "Jiang",
                        "suffix": ""
                    },
                    {
                        "first": "D",
                        "middle": [
                            "W"
                        ],
                        "last": "Conrath",
                        "suffix": ""
                    }
                ],
                "year": 1997,
                "venue": "Proceedings of ROCLING X",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "J. J. Jiang and D. W. Conrath. 1997. Semantic similarity based on corpus statistics and lexical taxonomy. In Proceedings of ROCLING X.",
                "links": null
            },
            "BIBREF8": {
                "ref_id": "b8",
                "title": "Framenet: Theory and practice",
                "authors": [
                    {
                        "first": "C",
                        "middle": [],
                        "last": "Johnson",
                        "suffix": ""
                    },
                    {
                        "first": "M",
                        "middle": [],
                        "last": "Petruck",
                        "suffix": ""
                    },
                    {
                        "first": "C",
                        "middle": [],
                        "last": "Baker",
                        "suffix": ""
                    },
                    {
                        "first": "M",
                        "middle": [],
                        "last": "Ellsworth",
                        "suffix": ""
                    },
                    {
                        "first": "J",
                        "middle": [],
                        "last": "Ruppenhofer",
                        "suffix": ""
                    },
                    {
                        "first": "C",
                        "middle": [],
                        "last": "Fillmore",
                        "suffix": ""
                    }
                ],
                "year": 2003,
                "venue": "",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "C. Johnson, M. Petruck, C. Baker, M. Ellsworth, J. Rup- penhofer, and C. Fillmore. 2003. Framenet: Theory and practice. Berkeley, California.",
                "links": null
            },
            "BIBREF9": {
                "ref_id": "b9",
                "title": "Class-Based Construction of a Verb Lexicon",
                "authors": [
                    {
                        "first": "K",
                        "middle": [],
                        "last": "Kipper",
                        "suffix": ""
                    },
                    {
                        "first": "H",
                        "middle": [
                            "T"
                        ],
                        "last": "Dang",
                        "suffix": ""
                    },
                    {
                        "first": "M",
                        "middle": [],
                        "last": "Palmer",
                        "suffix": ""
                    }
                ],
                "year": 2000,
                "venue": "Proceedings of AAAI",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "K. Kipper, H. T. Dang, M. Palmer. 2000. Class-Based Construction of a Verb Lexicon. In Proceedings of AAAI.",
                "links": null
            },
            "BIBREF10": {
                "ref_id": "b10",
                "title": "Accurate Unlexicalized Parsing",
                "authors": [
                    {
                        "first": "D",
                        "middle": [],
                        "last": "Klein",
                        "suffix": ""
                    },
                    {
                        "first": "C",
                        "middle": [
                            "D"
                        ],
                        "last": "Manning",
                        "suffix": ""
                    }
                ],
                "year": 2003,
                "venue": "Proceedings of ACL",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "D. Klein and C. D. Manning. 2003. Accurate Unlexical- ized Parsing. In Proceedings of ACL.",
                "links": null
            },
            "BIBREF11": {
                "ref_id": "b11",
                "title": "1998a. An information-theoretic definition of similarity",
                "authors": [
                    {
                        "first": "D",
                        "middle": [],
                        "last": "Lin",
                        "suffix": ""
                    }
                ],
                "year": null,
                "venue": "Proceedings of ICML",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "D. Lin. 1998a. An information-theoretic definition of similarity. In Proceedings of ICML.",
                "links": null
            },
            "BIBREF12": {
                "ref_id": "b12",
                "title": "Dependency-based evaluation of MINIPAR",
                "authors": [
                    {
                        "first": "D",
                        "middle": [],
                        "last": "Lin",
                        "suffix": ""
                    }
                ],
                "year": 1998,
                "venue": "Proceedings of the Workshop at LREC on The Evaluation of Parsing Systems",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "D. Lin. 1998b. Dependency-based evaluation of MINIPAR. In Proceedings of the Workshop at LREC on The Evaluation of Parsing Systems.",
                "links": null
            },
            "BIBREF13": {
                "ref_id": "b13",
                "title": "Slot grammars",
                "authors": [
                    {
                        "first": "M",
                        "middle": [
                            "C"
                        ],
                        "last": "Mccord",
                        "suffix": ""
                    }
                ],
                "year": 1980,
                "venue": "Computational Linguistics",
                "volume": "6",
                "issue": "",
                "pages": "31--43",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "M. C. McCord. 1980. Slot grammars. Computational Linguistics, 6: 31-43.",
                "links": null
            },
            "BIBREF14": {
                "ref_id": "b14",
                "title": "WordNet: an On-line Lexical Database",
                "authors": [
                    {
                        "first": "G",
                        "middle": [
                            "A"
                        ],
                        "last": "Miller",
                        "suffix": ""
                    }
                ],
                "year": 1990,
                "venue": "International Journal of Lexicography",
                "volume": "3",
                "issue": "4",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "G. A. Miller. 1990. WordNet: an On-line Lexical Data- base. International Journal of Lexicography 3(4).",
                "links": null
            },
            "BIBREF15": {
                "ref_id": "b15",
                "title": "The proposition bank: An annotated corpus of semantic roles",
                "authors": [
                    {
                        "first": "M",
                        "middle": [],
                        "last": "Palmer",
                        "suffix": ""
                    },
                    {
                        "first": "D",
                        "middle": [],
                        "last": "Gildea",
                        "suffix": ""
                    },
                    {
                        "first": "P",
                        "middle": [],
                        "last": "Kingsbury",
                        "suffix": ""
                    }
                ],
                "year": 2005,
                "venue": "Computational Linguistics",
                "volume": "",
                "issue": "1",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "M. Palmer, D. Gildea, and P. Kingsbury. 2005. The proposition bank: An annotated corpus of semantic roles. Computational Linguistics, 31(1).",
                "links": null
            },
            "BIBREF16": {
                "ref_id": "b16",
                "title": "An unsupervised approach to prepositional phrase attachment using contextually similar words",
                "authors": [
                    {
                        "first": "P",
                        "middle": [],
                        "last": "Pantel",
                        "suffix": ""
                    },
                    {
                        "first": "D",
                        "middle": [],
                        "last": "Lin",
                        "suffix": ""
                    }
                ],
                "year": 2000,
                "venue": "Proceedings of ACL",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "P. Pantel and D. Lin. 2000. An unsupervised approach to prepositional phrase attachment using contextually similar words. In Proceedings of ACL.",
                "links": null
            },
            "BIBREF17": {
                "ref_id": "b17",
                "title": "Wordnet::similarity -measuring the relatedness of concepts",
                "authors": [
                    {
                        "first": "T",
                        "middle": [],
                        "last": "Pedersen",
                        "suffix": ""
                    },
                    {
                        "first": "S",
                        "middle": [],
                        "last": "Patwardhan",
                        "suffix": ""
                    },
                    {
                        "first": "J",
                        "middle": [],
                        "last": "Michelizzi",
                        "suffix": ""
                    }
                ],
                "year": 2004,
                "venue": "Proceedings of AAAI",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "T. Pedersen, S. Patwardhan, and J. Michelizzi. 2004. Wordnet::similarity -measuring the relatedness of concepts. In Proceedings of AAAI, Intelligent Sys- tems Demonstration.",
                "links": null
            },
            "BIBREF18": {
                "ref_id": "b18",
                "title": "Shallow Semantic Parsing using Support Vector Machines",
                "authors": [
                    {
                        "first": "S",
                        "middle": [],
                        "last": "Pradhan",
                        "suffix": ""
                    },
                    {
                        "first": "W",
                        "middle": [],
                        "last": "Ward",
                        "suffix": ""
                    },
                    {
                        "first": "K",
                        "middle": [],
                        "last": "Hacioglu",
                        "suffix": ""
                    },
                    {
                        "first": "J",
                        "middle": [],
                        "last": "Martin",
                        "suffix": ""
                    },
                    {
                        "first": "D",
                        "middle": [],
                        "last": "Jurafsky",
                        "suffix": ""
                    }
                ],
                "year": 2004,
                "venue": "Proceedings of HLT/NAACL",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "S. Pradhan, W. Ward, K. Hacioglu, J. Martin, and D. Jurafsky. 2004. Shallow Semantic Parsing using Support Vector Machines. In Proceedings of HLT/NAACL.",
                "links": null
            },
            "BIBREF19": {
                "ref_id": "b19",
                "title": "Semantic Memory, Semantic Information Processing",
                "authors": [
                    {
                        "first": "M",
                        "middle": [
                            "R"
                        ],
                        "last": "Quillian",
                        "suffix": ""
                    }
                ],
                "year": 1972,
                "venue": "Semantic information processing",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "M. R. Quillian. 1972. Semantic Memory, Semantic In- formation Processing. Semantic information process- ing, Cambridge.",
                "links": null
            },
            "BIBREF20": {
                "ref_id": "b20",
                "title": "Measuring verb similarity",
                "authors": [
                    {
                        "first": "P",
                        "middle": [],
                        "last": "Resnik",
                        "suffix": ""
                    },
                    {
                        "first": "M",
                        "middle": [],
                        "last": "Diab",
                        "suffix": ""
                    }
                ],
                "year": 2000,
                "venue": "Proceedings of COGSCI",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "P. Resnik and M. Diab. 2000. Measuring verb similar- ity. In Proceedings of COGSCI.",
                "links": null
            },
            "BIBREF21": {
                "ref_id": "b21",
                "title": "A Comparison of Alternative Parse Tree Paths for Labeling Semantic Roles",
                "authors": [
                    {
                        "first": "R",
                        "middle": [],
                        "last": "Swanson",
                        "suffix": ""
                    },
                    {
                        "first": "A",
                        "middle": [
                            "S"
                        ],
                        "last": "Gordon",
                        "suffix": ""
                    }
                ],
                "year": 2006,
                "venue": "Proceedings of COLING/ACL",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "R. Swanson and A. S. Gordon. 2006. A Comparison of Alternative Parse Tree Paths for Labeling Semantic Roles. In Proceedings of COLING/ACL.",
                "links": null
            },
            "BIBREF22": {
                "ref_id": "b22",
                "title": "Features of Similarity",
                "authors": [
                    {
                        "first": "A",
                        "middle": [],
                        "last": "Tversky",
                        "suffix": ""
                    }
                ],
                "year": 1977,
                "venue": "Psychological Review",
                "volume": "84",
                "issue": "4",
                "pages": "327--352",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "A. Tversky. 1977. Features of Similarity, Psychological Review, vol. 84, no. 4, pages 327-352.",
                "links": null
            }
        },
        "ref_entries": {
            "FIGREF0": {
                "num": null,
                "text": "Figure 1. An Evaluation of Four Parsers on the Task of Parsing Human Skill-related Verb Phrases",
                "uris": null,
                "fig_num": "1",
                "type_str": "figure"
            },
            "TABREF2": {
                "content": "<table/>",
                "type_str": "table",
                "text": ". For example, for the sentence Apply Knowledge of IBM E-business Middleware to PLM Solutions. the correct bracketing should be Apply [Knowledge [of [IBM E-business Middleware]]] [to [PLM Solutions]",
                "html": null,
                "num": null
            }
        }
    }
}