{
    "paper_id": "N16-1124",
    "header": {
        "generated_with": "S2ORC 1.0.0",
        "date_generated": "2023-06-16T11:56:05.862260Z"
    },
    "title": "Interlocking Phrases in Phrase-based Statistical Machine Translation",
    "authors": [
        {
            "first": "Ye",
            "middle": [],
            "last": "Kyaw",
            "suffix": "",
            "affiliation": {
                "laboratory": "Multilingual Translation Lab",
                "institution": "",
                "location": {
                    "addrLine": "3-5 Hikaridai, Seika-cho, Soraku-gun",
                    "postCode": "619-0289",
                    "settlement": "Kyoto",
                    "country": "JAPAN"
                }
            },
            "email": ""
        },
        {
            "first": "Andrew",
            "middle": [],
            "last": "Finch",
            "suffix": "",
            "affiliation": {
                "laboratory": "Multilingual Translation Lab",
                "institution": "",
                "location": {
                    "addrLine": "3-5 Hikaridai, Seika-cho, Soraku-gun",
                    "postCode": "619-0289",
                    "settlement": "Kyoto",
                    "country": "JAPAN"
                }
            },
            "email": "andrew.finch@nict.go.jp"
        },
        {
            "first": "Eiichiro",
            "middle": [],
            "last": "Sumita",
            "suffix": "",
            "affiliation": {
                "laboratory": "Multilingual Translation Lab",
                "institution": "",
                "location": {
                    "addrLine": "3-5 Hikaridai, Seika-cho, Soraku-gun",
                    "postCode": "619-0289",
                    "settlement": "Kyoto",
                    "country": "JAPAN"
                }
            },
            "email": "eiichiro.sumita@nict.go.jp"
        }
    ],
    "year": "",
    "venue": null,
    "identifiers": {},
    "abstract": "This paper presents an study of the use of interlocking phrases in phrase-based statistical machine translation. We examine the effect on translation quality when the translation units used in the translation hypotheses are allowed to overlap on the source side, on the target side and on both sides. A large-scale evaluation on 380 language pairs was conducted. Our results show that overall the use of overlapping phrases improved translation quality by 0.3 BLEU points on average. Further analysis revealed that language pairs requiring a larger amount of re-ordering benefited the most from our approach. When the evaluation was restricted to such pairs, the average improvement increased to up to 0.75 BLEU points with over 97% of the pairs improving. Our approach requires only a simple modification to the decoding algorithm and we believe it should be generally applicable to improve the performance of phrase-based decoders.",
    "pdf_parse": {
        "paper_id": "N16-1124",
        "_pdf_hash": "",
        "abstract": [
            {
                "text": "This paper presents an study of the use of interlocking phrases in phrase-based statistical machine translation. We examine the effect on translation quality when the translation units used in the translation hypotheses are allowed to overlap on the source side, on the target side and on both sides. A large-scale evaluation on 380 language pairs was conducted. Our results show that overall the use of overlapping phrases improved translation quality by 0.3 BLEU points on average. Further analysis revealed that language pairs requiring a larger amount of re-ordering benefited the most from our approach. When the evaluation was restricted to such pairs, the average improvement increased to up to 0.75 BLEU points with over 97% of the pairs improving. Our approach requires only a simple modification to the decoding algorithm and we believe it should be generally applicable to improve the performance of phrase-based decoders.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Abstract",
                "sec_num": null
            }
        ],
        "body_text": [
            {
                "text": "In this paper we examine the effect on machine translation quality of using interlocking phrases to during the decoding process in phrase-based statistical machine translation (PBSMT). The motivation for this is two-fold.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "Firstly, during the phrase-pair extraction process that occurs in the training of a typical PBSMT system, all possible alternative phrase-pairs are extracted that are consistent with a set of alignment points. As a consequence, the source and target sides of these extracted phrase pairs may over-lap. However, in contrast to this, the decoding process traditionally proceeds by concatenating disjoint translation units; the process relies on the language model to eliminate awkward hypotheses with repeated words produced by sequences of translation units that overlap.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "Secondly, the transduction process in PBSMT is carried out by generating hypotheses that are composed of sequences of translation units. These sequences are normally generated independently, as modeling the dependencies between them is difficult due to the data sparseness issues arising from modeling with word sequences. The process of interlocking is a way of introducing a form of dependency between translation units, effectively producing larger units from pairs of compatible units.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "2 Related Work (Karimova et al., 2014) presented a method to extract overlapping phrases offline for hierarchical phrase based SMT. They used the CDEC SMT decoder (Dyer et al., 2010) that offers several learners for discriminative tuning of weights for the new phrases. Their results showed improvements of 0.3 to 0.6 BLEU points over discriminatively trained hierarchical phrase-based SMT systems on two datasets for German-to-English translation. (Tribble and et al., 2003) proposed a method to generate longer new phrases by merging existing phraselevel alignments that have overlaping words on both source and target sides. Their experiments on translating Arabic-English text from the news domain were encouraging. (Roth and McCallum, 2010) proposed a conditional-random-field approach to discriminatively train phrase based machine translation in which training and decoding are both cast in a sampling framework. Different with traditional PB-SMT decoding that infers both a Viterbi alignment and the target sentence, their approach produced a rich overlapping phrase alignment. Their approach leveraged arbitrary features of the entire source sentence, target sentence and alignment. (Kääriäinen, 2009) proposed a novel phrase-based conditional exponential family translation model for SMT. The model operates on a feature representation in which sentence level translations are represented by enumerating all the known phrase level translations that occur inside them. The model automatically takes into account information provided by phrase overlaps. Although both of the latter two approaches were innovative the translation performance was lower than tranditional PBSMT baselines.",
                "cite_spans": [
                    {
                        "start": 15,
                        "end": 38,
                        "text": "(Karimova et al., 2014)",
                        "ref_id": "BIBREF4"
                    },
                    {
                        "start": 163,
                        "end": 182,
                        "text": "(Dyer et al., 2010)",
                        "ref_id": "BIBREF2"
                    },
                    {
                        "start": 449,
                        "end": 475,
                        "text": "(Tribble and et al., 2003)",
                        "ref_id": "BIBREF15"
                    },
                    {
                        "start": 720,
                        "end": 745,
                        "text": "(Roth and McCallum, 2010)",
                        "ref_id": null
                    },
                    {
                        "start": 1192,
                        "end": 1210,
                        "text": "(Kääriäinen, 2009)",
                        "ref_id": "BIBREF3"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "Our proposed approach is most similar to that of (Tribble and et al., 2003) . Our approach differs in the interlocking process is less constrained; phrase pairs can interlock independently on source and target sides, and the interlocking process performed during the decoding process itself, rather than by augmenting the phrase-table.",
                "cite_spans": [
                    {
                        "start": 49,
                        "end": 75,
                        "text": "(Tribble and et al., 2003)",
                        "ref_id": "BIBREF15"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "In the decoding process for PBSMT, the target is generated from left-to-right phrase-by-phrase. The process of interlocking the phrases is illustrated in Figure 1 . The s i are the source tokens, the t j are the target tokens, the lower target token sequence on the left represents the partial translation hypothesis, and the upper target phrase is the target side of a translation unit (s 3 s 4 , t 3 t 4 t 5 ) being used to extend the hypothesis. An interlock of length k is can occur if the last k tokens of the partial translation match the first k tokens of the target side of the translation unit being used to extend the hypothesis. In this case the decoder may create an extended hypothesis with the target side of the translation unit interlocked with the target word sequence generated so far. In order to do this, the k interlocked words are not inserted a second time into the target token sequence and the word penalty (if pre-calculated) is adjusted to reflect this. In the example given in Figure 1 , the translation resulting from extending the search with the interlocking translation unit will be t 1 t 2 t 3 t 4 t 5 .",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 161,
                        "end": 162,
                        "text": "1",
                        "ref_id": null
                    },
                    {
                        "start": 1012,
                        "end": 1013,
                        "text": "1",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "Target Interlocking",
                "sec_num": "3.1"
            },
            {
                "text": "s 1 s 2 s 3 s 4 t 1 t 2 t 3 t 3 t 4 t 5 Figure 1: Interlocking target phrases. s 1 s 2 s 3 s 5 s 6 s 7 s 3 s 4 s 5 s 1 s 2 s 3 s 3 s 4 s 5 s 1 s 2 s 3 s 3 s 4 s 1 (A) (B) (C)",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Target Interlocking",
                "sec_num": "3.1"
            },
            {
                "text": "The interlocking of source phrases can occur in three different ways as shown in Figure 2 . In Figure 2 (A), a source phrase is interlocking with source words to the left; in (B) a source phrase is interlocking with source words to the right; and in (C) a source phrase is interlocking on both sides. The interlocking process is handled before the search process begins, at the time the set of translation options used in the search is created. Additional interlocking translation options are created in which the source side phrase is permitted to overlap with the surrounding source context, however, later during the search this translation unit will only be used to translate (cover) the sequence of non-interlocking words. In this way, the decoder's search algorithm can be used without modification, when dealing with interlocking source phrases.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 88,
                        "end": 89,
                        "text": "2",
                        "ref_id": "FIGREF0"
                    },
                    {
                        "start": 102,
                        "end": 103,
                        "text": "2",
                        "ref_id": "FIGREF0"
                    }
                ],
                "eq_spans": [],
                "section": "Source Interlocking",
                "sec_num": "3.2"
            },
            {
                "text": "We used twenty languages from the multilingual Basic Travel Expressions Corpus (BTEC), which is a collection of travel-related expressions (Kikui et al., 2003) . The languages were Arabic (ar), Danish (da), German (de), English (en), Spenish (es), French (fr), Italian (it), Dutch (nl), Portugese (pt), Russian (ru), Tagalog (tl), Indonesian (id), Malaysian (ms), Vietnamese (vi), Thai (th), Hindi (hi), Chinese (zh), Japanese (ja), Korean (ko) and Myanmar (my). 155,121 sentences were used for training, 5,000 sentences for development and 2,000 sentences for evaluation.",
                "cite_spans": [
                    {
                        "start": 139,
                        "end": 159,
                        "text": "(Kikui et al., 2003)",
                        "ref_id": "BIBREF6"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Corpora",
                "sec_num": "4.1"
            },
            {
                "text": "In addition, we ran experiments on two language pairs from the Europarl corpus (Koehn, 2005) . The language pairs were English-German, German-English, English-Spanish and Spanish-English. The corpus statistics are given in Table 2 .",
                "cite_spans": [
                    {
                        "start": 79,
                        "end": 92,
                        "text": "(Koehn, 2005)",
                        "ref_id": "BIBREF9"
                    }
                ],
                "ref_spans": [
                    {
                        "start": 229,
                        "end": 230,
                        "text": "2",
                        "ref_id": "TABREF0"
                    }
                ],
                "eq_spans": [],
                "section": "Corpora",
                "sec_num": "4.1"
            },
            {
                "text": "We used a modified version of our in-house phrase based SMT system which operates similarly to Moses (Koehn and Haddow, 2009) . GIZA++ (Och and Ney, 2000) was used for word alignment, together with the grow-diag-final-and heuristics (Koehn et al., 2003) . A lexicalized reordering model was trained with the msd-bidirectional-fe option (Tillmann, 2004) . We used the SRILM toolkit to create 5-gram language models with interpolated modified Kneser-Ney discounting (Stolcke, 2002; Chen and Goodman, 1996) . The weights for the loglinear models were tuned using the MERT procedure (Och, 2003) . The translation performance was evaluated using the BLEU score (Papineni et al., 2001) .",
                "cite_spans": [
                    {
                        "start": 101,
                        "end": 125,
                        "text": "(Koehn and Haddow, 2009)",
                        "ref_id": "BIBREF7"
                    },
                    {
                        "start": 135,
                        "end": 154,
                        "text": "(Och and Ney, 2000)",
                        "ref_id": "BIBREF10"
                    },
                    {
                        "start": 233,
                        "end": 253,
                        "text": "(Koehn et al., 2003)",
                        "ref_id": "BIBREF8"
                    },
                    {
                        "start": 336,
                        "end": 352,
                        "text": "(Tillmann, 2004)",
                        "ref_id": "BIBREF14"
                    },
                    {
                        "start": 464,
                        "end": 479,
                        "text": "(Stolcke, 2002;",
                        "ref_id": "BIBREF13"
                    },
                    {
                        "start": 480,
                        "end": 503,
                        "text": "Chen and Goodman, 1996)",
                        "ref_id": "BIBREF1"
                    },
                    {
                        "start": 579,
                        "end": 590,
                        "text": "(Och, 2003)",
                        "ref_id": "BIBREF11"
                    },
                    {
                        "start": 656,
                        "end": 679,
                        "text": "(Papineni et al., 2001)",
                        "ref_id": "BIBREF12"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Experimental Methodology",
                "sec_num": "4.2"
            },
            {
                "text": "We ran three sets of experiments; (1) target interlocking, (2) source interlocking and (3) both source and target interlocking for all possible combinations of languages (i.e. 380 language pairs). We studied two methods for accomplishing (3). In the first, interlocking as defined in Sections 3.1 and 3.2 are permitted freely. In the second, the target is allowed to interlock if and only if the source is also interlocked. This was similar to the method proposed by (Tribble and et al., 2003) .",
                "cite_spans": [
                    {
                        "start": 467,
                        "end": 493,
                        "text": "(Tribble and et al., 2003)",
                        "ref_id": "BIBREF15"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Experimental Methodology",
                "sec_num": "4.2"
            },
            {
                "text": "In this section, we will first present the results of the experiments on the BTEC corpora and then report the results from the experiments from the Europarl corpus. ",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Results",
                "sec_num": "4.3"
            },
            {
                "text": "The difference in BLEU between a baseline system, a standard phrase-based SMT system without interlocking, and the proposed systems in which interlocking phrases where permitted, was calculated, and the average taken over all 380 language pairs. The results show that interlocking the phrases generally improves translation quality, and that the system gained slightly more from interlocking the target phrases, than from interlocking the source phrases. The average BLEU difference was 0.22 from interlocking target phrases, 0.14 from overlapping source phrases and 0.33 from interlocking both source and target. When the interlocking was constrained to ensure that both source and target phrases were interlocked, the average BLEU difference dropped to 0.27 BLEU. In the cases where both source and target phrases were allowed to interlock freely, 77% of the experiments showed an improvement in BLEU score.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "BLEU Differences",
                "sec_num": "4.3.1"
            },
            {
                "text": "A sequence of experiments were run on the baseline system with increasing stack size from 100, to 1000 in increments of 100. These experiments showed an increase of 0.07 BLEU points from stack size 100 to stack size 200, followed by a sequence of scores that did not vary more than 0.01. Therefore, we conclude that the gains we obtained through interlocking the phrases, could not have been obtained by simply increasing the amount of searching performed by the baseline system. In other words, the interlocking method is introducing novel and useful search steps into the search space. with similar word orders, whereas the remaining languages are typically Asian languages with different word orders. The language pairs that gained the most from interlocking on both source and target were: th-hi, hi-it, ko-de, ko-tl, th-ja, my-ru, my-th, my-ar, th-my, and it-ja. The languages that lost the most in BLEU score were: id-pt, ko-my, fr-id, mspt, id-it, da-ar, id-ko, da-es, id-ar, and de-it.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "BLEU Differences",
                "sec_num": "4.3.1"
            },
            {
                "text": "It is clear from Figure 3 that translation among the group of similar languages does not benefit from our approach, but the dissimilar languages do. This observation motivated further analysis of the data in order to develop a method for selecting language pairs suitable for our approach.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 24,
                        "end": 25,
                        "text": "3",
                        "ref_id": "FIGREF1"
                    }
                ],
                "eq_spans": [],
                "section": "Results by Language Pair",
                "sec_num": "4.3.2"
            },
            {
                "text": "Kendall's tau distance is the minimum number of transpositions of adjacent symbols necessary to transform one permutation into another (Kendall, 1938; Birch, 2011) , and is one method to gauge the amount of re-ordering that would be required during the translation process between two languages.",
                "cite_spans": [
                    {
                        "start": 135,
                        "end": 150,
                        "text": "(Kendall, 1938;",
                        "ref_id": "BIBREF5"
                    },
                    {
                        "start": 151,
                        "end": 163,
                        "text": "Birch, 2011)",
                        "ref_id": null
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Kendall's Tau Distance",
                "sec_num": "4.3.3"
            },
            {
                "text": "Figure 5 shows a scatter plot of all of the experiments, plotting BLEU difference against Kendall's tau. The points show a strong negative correlation (coefficient: -0.7). Therefore, we propose to use Kendall's tau as a means of selecting appropriate language pairs to be used with our method.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 7,
                        "end": 8,
                        "text": "5",
                        "ref_id": "FIGREF3"
                    }
                ],
                "eq_spans": [],
                "section": "Kendall's Tau Distance",
                "sec_num": "4.3.3"
            },
            {
                "text": "Table 1 shows the effect of filtering the set of language pairs by Kendall's tau. The effectiveness of the proposed method increases as languages with higher Kendall's tau distance are removed from the experimental set. When language pairs are selected according to Kendall's tau in the range 0 ≤ τ ≤ 0.75, the average BLEU gain of the set increases to 0.6 BLEU while still retaining approximately half of the language pairs in the set. Moreover, the proportion of experiments showing an in improvement in BLEU increases to over 97%. Figure 4 shows the distribution of BLEU differences for this subset of language pairs.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 6,
                        "end": 7,
                        "text": "1",
                        "ref_id": "TABREF1"
                    },
                    {
                        "start": 541,
                        "end": 542,
                        "text": "4",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "Kendall's Tau Distance",
                "sec_num": "4.3.3"
            },
            {
                "text": "The results of the previous sections were all based on experiments on the BTEC corpus. This corpus is unsual in that the sentences are short and the training data size is also small. In order to establish that our approach has more general application, we applied it to four language pairs from the much larger Europarl corpus. The results on the Europarl corpus are shown in Table 2 . For three of the language pairs we observed increases in BLEU scores over the baseline for all interlocking methods with substantial gains of 1.9 to 2.6 BLEU points coming from the source interlocking technique. However, the German to English pair gave a negative result. The results from the Europarl corpus are generally very encouraging but the negative result motivates further study on more language pairs from different domain in the future.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 382,
                        "end": 383,
                        "text": "2",
                        "ref_id": "TABREF0"
                    }
                ],
                "eq_spans": [],
                "section": "Europarl Corpus",
                "sec_num": "4.3.4"
            },
            {
                "text": "In this paper we propose and evaluate a simple technique for improving the performance of phrasebased statistical machine translation decoders, that can be implemented with only minor modifications to the decoder. In the proposed method phrases are allowed to interlock freely on both the source and target side during decoding. The experimental results, based on a large-scale study involving 380 language pairs provide strong evidence that our approach is genuinely effective in improving the machine translation quality. The translation quality improved for 77% of the language pairs tested, and this was increased to over 97% when the set of language pairs was filtered according to Kendall's tau distance. The translation quality improved by an average of up to 0.75 BLEU points on this subset. This value represents a lower bound on what is possible with this technique and in future work we intend to study the introduction of additional features into the log-linear model to encourage or discourage the use of interlocking phrases during decoding, and investigate the effect of increasing the number of interlocked words.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Conclusion",
                "sec_num": "5"
            }
        ],
        "back_matter": [],
        "bib_entries": {
            "BIBREF0": {
                "ref_id": "b0",
                "title": "Reordering Metrics for Statistical Machine Translation",
                "authors": [],
                "year": 2011,
                "venue": "",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Alexandra Birch. 2011. Reordering Metrics for Statisti- cal Machine Translation. Ph.D. thesis, University of Edinburgh.",
                "links": null
            },
            "BIBREF1": {
                "ref_id": "b1",
                "title": "An empirical study of smoothing techniques for language modeling",
                "authors": [
                    {
                        "first": "F",
                        "middle": [],
                        "last": "Stanley",
                        "suffix": ""
                    },
                    {
                        "first": "Joshua",
                        "middle": [],
                        "last": "Chen",
                        "suffix": ""
                    },
                    {
                        "first": "",
                        "middle": [],
                        "last": "Goodman",
                        "suffix": ""
                    }
                ],
                "year": 1996,
                "venue": "Proceedings of the 34th annual meeting on Association for Computational Linguistics",
                "volume": "",
                "issue": "",
                "pages": "310--318",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Stanley F Chen and Joshua Goodman. 1996. An empiri- cal study of smoothing techniques for language model- ing. In Proceedings of the 34th annual meeting on As- sociation for Computational Linguistics, pages 310- 318. Association for Computational Linguistics.",
                "links": null
            },
            "BIBREF2": {
                "ref_id": "b2",
                "title": "cdec: A decoder, alignment, and learning framework for finitestate and context-free translation models",
                "authors": [
                    {
                        "first": "Chris",
                        "middle": [],
                        "last": "Dyer",
                        "suffix": ""
                    },
                    {
                        "first": "Adam",
                        "middle": [],
                        "last": "Lopez",
                        "suffix": ""
                    },
                    {
                        "first": "Juri",
                        "middle": [],
                        "last": "Ganitkevitch",
                        "suffix": ""
                    },
                    {
                        "first": "Johnathan",
                        "middle": [],
                        "last": "Weese",
                        "suffix": ""
                    },
                    {
                        "first": "Ferhan",
                        "middle": [],
                        "last": "Ture",
                        "suffix": ""
                    },
                    {
                        "first": "Phil",
                        "middle": [],
                        "last": "Blunsom",
                        "suffix": ""
                    },
                    {
                        "first": "Hendra",
                        "middle": [],
                        "last": "Setiawan",
                        "suffix": ""
                    },
                    {
                        "first": "Vladimir",
                        "middle": [],
                        "last": "Eidelman",
                        "suffix": ""
                    },
                    {
                        "first": "Philip",
                        "middle": [],
                        "last": "Resnik",
                        "suffix": ""
                    }
                ],
                "year": 2010,
                "venue": "Proceedings of ACL",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Chris Dyer, Adam Lopez, Juri Ganitkevitch, Johnathan Weese, Ferhan Ture, Phil Blunsom, Hendra Setiawan, Vladimir Eidelman, and Philip Resnik. 2010. cdec: A decoder, alignment, and learning framework for finite- state and context-free translation models. In Proceed- ings of ACL.",
                "links": null
            },
            "BIBREF3": {
                "ref_id": "b3",
                "title": "Sinuhe -statistical machine translation using a globally trained conditional exponential family translation model",
                "authors": [
                    {
                        "first": "Matti",
                        "middle": [],
                        "last": "Kääriäinen",
                        "suffix": ""
                    }
                ],
                "year": 2009,
                "venue": "Proceedings of the 2009 Conference on Empirical Methods in Natural Language Processing",
                "volume": "",
                "issue": "",
                "pages": "1027--1036",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Matti Kääriäinen. 2009. Sinuhe -statistical machine translation using a globally trained conditional expo- nential family translation model. In Proceedings of the 2009 Conference on Empirical Methods in Natural Language Processing, pages 1027-1036, Singapore, August. Association for Computational Linguistics.",
                "links": null
            },
            "BIBREF4": {
                "ref_id": "b4",
                "title": "Offline extraction of overlapping phrases for hierarchical phrase-based translation",
                "authors": [
                    {
                        "first": "Sariya",
                        "middle": [],
                        "last": "Karimova",
                        "suffix": ""
                    },
                    {
                        "first": "Patrick",
                        "middle": [],
                        "last": "Simianer",
                        "suffix": ""
                    },
                    {
                        "first": "Stefan",
                        "middle": [],
                        "last": "Riezler",
                        "suffix": ""
                    }
                ],
                "year": 2014,
                "venue": "Proceedings of the International Workshop on Spoken Language Translation (IWSLT)",
                "volume": "",
                "issue": "",
                "pages": "236--243",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Sariya Karimova, Patrick Simianer, and Stefan Riezler. 2014. Offline extraction of overlapping phrases for hierarchical phrase-based translation. In Proceedings of the International Workshop on Spoken Language Translation (IWSLT), pages 236-243.",
                "links": null
            },
            "BIBREF5": {
                "ref_id": "b5",
                "title": "A new measure of rank correlation",
                "authors": [
                    {
                        "first": "M",
                        "middle": [
                            "G"
                        ],
                        "last": "Kendall",
                        "suffix": ""
                    }
                ],
                "year": 1938,
                "venue": "Biometrika",
                "volume": "30",
                "issue": "1/2",
                "pages": "81--93",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "M. G. Kendall. 1938. A new measure of rank correlation. Biometrika, 30(1/2):81-93.",
                "links": null
            },
            "BIBREF6": {
                "ref_id": "b6",
                "title": "Creating corpora for speech-to-speech translation",
                "authors": [
                    {
                        "first": "G",
                        "middle": [],
                        "last": "Kikui",
                        "suffix": ""
                    },
                    {
                        "first": "E",
                        "middle": [],
                        "last": "Sumita",
                        "suffix": ""
                    },
                    {
                        "first": "T",
                        "middle": [],
                        "last": "Takezawa",
                        "suffix": ""
                    },
                    {
                        "first": "S",
                        "middle": [],
                        "last": "Yamamoto",
                        "suffix": ""
                    }
                ],
                "year": 2003,
                "venue": "Proceedings of EUROSPEECH-03",
                "volume": "",
                "issue": "",
                "pages": "381--384",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "G. Kikui, E. Sumita, T. Takezawa, and S. Yamamoto. 2003. Creating corpora for speech-to-speech trans- lation. In Proceedings of EUROSPEECH-03, pages 381-384.",
                "links": null
            },
            "BIBREF7": {
                "ref_id": "b7",
                "title": "Edinburgh's Submission to all Tracks of the WMT2009 Shared Task with Reordering and Speed Improvements to Moses",
                "authors": [
                    {
                        "first": "Philipp",
                        "middle": [],
                        "last": "Koehn",
                        "suffix": ""
                    },
                    {
                        "first": "Barry",
                        "middle": [],
                        "last": "Haddow",
                        "suffix": ""
                    }
                ],
                "year": 2009,
                "venue": "Proceedings of the Fourth Workshop on Statistical Machine Translation",
                "volume": "",
                "issue": "",
                "pages": "160--164",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Philipp Koehn and Barry Haddow. 2009. Edinburgh's Submission to all Tracks of the WMT2009 Shared Task with Reordering and Speed Improvements to Moses. In Proceedings of the Fourth Workshop on Sta- tistical Machine Translation, pages 160-164.",
                "links": null
            },
            "BIBREF8": {
                "ref_id": "b8",
                "title": "Statistical phrase-based translation",
                "authors": [
                    {
                        "first": "Philipp",
                        "middle": [],
                        "last": "Koehn",
                        "suffix": ""
                    },
                    {
                        "first": "Franz",
                        "middle": [
                            "Josef"
                        ],
                        "last": "Och",
                        "suffix": ""
                    },
                    {
                        "first": "Daniel",
                        "middle": [],
                        "last": "Marcu",
                        "suffix": ""
                    }
                ],
                "year": 2003,
                "venue": "Proceedings of the Human Language Technology Conference",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Philipp Koehn, Franz Josef Och, , and Daniel Marcu. 2003. Statistical phrase-based translation. In In Pro- ceedings of the Human Language Technology Confer- ence, Edmonton, Canada.",
                "links": null
            },
            "BIBREF9": {
                "ref_id": "b9",
                "title": "Europarl: A parallel corpus for statistical machine translation",
                "authors": [
                    {
                        "first": "Philipp",
                        "middle": [],
                        "last": "Koehn",
                        "suffix": ""
                    }
                ],
                "year": 2005,
                "venue": "MT summit",
                "volume": "5",
                "issue": "",
                "pages": "79--86",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Philipp Koehn. 2005. Europarl: A parallel corpus for sta- tistical machine translation. In MT summit, volume 5, pages 79-86.",
                "links": null
            },
            "BIBREF10": {
                "ref_id": "b10",
                "title": "Improved statistical alignment models",
                "authors": [
                    {
                        "first": "F",
                        "middle": [
                            "J"
                        ],
                        "last": "Och",
                        "suffix": ""
                    },
                    {
                        "first": "H",
                        "middle": [],
                        "last": "Ney",
                        "suffix": ""
                    }
                ],
                "year": 2000,
                "venue": "ACL00",
                "volume": "",
                "issue": "",
                "pages": "440--447",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "F. J. Och and H. Ney. 2000. Improved statistical align- ment models. In ACL00, pages 440-447, Hong Kong, China.",
                "links": null
            },
            "BIBREF11": {
                "ref_id": "b11",
                "title": "Minimum error rate training for statistical machine translation",
                "authors": [
                    {
                        "first": "Franz",
                        "middle": [
                            "J"
                        ],
                        "last": "Och",
                        "suffix": ""
                    }
                ],
                "year": 2003,
                "venue": "Proceedings of the 41st Meeting of the Association for Computational Linguistics (ACL 2003)",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Franz J. Och. 2003. Minimum error rate training for sta- tistical machine translation. In Proceedings of the 41st Meeting of the Association for Computational Linguis- tics (ACL 2003), Sapporo, Japan.",
                "links": null
            },
            "BIBREF12": {
                "ref_id": "b12",
                "title": "Machine translation using overlapping alignments and samplerank",
                "authors": [
                    {
                        "first": "K",
                        "middle": [],
                        "last": "Papineni",
                        "suffix": ""
                    },
                    {
                        "first": "S",
                        "middle": [],
                        "last": "Roukos",
                        "suffix": ""
                    },
                    {
                        "first": "T",
                        "middle": [],
                        "last": "Ward",
                        "suffix": ""
                    },
                    {
                        "first": "W",
                        "middle": [
                            "J"
                        ],
                        "last": "Zhu",
                        "suffix": ""
                    }
                ],
                "year": 2001,
                "venue": "Proceedings of the Ninth Conference of the Association for Machine Translation in the Americas",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "K. Papineni, S. Roukos, T. Ward, and W.J. Zhu. 2001. Bleu: a Method for Automatic Evaluation of Ma- chine Translation. IBM Research Report rc22176 (w0109022), Thomas J. Watson Research Center. Benjamin Roth and Andrew McCallum. 2010. Machine translation using overlapping alignments and sampler- ank. In Proceedings of the Ninth Conference of the Association for Machine Translation in the Americas, AMTA2010.",
                "links": null
            },
            "BIBREF13": {
                "ref_id": "b13",
                "title": "SRILM -An Extensible Language Modeling Toolkit",
                "authors": [
                    {
                        "first": "Andreas",
                        "middle": [],
                        "last": "Stolcke",
                        "suffix": ""
                    }
                ],
                "year": 2002,
                "venue": "Proceedings of the International Conference on Spoken Language Processing",
                "volume": "2",
                "issue": "",
                "pages": "901--904",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Andreas Stolcke. 2002. SRILM -An Extensible Lan- guage Modeling Toolkit. In Proceedings of the Inter- national Conference on Spoken Language Processing, volume 2, pages 901-904, Denver.",
                "links": null
            },
            "BIBREF14": {
                "ref_id": "b14",
                "title": "A unigram orientation model for statistical machine translation",
                "authors": [
                    {
                        "first": "Christoph",
                        "middle": [],
                        "last": "Tillmann",
                        "suffix": ""
                    }
                ],
                "year": 2004,
                "venue": "Proceedings of HLT-NAACL 2004: Short Papers, HLT-NAACL-Short '04",
                "volume": "",
                "issue": "",
                "pages": "101--104",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Christoph Tillmann. 2004. A unigram orientation model for statistical machine translation. In Proceedings of HLT-NAACL 2004: Short Papers, HLT-NAACL-Short '04, pages 101-104, Stroudsburg, PA, USA. Associa- tion for Computational Linguistics.",
                "links": null
            },
            "BIBREF15": {
                "ref_id": "b15",
                "title": "Overlapping phrase-level translation rules in an smt engine",
                "authors": [
                    {
                        "first": "Alicia",
                        "middle": [],
                        "last": "Tribble",
                        "suffix": ""
                    }
                ],
                "year": 2003,
                "venue": "",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Alicia Tribble and et al. 2003. Overlapping phrase-level translation rules in an smt engine.",
                "links": null
            }
        },
        "ref_entries": {
            "FIGREF0": {
                "num": null,
                "text": "Figure 2: Interlocking source phrases.",
                "uris": null,
                "fig_num": "2",
                "type_str": "figure"
            },
            "FIGREF1": {
                "num": null,
                "text": "Figure 3: BLEU difference by language pair.",
                "uris": null,
                "fig_num": "3",
                "type_str": "figure"
            },
            "FIGREF2": {
                "num": null,
                "text": "Figure3shows how the gains and losses in BLEU score were distributed over the set of language pairs. Lighter cells in the figure represent gains in BLEU, the black cells represent losses. The order of the language pairs has been arranged to show the is a clear pattern. The languages on the left hand side and upper part of the figure are mostly European languages",
                "uris": null,
                "fig_num": "34",
                "type_str": "figure"
            },
            "FIGREF3": {
                "num": null,
                "text": "Figure 5: Plot of the Kendall's tau distance difference against BLEU difference.",
                "uris": null,
                "fig_num": "5",
                "type_str": "figure"
            },
            "TABREF0": {
                "content": "<table><tr><td colspan=\"6\">Src-Trg Corpus Statistics (sentences)</td><td>Baseline</td><td>Interlocking</td></tr><tr><td/><td/><td>train</td><td colspan=\"2\">develop</td><td>test</td><td>No-interlock</td><td>Source Target Src &amp; Trg</td></tr><tr><td>en-de</td><td colspan=\"2\">1500,000</td><td colspan=\"2\">3,000</td><td>3,000</td><td>18.70</td><td>21.03 18.83</td><td>18.90</td></tr><tr><td>de-en</td><td colspan=\"2\">1500,000</td><td colspan=\"2\">3,000</td><td>3,000</td><td>26.08</td><td>24.86 26.05</td><td>25.44</td></tr><tr><td>en-es</td><td colspan=\"2\">1500,000</td><td colspan=\"2\">3,000</td><td>3,000</td><td>33.55</td><td>35.44 33.68</td><td>33.89</td></tr><tr><td>es-en</td><td colspan=\"2\">1500,000</td><td colspan=\"2\">3,000</td><td>3,000</td><td>33.81</td><td>36.42 33.90</td><td>33.92</td></tr><tr><td colspan=\"2\">Kendall's Tau</td><td colspan=\"2\">Avg BLEU</td><td/><td>% Expts</td><td/></tr><tr><td>Distance</td><td/><td colspan=\"2\">Difference</td><td colspan=\"2\">Showing Gain</td><td/></tr><tr><td>[0, 1.00]</td><td/><td>0.33</td><td/><td/><td>77.3</td><td/></tr><tr><td>[0, 0.95]</td><td/><td>0.34</td><td/><td/><td>78.4</td><td/></tr><tr><td>[0, 0.90]</td><td/><td>0.38</td><td/><td/><td>80.5</td><td/></tr><tr><td>[0, 0.85]</td><td/><td>0.51</td><td/><td/><td>90.5</td><td/></tr><tr><td>[0, 0.80]</td><td/><td>0.58</td><td/><td/><td>93.5</td><td/></tr><tr><td>[0, 0.75]</td><td/><td>0.63</td><td/><td/><td>97.3</td><td/></tr><tr><td>[0, 0.70]</td><td/><td>0.68</td><td/><td/><td>97.3</td><td/></tr><tr><td>[0, 0.65]</td><td/><td>0.71</td><td/><td/><td>97.7</td><td/></tr><tr><td>[0, 0.60]</td><td/><td>0.72</td><td/><td/><td>97.2</td><td/></tr><tr><td>[0, 0.55]</td><td/><td>0.74</td><td/><td/><td>97.3</td><td/></tr><tr><td>[0, 0.50]</td><td/><td>0.75</td><td/><td/><td>100.0</td><td/></tr></table>",
                "type_str": "table",
                "text": "BLEU scores for the Europarl corpora.",
                "html": null,
                "num": null
            },
            "TABREF1": {
                "content": "<table/>",
                "type_str": "table",
                "text": "Filtering the Set of Language Pairs.",
                "html": null,
                "num": null
            }
        }
    }
}