{
    "paper_id": "P08-1082",
    "header": {
        "generated_with": "S2ORC 1.0.0",
        "date_generated": "2023-06-16T12:17:37.382809Z"
    },
    "title": "Learning to Rank Answers on Large Online QA Collections",
    "authors": [
        {
            "first": "Mihai",
            "middle": [],
            "last": "Surdeanu",
            "suffix": "",
            "affiliation": {},
            "email": "mihai.surdeanu@barcelonamedia.org"
        },
        {
            "first": "Massimiliano",
            "middle": [],
            "last": "Ciaramita",
            "suffix": "",
            "affiliation": {},
            "email": ""
        },
        {
            "first": "Hugo",
            "middle": [],
            "last": "Zaragoza",
            "suffix": "",
            "affiliation": {},
            "email": ""
        }
    ],
    "year": "",
    "venue": null,
    "identifiers": {},
    "abstract": "This work describes an answer ranking engine for non-factoid questions built using a large online community-generated question-answer collection (Yahoo! Answers). We show how such collections may be used to effectively set up large supervised learning experiments. Furthermore we investigate a wide range of feature types, some exploiting NLP processors, and demonstrate that using them in combination leads to considerable improvements in accuracy.",
    "pdf_parse": {
        "paper_id": "P08-1082",
        "_pdf_hash": "",
        "abstract": [
            {
                "text": "This work describes an answer ranking engine for non-factoid questions built using a large online community-generated question-answer collection (Yahoo! Answers). We show how such collections may be used to effectively set up large supervised learning experiments. Furthermore we investigate a wide range of feature types, some exploiting NLP processors, and demonstrate that using them in combination leads to considerable improvements in accuracy.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Abstract",
                "sec_num": null
            }
        ],
        "body_text": [
            {
                "text": "The problem of Question Answering (QA) has received considerable attention in the past few years. Nevertheless, most of the work has focused on the task of factoid QA, where questions match short answers, usually in the form of named or numerical entities. Thanks to international evaluations organized by conferences such as the Text REtrieval Conference (TREC)1 or the Cross Language Evaluation Forum (CLEF) Workshop2 , annotated corpora of questions and answers have become available for several languages, which has facilitated the development of robust machine learning models for the task.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "The situation is different once one moves beyond the task of factoid QA. Comparatively little research has focused on QA models for non-factoid questions such as causation, manner, or reason questions. Because virtually no training data is available for this problem, most automated systems train either on small hand-annotated corpora built in house (Higashinaka and Isozaki, 2008) or on question-answer pairs harvested from Frequently Asked Questions (FAQ) lists or similar resources (Soricut and Brill, 2006) . None of these situations is ideal: the cost of building the training corpus in the former setup is high; in the latter scenario the data tends to be domain-specific, hence unsuitable for the learning of open-domain models.",
                "cite_spans": [
                    {
                        "start": 351,
                        "end": 382,
                        "text": "(Higashinaka and Isozaki, 2008)",
                        "ref_id": "BIBREF16"
                    },
                    {
                        "start": 486,
                        "end": 511,
                        "text": "(Soricut and Brill, 2006)",
                        "ref_id": "BIBREF26"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "On the other hand, recent years have seen an explosion of user-generated content (or social media). Of particular interest in our context are communitydriven question-answering sites, such as Yahoo! Answers 3 , where users answer questions posed by other users and best answers are selected manually either by the asker or by all the participants in the thread. The data generated by these sites has significant advantages over other web resources: (a) it has a high growth rate and it is already abundant; (b) it covers a large number of topics, hence it offers a better approximation of open-domain content; and (c) it is available for many languages. Community QA sites, similar to FAQs, provide large number of questionanswer pairs. Nevertheless, this data has a significant drawback: it has high variance of quality, i.e., answers range from very informative to completely irrelevant or even abusive. Table 1 shows some examples of both high and low quality content.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 912,
                        "end": 913,
                        "text": "1",
                        "ref_id": "TABREF0"
                    }
                ],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "In this paper we address the problem of answer ranking for non-factoid questions from social media content. Our research objectives focus on answering the following two questions:",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "1. Is it possible to learn an answer ranking model for complex questions from such noisy data? This is an interesting question because a positive answer indicates that a plethora of training data is readily available to QA researchers and system developers. 2. Which features are most useful in this scenario? Are similarity models as effective as models that learn question-to-answer transformations? Does syntactic and semantic information help? For generality, we focus only on textual features extracted from the answer text and we ignore all meta data information that is not generally available.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "Notice that we concentrate on one component of a possible social-media QA system. In addition to answer ranking, a complete system would have to search for similar questions already answered (Jeon et al., 2005) , and rank content quality using \"social\" features such as the authority of users (Jeon et al., 2006; Agichtein et al., 2008) . This is not the focus of our work: here we investigate the problem of learning an answer ranking model capable of dealing with complex questions, using a large number of, possible noisy, question-answer pairs. By focusing exclusively on textual content we increase the portability of our approach to other collections where \"social\" features might not available, e.g., Web search. The paper is organized as follows. We describe our approach, including all the features explored for answer modeling, in Section 2. We introduce the corpus used in our empirical analysis in Section 3. We detail our experiments and analyze the results in Section 4. We overview related work in Section 5 and conclude the paper in Section 6. ",
                "cite_spans": [
                    {
                        "start": 191,
                        "end": 210,
                        "text": "(Jeon et al., 2005)",
                        "ref_id": "BIBREF17"
                    },
                    {
                        "start": 293,
                        "end": 312,
                        "text": "(Jeon et al., 2006;",
                        "ref_id": "BIBREF18"
                    },
                    {
                        "start": 313,
                        "end": 336,
                        "text": "Agichtein et al., 2008)",
                        "ref_id": "BIBREF1"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "The architecture of the QA system analyzed in the paper, summarized in Figure 1 , follows that of the most successful TREC systems. The first component, answer retrieval, extracts a set of candidate answers A for question Q from a large collection of answers, C, provided by a communitygenerated question-answering site. The retrieval component uses a state-of-the-art information retrieval (IR) model to extract A given Q. Since our focus is on exploring the usability of the answer content, we do not perform retrieval by finding similar questions already answered (Jeon et al., 2005) , i.e., our answer collection C contains only the site's answers without the corresponding questions answered.",
                "cite_spans": [
                    {
                        "start": 567,
                        "end": 586,
                        "text": "(Jeon et al., 2005)",
                        "ref_id": "BIBREF17"
                    }
                ],
                "ref_spans": [
                    {
                        "start": 78,
                        "end": 79,
                        "text": "1",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "Approach",
                "sec_num": "2"
            },
            {
                "text": "The second component, answer ranking, assigns to each answer A i ∈ A a score that represents the likelihood that A i is a correct answer for Q, and ranks all answers in descending order of these scores. The scoring function is a linear combination of four different classes of features (detailed in Section 2.2). This function is the focus of the paper. To answer our first research objective we will compare the quality of the rankings provided by this component against the rankings generated by the IR model used for answer retrieval. To answer the second research objective we will analyze the contribution of the proposed feature set to this function. Again, since our interest is in investigating the utility of the answer textual content, we use only information extracted from the answer text when learning the scoring function. We do not use any meta information (e.g., answerer credibility, click counts, etc.) (Agichtein et al., 2008; Jeon et al., 2006) .",
                "cite_spans": [
                    {
                        "start": 921,
                        "end": 945,
                        "text": "(Agichtein et al., 2008;",
                        "ref_id": "BIBREF1"
                    },
                    {
                        "start": 946,
                        "end": 964,
                        "text": "Jeon et al., 2006)",
                        "ref_id": "BIBREF18"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Approach",
                "sec_num": "2"
            },
            {
                "text": "Our QA approach combines three types of machine learning methodologies (as highlighted in Figure 1 ): the answer retrieval component uses un-supervised IR models, the answer ranking is implemented using discriminative learning, and finally, some of the ranking features are produced by question-to-answer translation models, which use class-conditional learning.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 97,
                        "end": 98,
                        "text": "1",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "Approach",
                "sec_num": "2"
            },
            {
                "text": "Learning with user-generated content can involve arbitrarily large amounts of data. For this reason we choose as a ranking algorithm the Perceptron which is both accurate and efficient and can be trained with online protocols. Specifically, we implement the ranking Perceptron proposed by Shen and Joshi (2005) , which reduces the ranking problem to a binary classification problem. The general intuition is to exploit the pairwise preferences induced from the data by training on pairs of patterns, rather than independently on each pattern. Given a weight vector α, the score for a pattern x (a candidate answer) is simply the inner product between the pattern and the weight vector:",
                "cite_spans": [
                    {
                        "start": 289,
                        "end": 310,
                        "text": "Shen and Joshi (2005)",
                        "ref_id": "BIBREF27"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Ranking Model",
                "sec_num": "2.1"
            },
            {
                "text": "EQUATION",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [
                    {
                        "start": 0,
                        "end": 8,
                        "text": "EQUATION",
                        "ref_id": "EQREF",
                        "raw_str": "f α (x) = x, α",
                        "eq_num": "(1)"
                    }
                ],
                "section": "Ranking Model",
                "sec_num": "2.1"
            },
            {
                "text": "However, the error function depends on pairwise scores. In training, for each pair",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Ranking Model",
                "sec_num": "2.1"
            },
            {
                "text": "(x i , x j ) ∈ A, the score f α (x i -x j ) is computed; note that if f is an inner product f α (x i -x j ) = f α (x i ) -f α (x j ).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Ranking Model",
                "sec_num": "2.1"
            },
            {
                "text": "Given a margin function g(i, j) and a positive rate τ , if f α (x i -x j ) ≤ g(i, j)τ , an update is performed:",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Ranking Model",
                "sec_num": "2.1"
            },
            {
                "text": "α t+1 = α t + (x i -x j )τ g(i, j) (2)",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Ranking Model",
                "sec_num": "2.1"
            },
            {
                "text": "By default we use g(i, j) = ( 1 i -1 j ), as a margin function, as suggested in (Shen and Joshi, 2005) , and find τ empirically on development data. Given that there are only two possible ranks in our setting, this function only generates two possible values. For regularization purposes, we use as a final model the average of all Perceptron models posited during training (Freund and Schapire, 1999) .",
                "cite_spans": [
                    {
                        "start": 80,
                        "end": 102,
                        "text": "(Shen and Joshi, 2005)",
                        "ref_id": "BIBREF27"
                    },
                    {
                        "start": 374,
                        "end": 401,
                        "text": "(Freund and Schapire, 1999)",
                        "ref_id": "BIBREF13"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Ranking Model",
                "sec_num": "2.1"
            },
            {
                "text": "In the scoring model we explore a rich set of features inspired by several state-of-the-art QA systems. We investigate how such features can be adapted and combined for non-factoid answer ranking, and perform a comparative feature analysis using a significant amount of real-world data. For clarity, we group the features into four sets: features that model the similarity between questions and answers (FG1), features that encode question-to-answer transformations using a translation model (FG2), features that measure keyword density and frequency (FG3), and features that measure the correlation between question-answer pairs and other collections (FG4). Wherever applicable, we explore different syntactic and semantic representations of the textual content, e.g., extracting the dependency-based representation of the text or generalizing words to their WordNet supersenses (WNSS) (Ciaramita and Altun, 2006) . We detail each of these feature groups next.",
                "cite_spans": [
                    {
                        "start": 887,
                        "end": 914,
                        "text": "(Ciaramita and Altun, 2006)",
                        "ref_id": "BIBREF7"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Features",
                "sec_num": "2.2"
            },
            {
                "text": "We measure the similarity between a question Q and an answer A using the length-normalized BM 25 formula (Robertson and Walker, 1997) . We chose this similarity formula because, out of all the IR models we tried, it provided the best ranking at the output of the answer retrieval component. For completeness we also include in the feature set the value of the tf •idf similarity measure. For both formulas we use the implementations available in the Terrier IR platform4 with the default parameters.",
                "cite_spans": [
                    {
                        "start": 105,
                        "end": 133,
                        "text": "(Robertson and Walker, 1997)",
                        "ref_id": "BIBREF25"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "FG1: Similarity Features",
                "sec_num": null
            },
            {
                "text": "To understand the contribution of our syntactic and semantic processors we compute the above similarity features for five different representations of the question and answer content: Words (W) -this is the traditional IR view where the text is seen as a bag of words.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "FG1: Similarity Features",
                "sec_num": null
            },
            {
                "text": "-the text is represented as a bag of binary syntactic dependencies. The relative syntactic processor is detailed in Section 3. Dependencies are fully lexicalized but unlabeled and we currently extract dependency paths of length 1, i.e., direct head-modifier relations (this setup achieved the best performance).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Dependencies (D)",
                "sec_num": null
            },
            {
                "text": "Generalized dependencies (D g ) -same as above, but the words in dependencies are generalized to their WNSS, if detected.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Dependencies (D)",
                "sec_num": null
            },
            {
                "text": "-the text is represented as a bag of bigrams (larger n-grams did not help). We added this view for a fair analysis of the above syntactic views.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Bigrams (B)",
                "sec_num": null
            },
            {
                "text": "Generalized bigrams (B g ) -same as above, but the words are generalized to their WNSS.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Bigrams (B)",
                "sec_num": null
            },
            {
                "text": "In all these representations we skip stop words and normalize all words to their WordNet lemmas.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Bigrams (B)",
                "sec_num": null
            },
            {
                "text": "Berger et al. (2000) showed that similarity-based models are doomed to perform poorly for QA because they fail to \"bridge the lexical chasm\" between questions and answers. One way to address this problem is to learn question-to-answer transformations using a translation model (Berger et al., 2000; Echihabi and Marcu, 2003; Soricut and Brill, 2006; Riezler et al., 2007) . In our model, we incorporate this approach by adding the probability that the question Q is a translation of the answer A, P (Q|A), as a feature. This probability is computed using IBM's Model 1 (Brown et al., 1993) :",
                "cite_spans": [
                    {
                        "start": 14,
                        "end": 20,
                        "text": "(2000)",
                        "ref_id": null
                    },
                    {
                        "start": 277,
                        "end": 298,
                        "text": "(Berger et al., 2000;",
                        "ref_id": "BIBREF3"
                    },
                    {
                        "start": 299,
                        "end": 324,
                        "text": "Echihabi and Marcu, 2003;",
                        "ref_id": "BIBREF12"
                    },
                    {
                        "start": 325,
                        "end": 349,
                        "text": "Soricut and Brill, 2006;",
                        "ref_id": "BIBREF26"
                    },
                    {
                        "start": 350,
                        "end": 371,
                        "text": "Riezler et al., 2007)",
                        "ref_id": "BIBREF28"
                    },
                    {
                        "start": 569,
                        "end": 589,
                        "text": "(Brown et al., 1993)",
                        "ref_id": "BIBREF6"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "FG2: Translation Features",
                "sec_num": null
            },
            {
                "text": "P (Q|A) = q∈Q P (q|A)",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "FG2: Translation Features",
                "sec_num": null
            },
            {
                "text": "(3)",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "FG2: Translation Features",
                "sec_num": null
            },
            {
                "text": "EQUATION",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [
                    {
                        "start": 0,
                        "end": 8,
                        "text": "EQUATION",
                        "ref_id": "EQREF",
                        "raw_str": "P (q|A) = (1 -λ)P ml (q|A) + λP ml (q|C) (4) P ml (q|A) = a∈A (T (q|a)P ml (a|A))",
                        "eq_num": "(5)"
                    }
                ],
                "section": "FG2: Translation Features",
                "sec_num": null
            },
            {
                "text": "where the probability that the question term q is generated from answer A, P (q|A), is smoothed using the prior probability that the term q is generated from the entire collection of answers C, P ml (q|C). λ is the smoothing parameter. P ml (q|C) is computed using the maximum likelihood estimator. P ml (q|A) is computed as the sum of the probabilities that the question term q is a translation of an answer term a, T (q|a), weighted by the probability that a is generated from A. The translation table for T (q|a) is computed using the EM-based algorithm implemented in the GIZA++ toolkit5 . Similarly with the previous feature group, we add translation-based features for the five different text representations introduced above. By moving beyond the bag-of-word representation we hope to learn relevant transformations of structures, e.g., from the \"squeaky\" → \"door\" dependency to \"spray\" ← \"WD-40\" in the Table 1 example.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 917,
                        "end": 918,
                        "text": "1",
                        "ref_id": "TABREF0"
                    }
                ],
                "eq_spans": [],
                "section": "FG2: Translation Features",
                "sec_num": null
            },
            {
                "text": "These features measure the density and frequency of question terms in the answer text. Variants of these features were used previously for either answer or passage ranking in factoid QA (Moldovan et al., 1999; Harabagiu et al., 2000) .",
                "cite_spans": [
                    {
                        "start": 186,
                        "end": 209,
                        "text": "(Moldovan et al., 1999;",
                        "ref_id": "BIBREF23"
                    },
                    {
                        "start": 210,
                        "end": 233,
                        "text": "Harabagiu et al., 2000)",
                        "ref_id": "BIBREF15"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "FG3: Density and Frequency Features",
                "sec_num": null
            },
            {
                "text": "Same word sequence -computes the number of nonstop question words that are recognized in the same order in the answer.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "FG3: Density and Frequency Features",
                "sec_num": null
            },
            {
                "text": "Answer span -the largest distance (in words) between two non-stop question words in the answer.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "FG3: Density and Frequency Features",
                "sec_num": null
            },
            {
                "text": "Same sentence match -number of non-stop question terms matched in a single sentence in the answer.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "FG3: Density and Frequency Features",
                "sec_num": null
            },
            {
                "text": "Overall match -number of non-stop question terms matched in the complete answer. These last two features are computed also for the other four text representations previously introduced (B, B g , D, and D g ). Counting the number of matched dependencies is essentially a simplified tree kernel for QA (e.g., see (Moschitti et al., 2007) ) matching only trees of depth 2. Experiments with full dependency tree kernels based on several variants of the convolution kernels of Collins and Duffy (2001) did not yield improvements. We conjecture that the mistakes of the syntactic parser may be amplified in tree kernels, which consider an exponential number of sub-trees.",
                "cite_spans": [
                    {
                        "start": 311,
                        "end": 335,
                        "text": "(Moschitti et al., 2007)",
                        "ref_id": "BIBREF24"
                    },
                    {
                        "start": 472,
                        "end": 496,
                        "text": "Collins and Duffy (2001)",
                        "ref_id": "BIBREF9"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "FG3: Density and Frequency Features",
                "sec_num": null
            },
            {
                "text": "Informativeness -we model the amount of information contained in the answer by counting the number of non-stop nouns, verbs, and adjectives in the answer text that do not appear in the question.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "FG3: Density and Frequency Features",
                "sec_num": null
            },
            {
                "text": "Previous work has shown that the redundancy of a large collection (e.g., the web) can be used for answer validation (Brill et al., 2001; Magnini et al., 2002) . In the same spirit, we add features that measure the correlation between question-answer pairs and large external collections:",
                "cite_spans": [
                    {
                        "start": 116,
                        "end": 136,
                        "text": "(Brill et al., 2001;",
                        "ref_id": "BIBREF5"
                    },
                    {
                        "start": 137,
                        "end": 158,
                        "text": "Magnini et al., 2002)",
                        "ref_id": "BIBREF21"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "FG4: Web Correlation Features",
                "sec_num": null
            },
            {
                "text": "Web correlation -we measure the correlation between the question-answer pair and the web using the Corrected Conditional Probability (CCP) formula of Magnini et al. (2002) :",
                "cite_spans": [
                    {
                        "start": 150,
                        "end": 171,
                        "text": "Magnini et al. (2002)",
                        "ref_id": "BIBREF21"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "FG4: Web Correlation Features",
                "sec_num": null
            },
            {
                "text": "CCP (Q, A) = hits(Q + A)/(hits(Q) hits(A) 2/3",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "FG4: Web Correlation Features",
                "sec_num": null
            },
            {
                "text": ") where hits returns the number of page hits from a search engine. When a query returns zero hits we iteratively relax it by dropping the keyword with the smallest priority. Keyword priorities are assigned using the heuristics of Moldovan et al. (1999) .",
                "cite_spans": [
                    {
                        "start": 230,
                        "end": 252,
                        "text": "Moldovan et al. (1999)",
                        "ref_id": "BIBREF23"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "FG4: Web Correlation Features",
                "sec_num": null
            },
            {
                "text": "Query-log correlation -as in (Ciaramita et al., 2008) we also compute the correlation between questionanswer pairs and a search-engine query-log corpus of more than 7.5 million queries, which shares roughly the same time stamp with the communitygenerated question-answer corpus. We compute the Pointwise Mutual Information (PMI) and Chi square (χ 2 ) association measures between each questionanswer word pair in the query-log corpus. The largest and the average values are included as features, as well as the number of QA word pairs which appear in the top 10, 5, and 1 percentile of the PMI and χ 2 word pair rankings.",
                "cite_spans": [
                    {
                        "start": 29,
                        "end": 53,
                        "text": "(Ciaramita et al., 2008)",
                        "ref_id": "BIBREF8"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "FG4: Web Correlation Features",
                "sec_num": null
            },
            {
                "text": "The corpus is extracted from a sample of the U.S. Yahoo! Answers logs. In this paper we focus on the subset of advice or \"how to\" questions due to their frequency and importance in social communities. 6 To construct our corpus, we implemented the following successive filtering steps:",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "The Corpus",
                "sec_num": "3"
            },
            {
                "text": "Step 1: from the full corpus we keep only questions that match the regular expression:",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "The Corpus",
                "sec_num": "3"
            },
            {
                "text": "how (to|do|did|does|can|would|could|should)",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "The Corpus",
                "sec_num": "3"
            },
            {
                "text": "and have an answer selected as best either by the asker or by the participants in the thread. The outcome of this step is a set of 364,419 question-answer pairs. Step 2: from the above corpus we remove the questions and answers of obvious low quality. We implement this filter with a simple heuristic by keeping only questions and answers that have at least 4 words each, out of which at least 1 is a noun and at least 1 is a verb. This step filters out questions like \"How to be excellent?\" and answers such as \"I don't know\". The outcome of this step forms our answer collection C. C contains 142,627 question-answer pairs.7 . Arguably, all these filters could be improved. For example, the first step can be replaced by a question classifier (Li and Roth, 2005) . Similarly, the second step can be implemented with a statistical classifier that ranks the quality of the content using both the textual and non-textual information available in the database (Jeon et al., 2006; Agichtein et al., 2008) . We plan to further investigate these issues which are not the main object of this work.",
                "cite_spans": [
                    {
                        "start": 745,
                        "end": 764,
                        "text": "(Li and Roth, 2005)",
                        "ref_id": "BIBREF20"
                    },
                    {
                        "start": 958,
                        "end": 977,
                        "text": "(Jeon et al., 2006;",
                        "ref_id": "BIBREF18"
                    },
                    {
                        "start": 978,
                        "end": 1001,
                        "text": "Agichtein et al., 2008)",
                        "ref_id": "BIBREF1"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "The Corpus",
                "sec_num": "3"
            },
            {
                "text": "The data was processed as follows. The text was split at the sentence level, tokenized and PoS tagged, in the style of the Wall Street Journal Penn Tree-Bank (Marcus et al., 1993) . Each word was morphologically simplified using the morphological functions of the WordNet library8 . Sentences were annotated with WNSS categories, using the tagger of Ciaramita and Altun (2006) 9 , which annotates text with a 46-label tagset. These tags, defined by Word-Net lexicographers, provide a broad semantic categorization for nouns and verbs and include labels for nouns such as food, animal, body and feeling, and for verbs labels such as communication, contact, and possession. Next, we parsed all sentences with the dependency parser of Attardi et al. (2007) 10 . It is important to realize that the output of all mentioned processing steps is noisy and contains plenty of mistakes, since the data has huge variability in terms of quality, style, genres, domains etc., and domain adaptation for the NLP tasks involved is still an open problem (Dredze et al., 2007) .",
                "cite_spans": [
                    {
                        "start": 158,
                        "end": 179,
                        "text": "(Marcus et al., 1993)",
                        "ref_id": "BIBREF22"
                    },
                    {
                        "start": 350,
                        "end": 376,
                        "text": "Ciaramita and Altun (2006)",
                        "ref_id": "BIBREF7"
                    },
                    {
                        "start": 732,
                        "end": 753,
                        "text": "Attardi et al. (2007)",
                        "ref_id": "BIBREF0"
                    },
                    {
                        "start": 1038,
                        "end": 1059,
                        "text": "(Dredze et al., 2007)",
                        "ref_id": "BIBREF11"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "The Corpus",
                "sec_num": "3"
            },
            {
                "text": "We used 60% of the questions for training, 20% for development, and 20% for test. The candidate answer set for a given question is composed by one positive example, i.e., its corresponding best answer, and as negative examples all the other answers retrieved in the top N by the retrieval component.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "The Corpus",
                "sec_num": "3"
            },
            {
                "text": "We evaluate our results using two measures: mean Precision at rank=1 (P@1) -i.e., the percentage of questions with the correct answer on the first position -and Mean Reciprocal Rank (MRR) -i.e., the score of a question is 1/k, where k is the position of the correct answer. We use as baseline the output of our answer retrieval component (Figure 1 ). This component uses the BM25 criterion, the highest performing IR model in our experiments.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 346,
                        "end": 347,
                        "text": "1",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "Experiments",
                "sec_num": "4"
            },
            {
                "text": "Table 2 lists the results obtained using this baseline and our best model (\"Ranking\" in the table) on the testing partition. Since we are interested in the performance of the ranking model, we evaluate on the subset of questions where the correct answer is retrieved by answer retrieval in the top N answers (similar to Ko et al. (2007) ). In the results for several N values. For completeness, we show the percentage of questions that match this criterion in the \"recall@N\" row.",
                "cite_spans": [
                    {
                        "start": 320,
                        "end": 336,
                        "text": "Ko et al. (2007)",
                        "ref_id": "BIBREF19"
                    }
                ],
                "ref_spans": [
                    {
                        "start": 6,
                        "end": 7,
                        "text": "2",
                        "ref_id": "TABREF3"
                    }
                ],
                "eq_spans": [],
                "section": "Experiments",
                "sec_num": "4"
            },
            {
                "text": "Our ranking model was tuned strictly on the development set (i.e., feature selection and parameters of the translation models). During training, the presentation of the training instances is randomized, which generates a randomized ranking algorithm. We exploit this property to estimate the variance in the results produced by each model and report the average result over 10 trials together with an estimate of the standard deviation.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Experiments",
                "sec_num": "4"
            },
            {
                "text": "The baseline result shows that, for N = 15, BM25 alone can retrieve in first rank 41% of the correct answers, and MRR tells us that the correct answer is often found within the first three answers (this is not so surprising if we remember that in this configuration only questions with the correct answer in the first 15 were kept for the experiment). The baseline results are interesting because they indicate that the problem is not hopelessly hard, but it is far from trivial. In principle, we see much room for improvement over bag-of-word methods.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Experiments",
                "sec_num": "4"
            },
            {
                "text": "Next we see that learning a weighted combination of features yields consistently marked improvements: for example, for N = 15, the best model yields a 19% relative improvement in P@1 and 14% in MRR. More importantly, the results indicate that the model learned is stable: even though for the model analyzed in Table 2 we used N = 15 in training, we measure approximately the same relative improvement as N increases during evaluation.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 316,
                        "end": 317,
                        "text": "2",
                        "ref_id": "TABREF3"
                    }
                ],
                "eq_spans": [],
                "section": "Experiments",
                "sec_num": "4"
            },
            {
                "text": "These results provide robust evidence that: (a) we can use publicly available online QA collections to investigate features for answer ranking without the need for costly human evaluation, (b) we can exploit large and noisy online QA collections to improve the accuracy of answer ranking systems and (c) readily available and scalable NLP technology can be used to improve lexical matching and translation models.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Experiments",
                "sec_num": "4"
            },
            {
                "text": "In the remaining of this section we analyze the performance of the different features.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Experiments",
                "sec_num": "4"
            },
            {
                "text": "Table 3 summarizes the outcome of our automatic greedy feature selection process on the development set. Where applicable, we show within parentheses the text representation for the corresponding feature. The process is initialized with a single feature that replicates the baseline model (BM25 applied to the bag-of-words (W) representation). The algorithm incrementally adds to the feature set the feature that provides the highest MRR improvement in the development partition. The process stops when no features yield any improvement. The table shows that, while the features selected span all the four feature groups introduced, the lion's share is taken by the translation features: approximately 60% of the MRR improvement is achieved by these features. The frequency/density features are responsible for approximately 23% of the improvement. The rest is due to the query-log correlation features. This indicates that, even though translation models are the most useful, it is worth exploring approaches that combine several strategies for answer ranking.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 6,
                        "end": 7,
                        "text": "3",
                        "ref_id": "TABREF4"
                    }
                ],
                "eq_spans": [],
                "section": "Experiments",
                "sec_num": "4"
            },
            {
                "text": "Note that if some features do not appear in Table 3 it does not necessarily mean that they are useless. In some cases such features are highly correlated with features previously selected, which already exploited their signal. For example, most similarity features (FG1) are correlated. Because BM25(W) is part of the baseline model, the selection process chooses another FG1 feature only much later (iteration 9) when the model is significantly changed. On the other hand, some features do not provide a useful signal at all. A notable example in this class is the web-based CCP feature, which was designed originally for factoid answer validation and does not adapt well to our problem. Because the length of non-factoid answers is typically significantly larger than in the factoid QA task, we have to discard a large part of the query when computing hits(Q+A) to reach non-zero counts. This means that the final hit counts, hence the CCP value, are generally uncorrelated with the original (Q,A) tuple.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 50,
                        "end": 51,
                        "text": "3",
                        "ref_id": "TABREF4"
                    }
                ],
                "eq_spans": [],
                "section": "Experiments",
                "sec_num": "4"
            },
            {
                "text": "One interesting observation is that the first two features chosen by our model selection process use information from the NLP processors. The first chosen feature is the translation probability computed between the B g question and answer representations (bigrams with words generalized to their WNSS tags). The second feature selected measures the number of syntactic dependencies from the question that are matched in the answer. These results provide empirical evidence that coarse semantic disambiguation and syntactic parsing have a positive contribution to non-factoid QA, even in broad-coverage noisy settings based on Web data.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Experiments",
                "sec_num": "4"
            },
            {
                "text": "The above observation deserves a more detailed analysis. Table 4 shows the performance of our first three feature groups when they are applied to each of the five text representations or incremental combinations of representations. For each model corresponding to a table cell we use only the features from the corresponding feature group and representation to avoid the correlation with features from other groups. We generate each best model using the same feature selection process described above.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 63,
                        "end": 64,
                        "text": "4",
                        "ref_id": "TABREF5"
                    }
                ],
                "eq_spans": [],
                "section": "Experiments",
                "sec_num": "4"
            },
            {
                "text": "The left part of Table 4 shows that, generally, the models using representations that include the output of our NLP processors (B g , D and D g ) improve over the baseline (FG1 and W).11 However, comparable improvements can be obtained with the simpler bigram representation (B). This indicates that, in terms of individual contributions, our NLP processors can be approximated with simpler n-gram models in this task. Hence, is it fair to say that syntactic and semantic analysis is useful for such Web QA tasks? While the above analysis seems to suggest a negative answer, the right-hand side of Table 4 tells a more interesting story. It shows that the NLP analysis provides complementary information to the ngram-based models. The best models for the FG2 and FG3 feature groups are obtained when combining the n-gram representations with the representations that use the output of the NLP processors (W + B + B g + D). The improvements are relatively small, but remarkable (e.g., see FG2) if we take into account the significant scale of the evaluation. This observation correlates well with the analysis shown in Table 3 , which shows that features using semantic (B g ) and syntactic (D) representations contribute the most on top of the IR model (BM25(W)).",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 23,
                        "end": 24,
                        "text": "4",
                        "ref_id": "TABREF5"
                    },
                    {
                        "start": 604,
                        "end": 605,
                        "text": "4",
                        "ref_id": "TABREF5"
                    },
                    {
                        "start": 1124,
                        "end": 1125,
                        "text": "3",
                        "ref_id": "TABREF4"
                    }
                ],
                "eq_spans": [],
                "section": "Experiments",
                "sec_num": "4"
            },
            {
                "text": "Content from community-built question-answer sites can be retrieved by searching for similar questions already answered (Jeon et al., 2005) and ranked using meta-data information like answerer authority (Jeon et al., 2006; Agichtein et al., 2008) . Here we show that the answer text can be successfully used to improve answer ranking quality. Our method is complementary to the above approaches. In fact, it is likely that an optimal retrieval engine from social media should combine all these three methodologies. Moreover, our approach might have applications outside of social media (e.g., for opendomain web-based QA), because the ranking model built is based only on open-domain knowledge and the analysis of textual content.",
                "cite_spans": [
                    {
                        "start": 120,
                        "end": 139,
                        "text": "(Jeon et al., 2005)",
                        "ref_id": "BIBREF17"
                    },
                    {
                        "start": 203,
                        "end": 222,
                        "text": "(Jeon et al., 2006;",
                        "ref_id": "BIBREF18"
                    },
                    {
                        "start": 223,
                        "end": 246,
                        "text": "Agichtein et al., 2008)",
                        "ref_id": "BIBREF1"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Related Work",
                "sec_num": "5"
            },
            {
                "text": "In the QA literature, answer ranking for nonfactoid questions has typically been performed by learning question-to-answer transformations, either using translation models (Berger et al., 2000; Soricut and Brill, 2006) or by exploiting the redundancy of the Web (Agichtein et al., 2001) . Girju (2003) extracts non-factoid answers by searching for certain semantic structures, e.g., causation relations as answers to causation questions. In this paper we combine several methodologies, including the above, into a single model. This approach allowed us to perform a systematic feature analysis on a large-scale real-world corpus and a comprehensive feature set.",
                "cite_spans": [
                    {
                        "start": 171,
                        "end": 192,
                        "text": "(Berger et al., 2000;",
                        "ref_id": "BIBREF3"
                    },
                    {
                        "start": 193,
                        "end": 217,
                        "text": "Soricut and Brill, 2006)",
                        "ref_id": "BIBREF26"
                    },
                    {
                        "start": 261,
                        "end": 285,
                        "text": "(Agichtein et al., 2001)",
                        "ref_id": "BIBREF2"
                    },
                    {
                        "start": 288,
                        "end": 300,
                        "text": "Girju (2003)",
                        "ref_id": "BIBREF14"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Related Work",
                "sec_num": "5"
            },
            {
                "text": "Recent work has showed that structured retrieval improves answer ranking for factoid questions: Bilotti et al. (2007) showed that matching predicateargument frames constructed from the question and the expected answer types improves answer ranking. Cui et al. (2005) learned transformations of dependency paths from questions to answers to improve passage ranking. However, both approaches use similarity models at their core because they require the matching of the lexical elements in the search structures. On the other hand, our approach allows the learning of full transformations from question structures to answer structures using translation models applied to different text representations.",
                "cite_spans": [
                    {
                        "start": 96,
                        "end": 117,
                        "text": "Bilotti et al. (2007)",
                        "ref_id": "BIBREF4"
                    },
                    {
                        "start": 249,
                        "end": 266,
                        "text": "Cui et al. (2005)",
                        "ref_id": "BIBREF10"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Related Work",
                "sec_num": "5"
            },
            {
                "text": "Our answer ranking framework is closest in spirit to the system of Ko et al. (2007) or Higashinaka et al. (2008) . However, the former was applied only to factoid QA and both are limited to similarity, re-dundancy and gazetteer-based features. Our model uses a larger feature set that includes correlation and transformation-based features and five different content representations. Our evaluation is also carried out on a larger scale. Our work is also related to that of Riezler et al. (2007) where SMT-based query expansion methods are used on data from FAQ pages.",
                "cite_spans": [
                    {
                        "start": 67,
                        "end": 83,
                        "text": "Ko et al. (2007)",
                        "ref_id": "BIBREF19"
                    },
                    {
                        "start": 87,
                        "end": 112,
                        "text": "Higashinaka et al. (2008)",
                        "ref_id": "BIBREF16"
                    },
                    {
                        "start": 474,
                        "end": 495,
                        "text": "Riezler et al. (2007)",
                        "ref_id": "BIBREF28"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Related Work",
                "sec_num": "5"
            },
            {
                "text": "In this work we described an answer ranking engine for non-factoid questions built using a large community-generated question-answer collection. On one hand, this study shows that we can effectively exploit large amounts of available Web data to do research on NLP for non-factoid QA systems, without any annotation or evaluation cost. This provides an excellent framework for large-scale experimentation with various models that otherwise might be hard to understand or evaluate. On the other hand, we expect the outcome of this process to help several applications, such as open-domain QA on the Web and retrieval from social media. For example, on the Web our ranking system could be combined with a passage retrieval system to form a QA system for complex questions. On social media, our system should be combined with a component that searches for similar questions already answered; this output can possibly be filtered further by a content-quality module that explores \"social\" features such as the authority of users, etc.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Conclusions",
                "sec_num": "6"
            },
            {
                "text": "We show that the best ranking performance is obtained when several strategies are combined into a single model. We obtain the best results when similarity models are aggregated with features that model question-to-answer transformations, frequency and density of content, and correlation of QA pairs with external collections. While the features that model question-to-answer transformations provide most benefits, we show that the combination is crucial for improvement.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Conclusions",
                "sec_num": "6"
            },
            {
                "text": "Lastly, we show that syntactic dependency parsing and coarse semantic disambiguation yield a small, yet statistically significant performance increase on top of the traditional bag-of-words and n-gram representation. We obtain these results using only off-the-shelf NLP processors that were not adapted in any way for our task.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Conclusions",
                "sec_num": "6"
            },
            {
                "text": "http://trec.nist.gov",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            },
            {
                "text": "http://www.clef-campaign.org",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            },
            {
                "text": "http://answers.yahoo.com",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            },
            {
                "text": "http://ir.dcs.gla.ac.uk/terrier",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            },
            {
                "text": "http://www.fjoch.com/GIZA++.html",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            },
            {
                "text": "Nevertheless, the approach proposed here is independent of the question type. We will explore answer ranking for other non-factoid question types in future work.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            },
            {
                "text": "The data will be available through the Yahoo! Webscope program (research-data-requests@yahoo-inc.com).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            },
            {
                "text": "http://wordnet.princeton.edu",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            },
            {
                "text": "sourceforge.net/projects/supersensetag",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            },
            {
                "text": "http://sourceforge.net/projects/desr",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            },
            {
                "text": "The exception to this rule are the models FG1(Bg) and FG1(D g ). This is caused by the fact that the BM25 formula is less forgiving with errors of the NLP processors (due to the high idf scores assigned to bigrams and dependencies), and the WNSS tagger is the least robust component in our pipeline.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            }
        ],
        "back_matter": [],
        "bib_entries": {
            "BIBREF0": {
                "ref_id": "b0",
                "title": "Multilingual Dependency Parsing and Domain Adaptation using DeSR",
                "authors": [
                    {
                        "first": "G",
                        "middle": [],
                        "last": "Attardi",
                        "suffix": ""
                    },
                    {
                        "first": "F",
                        "middle": [],
                        "last": "Dell'orletta",
                        "suffix": ""
                    },
                    {
                        "first": "M",
                        "middle": [],
                        "last": "Simi",
                        "suffix": ""
                    },
                    {
                        "first": "A",
                        "middle": [],
                        "last": "Chanev",
                        "suffix": ""
                    },
                    {
                        "first": "M",
                        "middle": [],
                        "last": "Ciaramita",
                        "suffix": ""
                    }
                ],
                "year": 2007,
                "venue": "Proc. of CoNLL Shared Task Session of EMNLP-CoNLL",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "G. Attardi, F. Dell'Orletta, M. Simi, A. Chanev and M. Ciaramita. 2007. Multilingual Dependency Pars- ing and Domain Adaptation using DeSR. Proc. of CoNLL Shared Task Session of EMNLP-CoNLL 2007.",
                "links": null
            },
            "BIBREF1": {
                "ref_id": "b1",
                "title": "Finding High-Quality Content in Social Media, with an Application to Community-based Question Answering",
                "authors": [
                    {
                        "first": "E",
                        "middle": [],
                        "last": "Agichtein",
                        "suffix": ""
                    },
                    {
                        "first": "C",
                        "middle": [],
                        "last": "Castillo",
                        "suffix": ""
                    },
                    {
                        "first": "D",
                        "middle": [],
                        "last": "Donato",
                        "suffix": ""
                    },
                    {
                        "first": "A",
                        "middle": [],
                        "last": "Gionis",
                        "suffix": ""
                    },
                    {
                        "first": "G",
                        "middle": [],
                        "last": "Mishne",
                        "suffix": ""
                    }
                ],
                "year": 2008,
                "venue": "Proc. of WSDM",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "E. Agichtein, C. Castillo, D. Donato, A. Gionis, and G. Mishne. 2008. Finding High-Quality Content in So- cial Media, with an Application to Community-based Question Answering. Proc. of WSDM.",
                "links": null
            },
            "BIBREF2": {
                "ref_id": "b2",
                "title": "Learning Search Engine Specific Query Transformations for Question Answering",
                "authors": [
                    {
                        "first": "E",
                        "middle": [],
                        "last": "Agichtein",
                        "suffix": ""
                    },
                    {
                        "first": "S",
                        "middle": [],
                        "last": "Lawrence",
                        "suffix": ""
                    },
                    {
                        "first": "L",
                        "middle": [],
                        "last": "Gravano",
                        "suffix": ""
                    }
                ],
                "year": 2001,
                "venue": "Proc. of WWW",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "E. Agichtein, S. Lawrence, and L. Gravano. 2001. Learning Search Engine Specific Query Transforma- tions for Question Answering. Proc. of WWW.",
                "links": null
            },
            "BIBREF3": {
                "ref_id": "b3",
                "title": "Bridging the Lexical Chasm: Statistical Approaches to Answer Finding. Proc. of SIGIR",
                "authors": [
                    {
                        "first": "A",
                        "middle": [],
                        "last": "Berger",
                        "suffix": ""
                    },
                    {
                        "first": "R",
                        "middle": [],
                        "last": "Caruana",
                        "suffix": ""
                    },
                    {
                        "first": "D",
                        "middle": [],
                        "last": "Cohn",
                        "suffix": ""
                    },
                    {
                        "first": "D",
                        "middle": [],
                        "last": "Freytag",
                        "suffix": ""
                    },
                    {
                        "first": "V",
                        "middle": [],
                        "last": "Mittal",
                        "suffix": ""
                    }
                ],
                "year": 2000,
                "venue": "",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "A. Berger, R. Caruana, D. Cohn, D. Freytag, and V. Mit- tal. 2000. Bridging the Lexical Chasm: Statistical Approaches to Answer Finding. Proc. of SIGIR.",
                "links": null
            },
            "BIBREF4": {
                "ref_id": "b4",
                "title": "Structured Retrieval for Question Answering. Proc. of SIGIR",
                "authors": [
                    {
                        "first": "M",
                        "middle": [],
                        "last": "Bilotti",
                        "suffix": ""
                    },
                    {
                        "first": "P",
                        "middle": [],
                        "last": "Ogilvie",
                        "suffix": ""
                    },
                    {
                        "first": "J",
                        "middle": [],
                        "last": "Callan",
                        "suffix": ""
                    },
                    {
                        "first": "E",
                        "middle": [],
                        "last": "Nyberg",
                        "suffix": ""
                    }
                ],
                "year": 2007,
                "venue": "",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "M. Bilotti, P. Ogilvie, J. Callan, and E. Nyberg. 2007. Structured Retrieval for Question Answering. Proc. of SIGIR.",
                "links": null
            },
            "BIBREF5": {
                "ref_id": "b5",
                "title": "Data-Intensive Question Answering. Proc. of TREC",
                "authors": [
                    {
                        "first": "E",
                        "middle": [],
                        "last": "Brill",
                        "suffix": ""
                    },
                    {
                        "first": "J",
                        "middle": [],
                        "last": "Lin",
                        "suffix": ""
                    },
                    {
                        "first": "M",
                        "middle": [],
                        "last": "Banko",
                        "suffix": ""
                    },
                    {
                        "first": "S",
                        "middle": [],
                        "last": "Dumais",
                        "suffix": ""
                    },
                    {
                        "first": "A",
                        "middle": [],
                        "last": "Ng",
                        "suffix": ""
                    }
                ],
                "year": 2001,
                "venue": "",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "E. Brill, J. Lin, M. Banko, S. Dumais, and A. Ng. 2001. Data-Intensive Question Answering. Proc. of TREC.",
                "links": null
            },
            "BIBREF6": {
                "ref_id": "b6",
                "title": "The Mathematics of Statistical Machine Translation: Parameter Estimation",
                "authors": [
                    {
                        "first": "P",
                        "middle": [],
                        "last": "Brown",
                        "suffix": ""
                    },
                    {
                        "first": "S",
                        "middle": [],
                        "last": "Della Pietra",
                        "suffix": ""
                    },
                    {
                        "first": "V",
                        "middle": [],
                        "last": "Della Pietra",
                        "suffix": ""
                    },
                    {
                        "first": "R",
                        "middle": [],
                        "last": "Mercer",
                        "suffix": ""
                    }
                ],
                "year": 1993,
                "venue": "Computational Linguistics",
                "volume": "19",
                "issue": "2",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "P. Brown, S. Della Pietra, V. Della Pietra, R. Mercer. 1993. The Mathematics of Statistical Machine Trans- lation: Parameter Estimation. Computational Linguis- tics, 19(2).",
                "links": null
            },
            "BIBREF7": {
                "ref_id": "b7",
                "title": "Broad Coverage Sense Disambiguation and Information Extraction with a Supersense Sequence Tagger",
                "authors": [
                    {
                        "first": "M",
                        "middle": [],
                        "last": "Ciaramita",
                        "suffix": ""
                    },
                    {
                        "first": "Y",
                        "middle": [],
                        "last": "Altun",
                        "suffix": ""
                    }
                ],
                "year": 2006,
                "venue": "Proc. of EMNLP",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "M. Ciaramita and Y. Altun. 2006. Broad Coverage Sense Disambiguation and Information Extraction with a Su- persense Sequence Tagger. Proc. of EMNLP.",
                "links": null
            },
            "BIBREF8": {
                "ref_id": "b8",
                "title": "Semantic Associations for Contextual Advertising",
                "authors": [
                    {
                        "first": "M",
                        "middle": [],
                        "last": "Ciaramita",
                        "suffix": ""
                    },
                    {
                        "first": "V",
                        "middle": [],
                        "last": "Murdock",
                        "suffix": ""
                    },
                    {
                        "first": "V",
                        "middle": [],
                        "last": "Plachouras",
                        "suffix": ""
                    }
                ],
                "year": 2008,
                "venue": "Journal of Electronic Commerce Research -Special Issue on Online Advertising and Sponsored Search",
                "volume": "9",
                "issue": "1",
                "pages": "1--15",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "M. Ciaramita, V. Murdock and V. Plachouras. 2008. Se- mantic Associations for Contextual Advertising. 2008. Journal of Electronic Commerce Research -Special Is- sue on Online Advertising and Sponsored Search, 9(1), pp.1-15.",
                "links": null
            },
            "BIBREF9": {
                "ref_id": "b9",
                "title": "Convolution Kernels for Natural Language",
                "authors": [
                    {
                        "first": "M",
                        "middle": [],
                        "last": "Collins",
                        "suffix": ""
                    },
                    {
                        "first": "N",
                        "middle": [],
                        "last": "Duffy",
                        "suffix": ""
                    }
                ],
                "year": 2001,
                "venue": "Proc. of NIPS",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "M. Collins and N. Duffy. 2001. Convolution Kernels for Natural Language. Proc. of NIPS 2001.",
                "links": null
            },
            "BIBREF10": {
                "ref_id": "b10",
                "title": "Question Answering Passage Retrieval Using Dependency Relations",
                "authors": [
                    {
                        "first": "H",
                        "middle": [],
                        "last": "Cui",
                        "suffix": ""
                    },
                    {
                        "first": "R",
                        "middle": [],
                        "last": "Sun",
                        "suffix": ""
                    },
                    {
                        "first": "K",
                        "middle": [],
                        "last": "Li",
                        "suffix": ""
                    },
                    {
                        "first": "M",
                        "middle": [],
                        "last": "Kan",
                        "suffix": ""
                    },
                    {
                        "first": "T",
                        "middle": [],
                        "last": "Chua",
                        "suffix": ""
                    }
                ],
                "year": 2005,
                "venue": "Proc. of SIGIR",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "H. Cui, R. Sun, K. Li, M. Kan, and T. Chua. 2005. Ques- tion Answering Passage Retrieval Using Dependency Relations. Proc. of SIGIR.",
                "links": null
            },
            "BIBREF11": {
                "ref_id": "b11",
                "title": "Frustratingly Hard Domain Adaptation for Parsing",
                "authors": [
                    {
                        "first": "M",
                        "middle": [],
                        "last": "Dredze",
                        "suffix": ""
                    },
                    {
                        "first": "J",
                        "middle": [],
                        "last": "Blitzer",
                        "suffix": ""
                    },
                    {
                        "first": "P",
                        "middle": [],
                        "last": "Pratim Talukdar",
                        "suffix": ""
                    },
                    {
                        "first": "K",
                        "middle": [],
                        "last": "Ganchev",
                        "suffix": ""
                    },
                    {
                        "first": "J",
                        "middle": [],
                        "last": "Graca",
                        "suffix": ""
                    },
                    {
                        "first": "F",
                        "middle": [],
                        "last": "Pereira",
                        "suffix": ""
                    }
                ],
                "year": 2007,
                "venue": "Proc. of EMNLP-CoNLL",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "M. Dredze, J. Blitzer, P. Pratim Talukdar, K. Ganchev, J. Graca, and F. Pereira. 2007. Frustratingly Hard Domain Adaptation for Parsing. In Proc. of EMNLP- CoNLL 2007 Shared Task.",
                "links": null
            },
            "BIBREF12": {
                "ref_id": "b12",
                "title": "A Noisy-Channel Approach to Question Answering",
                "authors": [
                    {
                        "first": "A",
                        "middle": [],
                        "last": "Echihabi",
                        "suffix": ""
                    },
                    {
                        "first": "D",
                        "middle": [],
                        "last": "Marcu",
                        "suffix": ""
                    }
                ],
                "year": 2003,
                "venue": "Proc. of ACL",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "A. Echihabi and D. Marcu. 2003. A Noisy-Channel Ap- proach to Question Answering. Proc. of ACL.",
                "links": null
            },
            "BIBREF13": {
                "ref_id": "b13",
                "title": "Large margin classification using the perceptron algorithm",
                "authors": [
                    {
                        "first": "Y",
                        "middle": [],
                        "last": "Freund",
                        "suffix": ""
                    },
                    {
                        "first": "R",
                        "middle": [
                            "E"
                        ],
                        "last": "Schapire",
                        "suffix": ""
                    }
                ],
                "year": 1999,
                "venue": "Machine Learning",
                "volume": "37",
                "issue": "",
                "pages": "277--296",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Y. Freund and R.E. Schapire. 1999. Large margin clas- sification using the perceptron algorithm. Machine Learning, 37, pp. 277-296.",
                "links": null
            },
            "BIBREF14": {
                "ref_id": "b14",
                "title": "Automatic Detection of Causal Relations for Question Answering",
                "authors": [
                    {
                        "first": "R",
                        "middle": [],
                        "last": "Girju",
                        "suffix": ""
                    }
                ],
                "year": 2003,
                "venue": "Proc. of ACL, Workshop on Multilingual Summarization and Question Answering",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "R. Girju. 2003. Automatic Detection of Causal Relations for Question Answering. Proc. of ACL, Workshop on Multilingual Summarization and Question Answering.",
                "links": null
            },
            "BIBREF15": {
                "ref_id": "b15",
                "title": "Falcon: Boosting Knowledge for Answer Engines. Proc. of TREC",
                "authors": [
                    {
                        "first": "S",
                        "middle": [],
                        "last": "Harabagiu",
                        "suffix": ""
                    },
                    {
                        "first": "D",
                        "middle": [],
                        "last": "Moldovan",
                        "suffix": ""
                    },
                    {
                        "first": "M",
                        "middle": [],
                        "last": "Pasca",
                        "suffix": ""
                    },
                    {
                        "first": "R",
                        "middle": [],
                        "last": "Mihalcea",
                        "suffix": ""
                    },
                    {
                        "first": "M",
                        "middle": [],
                        "last": "Surdeanu",
                        "suffix": ""
                    },
                    {
                        "first": "R",
                        "middle": [],
                        "last": "Bunescu",
                        "suffix": ""
                    },
                    {
                        "first": "R",
                        "middle": [],
                        "last": "Girju",
                        "suffix": ""
                    },
                    {
                        "first": "V",
                        "middle": [],
                        "last": "Rus",
                        "suffix": ""
                    },
                    {
                        "first": "P",
                        "middle": [],
                        "last": "Morarescu",
                        "suffix": ""
                    }
                ],
                "year": 2000,
                "venue": "",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "S. Harabagiu, D. Moldovan, M. Pasca, R. Mihalcea, M. Surdeanu, R. Bunescu, R. Girju, V. Rus, and P. Morarescu. 2000. Falcon: Boosting Knowledge for Answer Engines. Proc. of TREC.",
                "links": null
            },
            "BIBREF16": {
                "ref_id": "b16",
                "title": "Corpus-based Question Answering for why-Questions",
                "authors": [
                    {
                        "first": "R",
                        "middle": [],
                        "last": "Higashinaka",
                        "suffix": ""
                    },
                    {
                        "first": "H",
                        "middle": [],
                        "last": "Isozaki",
                        "suffix": ""
                    }
                ],
                "year": 2008,
                "venue": "Proc. of IJC-NLP",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "R. Higashinaka and H. Isozaki. 2008. Corpus-based Question Answering for why-Questions. Proc. of IJC- NLP.",
                "links": null
            },
            "BIBREF17": {
                "ref_id": "b17",
                "title": "Finding Similar Questions in Large Question and Answer Archives",
                "authors": [
                    {
                        "first": "J",
                        "middle": [],
                        "last": "Jeon",
                        "suffix": ""
                    },
                    {
                        "first": "W",
                        "middle": [
                            "B"
                        ],
                        "last": "Croft",
                        "suffix": ""
                    },
                    {
                        "first": "J",
                        "middle": [
                            "H"
                        ],
                        "last": "Lee",
                        "suffix": ""
                    }
                ],
                "year": 2005,
                "venue": "Proc. of CIKM",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "J. Jeon, W. B. Croft, and J. H. Lee. 2005. Finding Simi- lar Questions in Large Question and Answer Archives. Proc. of CIKM.",
                "links": null
            },
            "BIBREF18": {
                "ref_id": "b18",
                "title": "A Framework to Predict the Quality of Answers with Non-Textual Features. Proc. of SIGIR",
                "authors": [
                    {
                        "first": "J",
                        "middle": [],
                        "last": "Jeon",
                        "suffix": ""
                    },
                    {
                        "first": "W",
                        "middle": [
                            "B"
                        ],
                        "last": "Croft",
                        "suffix": ""
                    },
                    {
                        "first": "J",
                        "middle": [
                            "H"
                        ],
                        "last": "Lee",
                        "suffix": ""
                    },
                    {
                        "first": "S",
                        "middle": [],
                        "last": "Park",
                        "suffix": ""
                    }
                ],
                "year": 2006,
                "venue": "",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "J. Jeon, W. B. Croft, J. H. Lee, and S. Park. 2006. A Framework to Predict the Quality of Answers with Non-Textual Features. Proc. of SIGIR.",
                "links": null
            },
            "BIBREF19": {
                "ref_id": "b19",
                "title": "Languageindependent Probabilistic Answer Ranking. for Question Answering. Proc. of ACL",
                "authors": [
                    {
                        "first": "J",
                        "middle": [],
                        "last": "Ko",
                        "suffix": ""
                    },
                    {
                        "first": "T",
                        "middle": [],
                        "last": "Mitamura",
                        "suffix": ""
                    },
                    {
                        "first": "E",
                        "middle": [],
                        "last": "Nyberg",
                        "suffix": ""
                    }
                ],
                "year": 2007,
                "venue": "",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "J. Ko, T. Mitamura, and E. Nyberg. 2007. Language- independent Probabilistic Answer Ranking. for Ques- tion Answering. Proc. of ACL.",
                "links": null
            },
            "BIBREF20": {
                "ref_id": "b20",
                "title": "Learning Question Classifiers: The Role of Semantic Information",
                "authors": [
                    {
                        "first": "X",
                        "middle": [],
                        "last": "Li",
                        "suffix": ""
                    },
                    {
                        "first": "D",
                        "middle": [],
                        "last": "Roth",
                        "suffix": ""
                    }
                ],
                "year": 2005,
                "venue": "Natural Language Engineering",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "X. Li and D. Roth. 2005. Learning Question Classifiers: The Role of Semantic Information. Natural Language Engineering.",
                "links": null
            },
            "BIBREF21": {
                "ref_id": "b21",
                "title": "Comparing Statistical and Content-Based Techniques for Answer Validation on the Web",
                "authors": [
                    {
                        "first": "B",
                        "middle": [],
                        "last": "Magnini",
                        "suffix": ""
                    },
                    {
                        "first": "M",
                        "middle": [],
                        "last": "Negri",
                        "suffix": ""
                    },
                    {
                        "first": "R",
                        "middle": [],
                        "last": "Prevete",
                        "suffix": ""
                    },
                    {
                        "first": "H",
                        "middle": [],
                        "last": "Tanev",
                        "suffix": ""
                    }
                ],
                "year": 2002,
                "venue": "Proc. of the VIII Convegno AI*IA",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "B. Magnini, M. Negri, R. Prevete, and H. Tanev. 2002. Comparing Statistical and Content-Based Techniques for Answer Validation on the Web. Proc. of the VIII Convegno AI*IA.",
                "links": null
            },
            "BIBREF22": {
                "ref_id": "b22",
                "title": "Building a large annotated corpus of English: The Penn TreeBank",
                "authors": [
                    {
                        "first": "M",
                        "middle": [
                            "P"
                        ],
                        "last": "Marcus",
                        "suffix": ""
                    },
                    {
                        "first": "B",
                        "middle": [],
                        "last": "Santorini",
                        "suffix": ""
                    },
                    {
                        "first": "M",
                        "middle": [
                            "A"
                        ],
                        "last": "Marcinkiewicz",
                        "suffix": ""
                    }
                ],
                "year": 1993,
                "venue": "Computational Linguistics",
                "volume": "19",
                "issue": "2",
                "pages": "313--330",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "M.P. Marcus, B. Santorini and M.A. Marcinkiewicz. 1993. Building a large annotated corpus of En- glish: The Penn TreeBank. Computational Linguis- tics, 19(2), pp. 313-330.",
                "links": null
            },
            "BIBREF23": {
                "ref_id": "b23",
                "title": "LASSO -A Tool for Surfing the Answer Net",
                "authors": [
                    {
                        "first": "D",
                        "middle": [],
                        "last": "Moldovan",
                        "suffix": ""
                    },
                    {
                        "first": "S",
                        "middle": [],
                        "last": "Harabagiu",
                        "suffix": ""
                    },
                    {
                        "first": "M",
                        "middle": [],
                        "last": "Pasca",
                        "suffix": ""
                    },
                    {
                        "first": "R",
                        "middle": [],
                        "last": "Mihalcea",
                        "suffix": ""
                    },
                    {
                        "first": "R",
                        "middle": [],
                        "last": "Goodrum",
                        "suffix": ""
                    },
                    {
                        "first": "R",
                        "middle": [],
                        "last": "Girju",
                        "suffix": ""
                    },
                    {
                        "first": "V",
                        "middle": [],
                        "last": "Rus",
                        "suffix": ""
                    }
                ],
                "year": 1999,
                "venue": "Proc. of TREC",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "D. Moldovan, S. Harabagiu, M. Pasca, R. Mihalcea, R. Goodrum, R. Girju, and V. Rus. 1999. LASSO -A Tool for Surfing the Answer Net. Proc. of TREC.",
                "links": null
            },
            "BIBREF24": {
                "ref_id": "b24",
                "title": "Exploiting Syntactic and Shallow Semantic Kernels for Question/Answer Classification",
                "authors": [
                    {
                        "first": "A",
                        "middle": [],
                        "last": "Moschitti",
                        "suffix": ""
                    },
                    {
                        "first": "S",
                        "middle": [],
                        "last": "Quarteroni",
                        "suffix": ""
                    },
                    {
                        "first": "R",
                        "middle": [],
                        "last": "Basili",
                        "suffix": ""
                    },
                    {
                        "first": "S",
                        "middle": [],
                        "last": "Manandhar",
                        "suffix": ""
                    }
                ],
                "year": 2007,
                "venue": "Proc. of ACL",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "A. Moschitti, S. Quarteroni, R. Basili and S. Manand- har. 2007. Exploiting Syntactic and Shallow Semantic Kernels for Question/Answer Classification. Proc. of ACL.",
                "links": null
            },
            "BIBREF25": {
                "ref_id": "b25",
                "title": "On relevance Weights with Little Relevance Information",
                "authors": [
                    {
                        "first": "S",
                        "middle": [],
                        "last": "Robertson",
                        "suffix": ""
                    },
                    {
                        "first": "S",
                        "middle": [],
                        "last": "Walker",
                        "suffix": ""
                    }
                ],
                "year": 1997,
                "venue": "Proc. of SIGIR",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "S. Robertson and S. Walker. 1997. On relevance Weights with Little Relevance Information. Proc. of SIGIR.",
                "links": null
            },
            "BIBREF26": {
                "ref_id": "b26",
                "title": "Automatic Question Answering Using the Web: Beyond the Factoid",
                "authors": [
                    {
                        "first": "R",
                        "middle": [],
                        "last": "Soricut",
                        "suffix": ""
                    },
                    {
                        "first": "E",
                        "middle": [],
                        "last": "Brill",
                        "suffix": ""
                    }
                ],
                "year": 2006,
                "venue": "Journal of Information Retrieval -Special Issue on Web Information Retrieval",
                "volume": "9",
                "issue": "2",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "R. Soricut and E. Brill. 2006. Automatic Question An- swering Using the Web: Beyond the Factoid. Journal of Information Retrieval -Special Issue on Web Infor- mation Retrieval, 9(2).",
                "links": null
            },
            "BIBREF27": {
                "ref_id": "b27",
                "title": "Ranking and Reranking with Perceptron",
                "authors": [
                    {
                        "first": "L",
                        "middle": [],
                        "last": "Shen",
                        "suffix": ""
                    },
                    {
                        "first": "A",
                        "middle": [],
                        "last": "Joshi",
                        "suffix": ""
                    }
                ],
                "year": 2005,
                "venue": "Machine Learning. Special Issue on Learning in Speech and Language Technologies",
                "volume": "60",
                "issue": "1-3",
                "pages": "73--96",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "L. Shen and A. Joshi. 2005. Ranking and Reranking with Perceptron, Machine Learning. Special Issue on Learning in Speech and Language Technologies, 60(1- 3), pp. 73-96.",
                "links": null
            },
            "BIBREF28": {
                "ref_id": "b28",
                "title": "Statistical Machine Translation for Query Expansion in Answer Retrieval",
                "authors": [
                    {
                        "first": "S",
                        "middle": [],
                        "last": "Riezler",
                        "suffix": ""
                    },
                    {
                        "first": "A",
                        "middle": [],
                        "last": "Vasserman",
                        "suffix": ""
                    },
                    {
                        "first": "I",
                        "middle": [],
                        "last": "Tsochantaridis",
                        "suffix": ""
                    },
                    {
                        "first": "V",
                        "middle": [],
                        "last": "Mittal",
                        "suffix": ""
                    },
                    {
                        "first": "Y",
                        "middle": [],
                        "last": "Liu",
                        "suffix": ""
                    }
                ],
                "year": 2007,
                "venue": "Proc. of ACL",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "S. Riezler, A. Vasserman, I. Tsochantaridis, V. Mittal and Y. Liu. 2007. Statistical Machine Translation for Query Expansion in Answer Retrieval. In Proc. of ACL.",
                "links": null
            }
        },
        "ref_entries": {
            "TABREF0": {
                "content": "<table><tr><td/><td>Q: How to extract html tags from an html</td></tr><tr><td>Low</td><td>documents with c++?</td></tr><tr><td colspan=\"2\">Quality A: very carefully</td></tr></table>",
                "type_str": "table",
                "text": "How do you quiet a squeaky door? A: Spray WD-40 directly onto the hinges of the door. Open and close the door several times. Remove hinges if the door still squeaks. Remove any rust, dirt or loose paint. Apply WD-40 to High removed hinges. Put the hinges back, Quality open and close door several times again. Sample content from Yahoo! Answers.",
                "html": null,
                "num": null
            },
            "TABREF3": {
                "content": "<table/>",
                "type_str": "table",
                "text": "Overall results for the test partition.",
                "html": null,
                "num": null
            },
            "TABREF4": {
                "content": "<table><tr><td colspan=\"2\">Iter. Feature Set</td><td>MRR P@1</td></tr><tr><td>0</td><td>BM25(W)</td><td>56.06 41.12%</td></tr><tr><td>1</td><td>+ translation(B g )</td><td>61.13 46.24%</td></tr><tr><td>2</td><td>+ overall match(D)</td><td>62.50 48.34%</td></tr><tr><td>3</td><td>+ translation(W)</td><td>63.00 49.08%</td></tr><tr><td>4</td><td>+ query-log avg(χ 2 )</td><td>63.50 49.63%</td></tr><tr><td>5</td><td>+ answer span</td><td/></tr><tr><td/><td>normalized by A size</td><td>63.71 49.84%</td></tr><tr><td>6</td><td>+ query-log max(PMI)</td><td>63.87 50.09%</td></tr><tr><td>7</td><td>+ same word sequence</td><td>63.99 50.23%</td></tr><tr><td>8</td><td>+ translation(B)</td><td>64.03 50.30%</td></tr><tr><td>9</td><td>+ tfidf(W)</td><td>64.08 50.42%</td></tr><tr><td>10</td><td colspan=\"2\">+ same sentence match(W) 64.10 50.42%</td></tr><tr><td>11</td><td>+ informativeness:</td><td/></tr><tr><td/><td>verb count</td><td>64.18 50.36%</td></tr><tr><td>12</td><td>+ tfidf(B)</td><td>64.22 50.36%</td></tr><tr><td>13</td><td>+ same word sequence</td><td/></tr><tr><td/><td>normalized by Q size</td><td>64.33 50.54%</td></tr><tr><td>14</td><td>+ query-log max(χ 2 )</td><td>64.46 50.66%</td></tr><tr><td>15</td><td>+ same sentence match(W)</td><td/></tr><tr><td/><td>normalized by Q size</td><td>64.55 50.78%</td></tr><tr><td>16</td><td>+ query-log avg(PMI)</td><td>64.60 50.88%</td></tr><tr><td>17</td><td>+ overall match(W)</td><td>64.65 50.91%</td></tr></table>",
                "type_str": "table",
                "text": "Summary of the model selection process.",
                "html": null,
                "num": null
            },
            "TABREF5": {
                "content": "<table><tr><td/><td>W</td><td>B</td><td>B g</td><td>D</td><td>D g</td><td>W +</td><td>W +</td><td>W + B + W + B + B g</td></tr><tr><td/><td/><td/><td/><td/><td/><td>B</td><td>B + B g</td><td>B g + D</td><td>D + D g</td></tr><tr><td>FG1 (Similarity)</td><td>0</td><td colspan=\"4\">+1.06 -2.01 +0.84 -1.75</td><td colspan=\"2\">+1.06 +1.06</td><td>+1.06</td><td>+1.06</td></tr><tr><td colspan=\"8\">FG2 (Translation) +4.95 +4.73 +5.06 +4.63 +4.66 +5.80 +6.01</td><td>+6.36</td><td>+6.36</td></tr><tr><td>FG3 (Frequency)</td><td colspan=\"7\">+2.24 +2.33 +2.39 +2.27 +2.41 +3.56 +3.56</td><td>+3.62</td><td>+3.62</td></tr></table>",
                "type_str": "table",
                "text": "Contribution of NLP processors. Scores are MRR improvements on the development set.",
                "html": null,
                "num": null
            }
        }
    }
}