{
    "paper_id": "P09-1092",
    "header": {
        "generated_with": "S2ORC 1.0.0",
        "date_generated": "2023-06-16T12:14:39.444176Z"
    },
    "title": "Incorporating Information Status into Generation Ranking",
    "authors": [
        {
            "first": "Aoife",
            "middle": [],
            "last": "Cahill",
            "suffix": "",
            "affiliation": {
                "laboratory": "",
                "institution": "University of Stuttgart",
                "location": {
                    "postCode": "70174",
                    "settlement": "Stuttgart",
                    "country": "Germany"
                }
            },
            "email": "aoife.cahill@ims.uni-stuttgart.de"
        },
        {
            "first": "Arndt",
            "middle": [],
            "last": "Riester",
            "suffix": "",
            "affiliation": {
                "laboratory": "",
                "institution": "University of Stuttgart",
                "location": {
                    "postCode": "70174",
                    "settlement": "Stuttgart",
                    "country": "Germany"
                }
            },
            "email": "arndt.riester@ims.uni-stuttgart.de"
        }
    ],
    "year": "",
    "venue": null,
    "identifiers": {},
    "abstract": "We investigate the influence of information status (IS) on constituent order in German, and integrate our findings into a loglinear surface realisation ranking model. We show that the distribution of pairs of IS categories is strongly asymmetric. Moreover, each category is correlated with morphosyntactic features, which can be automatically detected. We build a loglinear model that incorporates these asymmetries for ranking German string realisations from input LFG F-structures. We show that it achieves a statistically significantly higher BLEU score than the baseline system without these features.",
    "pdf_parse": {
        "paper_id": "P09-1092",
        "_pdf_hash": "",
        "abstract": [
            {
                "text": "We investigate the influence of information status (IS) on constituent order in German, and integrate our findings into a loglinear surface realisation ranking model. We show that the distribution of pairs of IS categories is strongly asymmetric. Moreover, each category is correlated with morphosyntactic features, which can be automatically detected. We build a loglinear model that incorporates these asymmetries for ranking German string realisations from input LFG F-structures. We show that it achieves a statistically significantly higher BLEU score than the baseline system without these features.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Abstract",
                "sec_num": null
            }
        ],
        "body_text": [
            {
                "text": "There are many factors that influence word order, e.g. humanness, definiteness, linear order of grammatical functions, givenness, focus, constituent weight. In some cases, it can be relatively straightforward to automatically detect these features (i.e. in the case of definiteness, this is a syntactic property). The more complex the feature, the more difficult it is to automatically detect. It is common knowledge that information status1 (henceforth, IS) has a strong influence on syntax and word order; for instance, in inversions, where the subject follows some preposed element, Birner (1994) reports that the preposed element must not be newer in the discourse than the subject. We would like to be able to use information related to IS in the automatic generation of German text. Ideally, we would automatically annotate text with IS labels and learn from this data. Unfortunately, however, to date, there has been little success in automatically annotating text with IS.",
                "cite_spans": [
                    {
                        "start": 586,
                        "end": 599,
                        "text": "Birner (1994)",
                        "ref_id": "BIBREF0"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "We believe, however, that despite this shortcoming, we can still take advantage of some of the insights gained from looking at the influence of IS on word order. Specifically, we look at the problem from a more general perspective by computing an asymmetry ratio for each pair of IS categories. Results show that there are a large number of pairs exhibiting clear ordering preferences when co-occurring in the same clause. The question then becomes, without being able to automatically detect these IS category pairs, can we, nevertheless, take advantage of these strong asymmetric patterns in generation. We investigate the (automatically detectable) morphosyntactic characteristics of each asymmetric IS pair and integrate these syntactic asymmetric properties into the generation process.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "The paper is structured as follows: Section 2 outlines the underlying realisation ranking system for our experiments. Section 3 introduces information status and Section 4 describes how we extract and measure asymmetries in information status. In Section 5, we examine the syntactic characteristics of the IS asymmetries. Section 6 outlines realisation ranking experiments to test the integration of IS into the system. We discuss our findings in Section 7 and finally we conclude in Section 8.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "The task we are considering is generation ranking. In generation (or more specifically, surface realisation) ranking, we take an abstract representation of a sentence (for example, as produced by a machine translation or automatic summarisation system), produce a number of alternative string realisations corresponding to that input and use some model to choose the most likely string. We take the model outlined in Cahill et al. (2007) , a log-linear model based on the Lexical Functional Grammar (LFG) Framework (Kaplan and Bresnan, 1982) . LFG has two main levels of represen- The input to the generation system is an F-Structure. A hand-crafted, bi-directional LFG of German (Rohrer and Forst, 2006 ) is used to generate all possible strings (licensed by the grammar) for this input. As the grammar is hand-crafted, it is designed only to parse (and therefore) generate grammatical strings. 2 The task of the realisation ranking system is then to choose the most likely string. Cahill et al. (2007) describe a loglinear model that uses linguistically motivated features and improves over a simple tri-gram language model baseline. We take this log-linear model as our starting point. 3 2 There are some rare instances of the grammar parsing and therefore also generating ungrammatical output.",
                "cite_spans": [
                    {
                        "start": 417,
                        "end": 437,
                        "text": "Cahill et al. (2007)",
                        "ref_id": "BIBREF2"
                    },
                    {
                        "start": 515,
                        "end": 541,
                        "text": "(Kaplan and Bresnan, 1982)",
                        "ref_id": "BIBREF8"
                    },
                    {
                        "start": 680,
                        "end": 703,
                        "text": "(Rohrer and Forst, 2006",
                        "ref_id": "BIBREF17"
                    },
                    {
                        "start": 983,
                        "end": 1003,
                        "text": "Cahill et al. (2007)",
                        "ref_id": "BIBREF2"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Generation Ranking",
                "sec_num": "2"
            },
            {
                "text": "3 Forst (2007) presents a model for parse disambiguation that incorporates features such as humanness, definiteness, linear order of grammatical functions, constituent weight. Many of these features are already present in the Cahill et al. (2007) model.",
                "cite_spans": [
                    {
                        "start": 2,
                        "end": 14,
                        "text": "Forst (2007)",
                        "ref_id": "BIBREF6"
                    },
                    {
                        "start": 226,
                        "end": 246,
                        "text": "Cahill et al. (2007)",
                        "ref_id": "BIBREF2"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Generation Ranking",
                "sec_num": "2"
            },
            {
                "text": "An error analysis of the output of that system revealed that sometimes \"unnatural\" outputs were being selected as most probable, and that often information structural effects were the cause of subtle differences in possible alternatives. For instance, Example (3) appeared in the original TIGER corpus with the 2 preceding sentences (2).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Generation Ranking",
                "sec_num": "2"
            },
            {
                "text": "(2) Denn ausdrücklich ist darin der rechtliche Maßstab der Vorinstanz, des Sächsischen Oberverwaltungsgerichtes, bestätigt worden. Und der besagt: Die Beteiligung am politischen Strafrecht der DDR, der Mangel an kritischer Auseinandersetzung mit totalitären Überzeugungen rechtfertigen den Ausschluss von der Dritten Gewalt.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Generation Ranking",
                "sec_num": "2"
            },
            {
                "text": "'Because, the legal benchmark has explicitly been confirmed by the lower instance, the Saxonian Higher Administrative Court. And it indicates: the participation in the political criminal law of the GDR as well as deficits regarding the critical debate on totalitarian convictions justify an expulsion from the judiciary.'",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Generation Ranking",
                "sec_num": "2"
            },
            {
                "text": "( The string chosen as most likely by the system of Cahill et al. (2007) is Alternative (b) . No matter whether the context in (2) is available or the sentence is presented without any context, there seems to be a preference by native speakers for the original string (a). Alternative (e) is extremely marked4 to the point of being ungrammatical. Alternative (c) is also very marked and so is Alternative (d), although less so than (c) and (e). Alternative (b) is a little more marked than the original string, but it is easier to imagine a preceding context where this sentence would be perfectly appropriate. Such a context would be, e.g. ( 4).",
                "cite_spans": [
                    {
                        "start": 52,
                        "end": 72,
                        "text": "Cahill et al. (2007)",
                        "ref_id": "BIBREF2"
                    },
                    {
                        "start": 88,
                        "end": 91,
                        "text": "(b)",
                        "ref_id": null
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Generation Ranking",
                "sec_num": "2"
            },
            {
                "text": "(4) Vergangenheitsaufarbeitung und Abwiegeln sind zwei sehr unterschiedliche Arten, mit dem Geschehenen umzugehen.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Generation Ranking",
                "sec_num": "2"
            },
            {
                "text": "'Dealing with the mistakes or playing them down are two very different ways to handle the past.'",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Generation Ranking",
                "sec_num": "2"
            },
            {
                "text": "If we limit ourselves to single sentences, the task for the model is then to choose the string that is closest to the \"default\" expected word order (i.e. appropriate in the most number of contexts). In this work, we concentrate on integrating insights from work on information status into the realisation ranking process.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Generation Ranking",
                "sec_num": "2"
            },
            {
                "text": "The concept of information status (Prince, 1981; Prince, 1992) involves classifying NP/PP/DP expressions in texts according to various ways of their being given or new. It replaces and specifies more clearly the often vaguely used term givenness. The process of labelling a corpus for IS can be seen as a means of discourse analysis. Different classification systems have been proposed in the literature; see Riester (2008a) for a comparison of several IS labelling schemes and Riester (2008b) for a new proposal based on criteria from presupposition theory. In the work described here, we use the scheme of Riester (2008b) . His main theoretic assumption is that IS categories (for definites) should group expressions according to the contextual resources in which their presuppositions find an antecedent. For definites, the set of main category labels found in Table 1 is assumed.",
                "cite_spans": [
                    {
                        "start": 34,
                        "end": 48,
                        "text": "(Prince, 1981;",
                        "ref_id": "BIBREF12"
                    },
                    {
                        "start": 49,
                        "end": 62,
                        "text": "Prince, 1992)",
                        "ref_id": "BIBREF13"
                    },
                    {
                        "start": 409,
                        "end": 424,
                        "text": "Riester (2008a)",
                        "ref_id": null
                    },
                    {
                        "start": 478,
                        "end": 493,
                        "text": "Riester (2008b)",
                        "ref_id": null
                    },
                    {
                        "start": 608,
                        "end": 623,
                        "text": "Riester (2008b)",
                        "ref_id": null
                    }
                ],
                "ref_spans": [
                    {
                        "start": 870,
                        "end": 871,
                        "text": "1",
                        "ref_id": "TABREF1"
                    }
                ],
                "eq_spans": [],
                "section": "Information Status",
                "sec_num": "3"
            },
            {
                "text": "The idea of resolution contexts derives from the concept of a presupposition trigger (e.g. a definite description) as potentially establishing an (van der Sandt, 1992) to an entity being available by some means or other. But there are some expressions whose referent cannot be identified and needs to be accommodated, compare (5).",
                "cite_spans": [
                    {
                        "start": 146,
                        "end": 167,
                        "text": "(van der Sandt, 1992)",
                        "ref_id": "BIBREF18"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Information Status",
                "sec_num": "3"
            },
            {
                "text": "(",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Information Status",
                "sec_num": "3"
            },
            {
                "text": "Sozialdemokraten] ACC-DESC 'the leadership crisis lasting for months among the Hamburg Social Democrats'",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "5) [die monatelange Führungskrise der Hamburger",
                "sec_num": null
            },
            {
                "text": "Examples like this one have been mentioned early on in the literature (e.g. Hawkins (1978) , Clark and Marshall (1981) ). Nevertheless, labeling schemes so far have neglected this issue, which is explicitly incorporated in the system of Riester (2008b) .",
                "cite_spans": [
                    {
                        "start": 76,
                        "end": 90,
                        "text": "Hawkins (1978)",
                        "ref_id": "BIBREF7"
                    },
                    {
                        "start": 93,
                        "end": 118,
                        "text": "Clark and Marshall (1981)",
                        "ref_id": "BIBREF3"
                    },
                    {
                        "start": 237,
                        "end": 252,
                        "text": "Riester (2008b)",
                        "ref_id": null
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "5) [die monatelange Führungskrise der Hamburger",
                "sec_num": null
            },
            {
                "text": "The status of an expression is ACCESSIBLE-GENERAL (or unused, following Prince (1981)) if it is not present in the previous discourse but refers to an entity that is known to the intended recipent. There is a further differentiation of the ACCESSIBLE-GENERAL class into generic (TYPE) and non-generic (TOKEN) items.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "5) [die monatelange Führungskrise der Hamburger",
                "sec_num": null
            },
            {
                "text": "An expression is D-GIVEN (or textually evoked) if and only if an antecedent is available in the discourse context. D-GIVEN entities are subdivided according to whether they are repetitions of their antecedent, short forms thereof, pronouns or whether they use new linguistic material to add information about an already existing discourse referent (label: EPITHET). Examples representing a co-reference chain are shown in (6).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "5) [die monatelange Führungskrise der Hamburger",
                "sec_num": null
            },
            {
                "text": "items that can be identified within a scenario context evoked by a non-coreferential item receive the label BRIDGING; compare Example (7). ",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "5) [die monatelange Führungskrise der Hamburger",
                "sec_num": null
            },
            {
                "text": "In order to find out whether IS categories are unevenly distributed within German sentences we examine a corpus of German radio news bulletins that has been manually annotated for IS (496 annotated sentences in total) using the scheme of Riester (2008b) . 5For each pair of IS labels X and Y we count how often they co-occur in the corpus within a single clause. In doing so, we distinguish the numbers for \"X preceding Y \" (= A) and \"Y preceding X\" (= B). The larger group is referred to as the dominant order. Subsequently, we compute a ratio indicating the degree of asymmetry between the two orders. If, for instance, the dominant pattern occurs 20 times (A) and the reverse pattern only 5 times (B), the asymmetry ratio B/A is 0.25. Table 3 : Asymmetric pairs of IS labels Table 3 gives the top asymmetry pairs down to a ratio of about 1:3 as well as, down at the bottom, the pairs that are most evenly distributed. This means that the top pairs exhibit strong ordering preferences and are, hence, unevenly distributed in German sentences. For instance, the ordering D-GIVEN-PRONOUN before INDEF-REL (top line), shown in Example (8), occurs 19 times in the examined corpus while there is no example in the corpus for the reverse order.7 ",
                "cite_spans": [
                    {
                        "start": 238,
                        "end": 253,
                        "text": "Riester (2008b)",
                        "ref_id": null
                    }
                ],
                "ref_spans": [
                    {
                        "start": 744,
                        "end": 745,
                        "text": "3",
                        "ref_id": null
                    },
                    {
                        "start": 784,
                        "end": 785,
                        "text": "3",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "Asymmetries in IS",
                "sec_num": "4"
            },
            {
                "text": "It seems that IS could, in principle, be quite beneficial in the generation ranking task. The problem, of course, is that we do not possess any reliable system of automatically assigning IS labels to unknown text and manual annotations are costly and time-consuming. As a substitute, we identify a list of morphosyntactic characteristics that the expressions can adopt and investigate how these are correlated to our inventory of IS categories.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Syntactic IS Asymmetries",
                "sec_num": "5"
            },
            {
                "text": "For some IS labels there is a direct link between the typical phrases that fall into that IS category, and the syntactic features that describe it. One such example is D-GIVEN-PRONOUN, which always corresponds to a pronoun, or EXPL which always corresponds to expletive items. Such syntactic markers can easily be identified in the LFG F-structures. On the other hand, there are many IS labels for which there is no clear cut syntactic class that describes its typical phrases. Examples include NEW, ACCESSIBLE-GENERAL or ACCESSIBLE-DESCRIPTION.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Syntactic IS Asymmetries",
                "sec_num": "5"
            },
            {
                "text": "In order to determine whether we can ascertain a set of syntactic features that are representative of a particular IS label, we design an inventory of syntactic features that are found in all types of IS phrases. The complete inventory is given in Table 5 . It is a much easier task to identify these syntactic characteristics than to try and automatically detect IS labels directly, which would require a deep semantic understanding of the text. We automatically mark up the news corpus with these syntactic characteristics, giving us a corpus both annotated for IS and syntactic features.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 254,
                        "end": 255,
                        "text": "5",
                        "ref_id": "TABREF7"
                    }
                ],
                "eq_spans": [],
                "section": "Syntactic IS Asymmetries",
                "sec_num": "5"
            },
            {
                "text": "We can now identify, for each IS label, what the most frequent syntactic characteristics of that label are. Some examples and their frequencies are given in Table 4 ",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 157,
                        "end": 164,
                        "text": "Table 4",
                        "ref_id": "TABREF5"
                    }
                ],
                "eq_spans": [],
                "section": "Syntactic IS Asymmetries",
                "sec_num": "5"
            },
            {
                "text": "Using the augmented set of IS asymmetries, we design new features to be included into the original model of Cahill et al. (2007) . For each IS asymmetry, we extract all precedence patterns of the corresponding syntactic features. For example, from the first asymmetry in Table 6 , we extract the following features: We extract these patterns for all of the asymmetric pairs in Table 3 (augmented with syntactic characteristics) that have a ratio >0.4. The patterns we extract need to be checked for inconsistencies because not all of them are valid. By inconsistencies, we mean patterns of the type X precedes X, Y precedes Y, and any pattern where the variant X precedes Y as well as Y precedes X is present. These are all automatically removed from the list of features to give a total of 130 new features for the log-linear ranking model.",
                "cite_spans": [
                    {
                        "start": 108,
                        "end": 128,
                        "text": "Cahill et al. (2007)",
                        "ref_id": "BIBREF2"
                    }
                ],
                "ref_spans": [
                    {
                        "start": 277,
                        "end": 278,
                        "text": "6",
                        "ref_id": "TABREF8"
                    },
                    {
                        "start": 383,
                        "end": 384,
                        "text": "3",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "Generation Ranking Experiments",
                "sec_num": "6"
            },
            {
                "text": "We train the log-linear ranking model on 7759 F-structures from the TIGER treebank. We generate strings from each F-structure and take the original treebank string to be the labelled example. All other examples are viewed as unlabelled. We tune the parameters of the log-linear model on a small development set of 63 sentences, and carry out the final evaluation on 261 unseen sentences. The ranking results of the model with the additional IS-inspired features are given in Table 7 . 2002) . We achieve an improvement of 0.0168 BLEU points and 1.91 percentage points in exact match. The improvement in BLEU is statistically significant (p < 0.01) using the paired bootstrap resampling significance test (Koehn, 2004) .",
                "cite_spans": [
                    {
                        "start": 485,
                        "end": 490,
                        "text": "2002)",
                        "ref_id": null
                    },
                    {
                        "start": 704,
                        "end": 717,
                        "text": "(Koehn, 2004)",
                        "ref_id": "BIBREF9"
                    }
                ],
                "ref_spans": [
                    {
                        "start": 481,
                        "end": 482,
                        "text": "7",
                        "ref_id": "TABREF6"
                    }
                ],
                "eq_spans": [],
                "section": "Generation Ranking Experiments",
                "sec_num": "6"
            },
            {
                "text": "Going back to Example (3), the new model chooses a \"better\" string than the Cahill et al. (2007) model. The new model chooses the original string. While the string chosen by the Cahill et al. (2007) system is also a perfectly valid sentence, our empirical findings from the news corpus were that the default order of generic pronoun before definite NP were more frequent. The system with the new features helped to choose the original string, as it had learnt this asymmetry.",
                "cite_spans": [
                    {
                        "start": 76,
                        "end": 96,
                        "text": "Cahill et al. (2007)",
                        "ref_id": "BIBREF2"
                    },
                    {
                        "start": 178,
                        "end": 198,
                        "text": "Cahill et al. (2007)",
                        "ref_id": "BIBREF2"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Generation Ranking Experiments",
                "sec_num": "6"
            },
            {
                "text": "The results in Table 7 clearly show that the new model is beneficial. However, we want to know how much of the improvement gained is due to the IS asymmetries, and how much the syntactic asymmetries on their own can contribute. To this end, we carry out a further experiment where we calculate syntactic asymmetries based on the automatic markup of the corpus, and ignore the IS labels completely. Again we remove any inconsistent asymmetries and only choose asymmetries with a ratio of higher than 0.4. The top asymmetries are given in Table 8 . For each asymmetry, we create a new feature X precedes Y. This results in a total of 66 features. Of these 30 overlap with the features used in the above experiment. We do not include the features extracted in the first attempt in this experiment. The same training procedure is carried out and we test on the same heldout test set of 261 sen-tences. The results are given in Table 9 . Finally, we combine the two lists of features and evaluate, these results are also presented in Table 9 . They show that although the syntactic asymmetries alone contribute to an improvement over the baseline, the gain is not as large as when the syntactic asymmetries are constrained to correspond to IS label asymmetries (Model 1). 9 Interestingly, the combination of the lists of features does not result in an improvement over Model 1. The difference in BLEU score between the model of Cahill et al. (2007) and the model that only takes syntactic-based asymmetries into account is not statistically significant, while the difference between Model 1 and this model is statistically significant (p < 0.05).",
                "cite_spans": [
                    {
                        "start": 1423,
                        "end": 1443,
                        "text": "Cahill et al. (2007)",
                        "ref_id": "BIBREF2"
                    }
                ],
                "ref_spans": [
                    {
                        "start": 21,
                        "end": 22,
                        "text": "7",
                        "ref_id": "TABREF6"
                    },
                    {
                        "start": 543,
                        "end": 544,
                        "text": "8",
                        "ref_id": "TABREF10"
                    },
                    {
                        "start": 929,
                        "end": 930,
                        "text": "9",
                        "ref_id": null
                    },
                    {
                        "start": 1035,
                        "end": 1036,
                        "text": "9",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "Was it just the syntax?",
                "sec_num": null
            },
            {
                "text": "In the work described here, we concentrate only on taking advantage of the information that is readily available to us. Ideally, we would like to be able to use the IS asymmetries directly as features, however, without any means of automatically annotating new text with these categories, this is impossible. Our experiments were designed to test, whether we can achieve an improvement in the generation of German text, without a fully labelled corpus, using the insight that at least some IS categories correspond to morphosyntactic characteristics that can be easily identified. We do not claim to go beyond this level to the point where true IS labels would be used, rather we attempt to provide a crude approximation of IS using only morphosyntactic information. To be able to fully automatically annotate text with IS labels, one would need to supplement the morphosyntactic features 9 The difference may also be due to the fewer features used in the second experiment. However, this emphasises, that the asymmetries gleaned from syntactic information alone are not strong enough to be able to determine the prevailing order of constituents. When we take the IS labels into account, we are honing in on a particular subset of interesting syntactic asymmetries.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Discussion",
                "sec_num": "7"
            },
            {
                "text": "with information about anaphora resolution, world knowledge, ontologies, and possibly even build dynamic discourse representations.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Discussion",
                "sec_num": "7"
            },
            {
                "text": "We would also like to emphasise that we are only looking at one sentence at a time. Of course, there are other inter-sentential factors (not relying on external resources) that play a role in choosing the optimal string realisation, for example parallelism or the position of the sentence in the paragraph or text. Given that we only looked at IS factors within a sentence, we think that such a significant improvement in BLEU and exact match scores is very encouraging. In future work, we will look at what information can be automatically acquired to help generation ranking based on more than one sentence.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Discussion",
                "sec_num": "7"
            },
            {
                "text": "While the experiments presented this paper are limited to a German realisation ranking system, there is nothing in the methodology that precludes it from being applied to another language. The IS annotation scheme is language-independent, and so all one needs to be able to apply this to another language is a corpus annotated with IS categories.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Discussion",
                "sec_num": "7"
            },
            {
                "text": "We extracted our IS asymmetry patterns from a small corpus of spoken news items. This corpus contains text of a similar domain to the TIGER treebank. Further experiments are required to determine how domain specific the asymmetries are.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Discussion",
                "sec_num": "7"
            },
            {
                "text": "Much related work on incorporating information status (or information structure) into language generation has been on spoken text, since information structure is often encoded by means of prosody. In a limited domain setting, Prevost (1996) describes a two-tiered information structure representation. During the high level planning stage of generation, using a small knowledge base, elements in the discourse are automatically marked as new or given. Contrast and focus are also assigned automatically. These markings influence the final string generated. We are focusing on a broad-coverage system, and do not use any external world-knowledge resources. Van Deemter and Odijk (1997) annotate the syntactic component from which they are generating with information about givenness. This information is determined by detecting contradictions and parallel sentences. Pulman (1997) also uses information about parallelism to predict word order. In contrast, we only look at one sentence when we approximate information status, future work will look at cross sentential factors. Endriss and Klabunde (2000) describe a sentence planner for German that annotates the propositional input with discourse-related features in order to determine the focus, and thus influence word order and accentuation. Their system, again, is domainspecific (generating monologue describing a film plot) and requires the existence of a knowledge base. The same holds for Yampolska (2007) , who presents suggestions for generating information structure in Russian and Ukrainian football reports, using rules to determine parallel structures for the placement of contrastive accent, following similar work by Theune (1997) . While our paper does not address the generation of speech / accentuation, it is of course conceivable to employ the IS annotated radio news corpus from which we derived the label asymmetries (and which also exists in a spoken and prosodically annotated version) in a similar task of learning the correlations between IS labels and pitch accents. Finally, Bresnan et al. (2007) present work on predicting the dative alternation in English using 14 features relating to information status which were manually annotated in their corpus. In our work, we manually annotate a small corpus in order to learn generalisations. From these we learn features that approximate the generalisations, enabling us to apply them to large amounts of unseen data without further manual annotation.",
                "cite_spans": [
                    {
                        "start": 226,
                        "end": 240,
                        "text": "Prevost (1996)",
                        "ref_id": "BIBREF11"
                    },
                    {
                        "start": 656,
                        "end": 684,
                        "text": "Van Deemter and Odijk (1997)",
                        "ref_id": "BIBREF4"
                    },
                    {
                        "start": 1076,
                        "end": 1103,
                        "text": "Endriss and Klabunde (2000)",
                        "ref_id": "BIBREF5"
                    },
                    {
                        "start": 1447,
                        "end": 1463,
                        "text": "Yampolska (2007)",
                        "ref_id": "BIBREF20"
                    },
                    {
                        "start": 1683,
                        "end": 1696,
                        "text": "Theune (1997)",
                        "ref_id": "BIBREF19"
                    },
                    {
                        "start": 2054,
                        "end": 2075,
                        "text": "Bresnan et al. (2007)",
                        "ref_id": "BIBREF1"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Discussion",
                "sec_num": "7"
            },
            {
                "text": "In this paper we presented a novel method of including IS into the task of generation ranking. Since automatic annotation of IS labels themselves is not currently possible, we approximate the IS categories by their syntactic characteristics. By calculating strong asymmetries between pairs of IS labels, and establishing the most frequent syntactic characteristics of these asymmetries, we designed a new set of features for a log-linear ranking model. In comparison to a baseline model, we achieve statistically significant improvement in BLEU score. We showed that these improvements were not only due to the effect of purely syntactic asymmetries, but that the IS asymmetries were what drove the improved model.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Conclusions",
                "sec_num": "8"
            },
            {
                "text": "We take information status to be a subarea of information structure; the one dealing with varieties of givenness but not with contrast and focus in the strictest sense.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            },
            {
                "text": "By marked, we mean that there are relatively few or specialised contexts in which this sentence is acceptable.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            },
            {
                "text": "(6) [Angela Merkel] ACC-GEN (first mention) . . . [Angela Merkel] D-GIV-REPEATED (second mention) . . . [Merkel] D-GIV-SHORT . . . [she] D-GIV-PRONOUN . . . [herself] D-GIV-REFLEXIVE . . . [the Hamburg-born politician] D-GIV-EPITHET Indexicals (referring to entities in the environment context) are labeled as SITUATIVE. Definite",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            },
            {
                "text": "The corpus was labeled by two independent annotators and the results were compared by a third person who took the final decision in case of disagreement. An evaluation as regards inter-coder agreement is currently underway.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            },
            {
                "text": "Even if some of the sentences we are learning from are marked in terms of word order, the ratios allow us to still learn the predominant order, since the marked order should occur much less frequently and the ratio will remain low. Dominant order ( : \"before\") B/A Total D-GIV-PRO INDEF-REL",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            },
            {
                "text": "Note that we are not claiming that the reverse pattern is ungrammatical or impossible, we just observe that it is extremely infrequent.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            },
            {
                "text": "For reasons of space, we are only showing the very top of the table.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            }
        ],
        "back_matter": [
            {
                "text": "This work was funded by the Collaborative Research Centre (SFB 732) at the University of Stuttgart.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Acknowledgments",
                "sec_num": null
            }
        ],
        "bib_entries": {
            "BIBREF0": {
                "ref_id": "b0",
                "title": "Information Status and Word Order: an Analysis of English Inversion",
                "authors": [
                    {
                        "first": "Betty",
                        "middle": [
                            "J"
                        ],
                        "last": "Birner",
                        "suffix": ""
                    }
                ],
                "year": 1994,
                "venue": "",
                "volume": "70",
                "issue": "",
                "pages": "233--259",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Betty J. Birner. 1994. Information Status and Word Order: an Analysis of English Inversion. Language, 70(2):233-259.",
                "links": null
            },
            "BIBREF1": {
                "ref_id": "b1",
                "title": "Predicting the Dative Alternation. Cognitive Foundations of Interpretation",
                "authors": [
                    {
                        "first": "Joan",
                        "middle": [],
                        "last": "Bresnan",
                        "suffix": ""
                    },
                    {
                        "first": "Anna",
                        "middle": [],
                        "last": "Cueni",
                        "suffix": ""
                    },
                    {
                        "first": "Tatiana",
                        "middle": [],
                        "last": "Nikitina",
                        "suffix": ""
                    },
                    {
                        "first": "R",
                        "middle": [],
                        "last": "Harald Baayen",
                        "suffix": ""
                    }
                ],
                "year": 2007,
                "venue": "",
                "volume": "",
                "issue": "",
                "pages": "69--94",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Joan Bresnan, Anna Cueni, Tatiana Nikitina, and R. Harald Baayen. 2007. Predicting the Dative Al- ternation. Cognitive Foundations of Interpretation, pages 69-94.",
                "links": null
            },
            "BIBREF2": {
                "ref_id": "b2",
                "title": "Stochastic Realisation Ranking for a Free Word Order Language",
                "authors": [
                    {
                        "first": "Aoife",
                        "middle": [],
                        "last": "Cahill",
                        "suffix": ""
                    },
                    {
                        "first": "Martin",
                        "middle": [],
                        "last": "Forst",
                        "suffix": ""
                    },
                    {
                        "first": "Christian",
                        "middle": [],
                        "last": "Rohrer",
                        "suffix": ""
                    }
                ],
                "year": 2007,
                "venue": "Proceedings of the Eleventh European Workshop on Natural Language Generation",
                "volume": "",
                "issue": "",
                "pages": "17--24",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Aoife Cahill, Martin Forst, and Christian Rohrer. 2007. Stochastic Realisation Ranking for a Free Word Or- der Language. In Proceedings of the Eleventh Eu- ropean Workshop on Natural Language Generation, pages 17-24, Saarbrücken, Germany. DFKI GmbH.",
                "links": null
            },
            "BIBREF3": {
                "ref_id": "b3",
                "title": "Definite Reference and Mutual Knowledge",
                "authors": [
                    {
                        "first": "Herbert",
                        "middle": [
                            "H"
                        ],
                        "last": "Clark",
                        "suffix": ""
                    },
                    {
                        "first": "Catherine",
                        "middle": [
                            "R"
                        ],
                        "last": "Marshall",
                        "suffix": ""
                    }
                ],
                "year": 1981,
                "venue": "Elements of Discourse Understanding",
                "volume": "",
                "issue": "",
                "pages": "10--63",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Herbert H. Clark and Catherine R. Marshall. 1981. Definite Reference and Mutual Knowledge. In Ar- avind Joshi, Bonnie Webber, and Ivan Sag, editors, Elements of Discourse Understanding, pages 10-63. Cambridge University Press.",
                "links": null
            },
            "BIBREF4": {
                "ref_id": "b4",
                "title": "Context Modeling and the Generation of Spoken Discourse",
                "authors": [
                    {
                        "first": "Kees",
                        "middle": [],
                        "last": "Van Deemter",
                        "suffix": ""
                    },
                    {
                        "first": "Jan",
                        "middle": [],
                        "last": "Odijk",
                        "suffix": ""
                    }
                ],
                "year": 1997,
                "venue": "Speech Communication",
                "volume": "21",
                "issue": "1-2",
                "pages": "101--121",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Kees van Deemter and Jan Odijk. 1997. Context Modeling and the Generation of Spoken Discourse. Speech Communication, 21(1-2):101-121.",
                "links": null
            },
            "BIBREF5": {
                "ref_id": "b5",
                "title": "Planning Word-Order Dependent Focus Assignments",
                "authors": [
                    {
                        "first": "Cornelia",
                        "middle": [],
                        "last": "Endriss",
                        "suffix": ""
                    },
                    {
                        "first": "Ralf",
                        "middle": [],
                        "last": "Klabunde",
                        "suffix": ""
                    }
                ],
                "year": 2000,
                "venue": "Proceedings of the First International Conference on Natural Language Generation (INLG)",
                "volume": "",
                "issue": "",
                "pages": "156--162",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Cornelia Endriss and Ralf Klabunde. 2000. Planning Word-Order Dependent Focus Assignments. In Pro- ceedings of the First International Conference on Natural Language Generation (INLG), pages 156- 162, Morristown, NJ. Association for Computa- tional Linguistics.",
                "links": null
            },
            "BIBREF6": {
                "ref_id": "b6",
                "title": "University of Stuttgart",
                "authors": [
                    {
                        "first": "Martin",
                        "middle": [],
                        "last": "Forst",
                        "suffix": ""
                    }
                ],
                "year": 2007,
                "venue": "Disambiguation for a Linguistically Precise German Parser",
                "volume": "13",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Martin Forst. 2007. Disambiguation for a Linguis- tically Precise German Parser. Ph.D. thesis, Uni- versity of Stuttgart. Arbeitspapiere des Instituts für Maschinelle Sprachverarbeitung (AIMS), Vol. 13(3).",
                "links": null
            },
            "BIBREF7": {
                "ref_id": "b7",
                "title": "Definiteness and Indefiniteness: A Study in Reference and Grammaticality Prediction",
                "authors": [
                    {
                        "first": "John",
                        "middle": [
                            "A"
                        ],
                        "last": "Hawkins",
                        "suffix": ""
                    }
                ],
                "year": 1978,
                "venue": "",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "John A. Hawkins. 1978. Definiteness and Indefinite- ness: A Study in Reference and Grammaticality Pre- diction. Croom Helm, London.",
                "links": null
            },
            "BIBREF8": {
                "ref_id": "b8",
                "title": "Lexical Functional Grammar, a Formal System for Grammatical Representation",
                "authors": [
                    {
                        "first": "Ron",
                        "middle": [],
                        "last": "Kaplan",
                        "suffix": ""
                    },
                    {
                        "first": "Joan",
                        "middle": [],
                        "last": "Bresnan",
                        "suffix": ""
                    }
                ],
                "year": 1982,
                "venue": "",
                "volume": "",
                "issue": "",
                "pages": "173--281",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Ron Kaplan and Joan Bresnan. 1982. Lexical Func- tional Grammar, a Formal System for Grammatical Representation. In Joan Bresnan, editor, The Men- tal Representation of Grammatical Relations, pages 173-281. MIT Press, Cambridge, MA.",
                "links": null
            },
            "BIBREF9": {
                "ref_id": "b9",
                "title": "Statistical Significance Tests for Machine Translation Evaluation",
                "authors": [
                    {
                        "first": "Philipp",
                        "middle": [],
                        "last": "Koehn",
                        "suffix": ""
                    }
                ],
                "year": 2004,
                "venue": "Proceedings of the Conference on Empirical Methods in Natural Language Processing (EMNLP 2004)",
                "volume": "",
                "issue": "",
                "pages": "388--395",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Philipp Koehn. 2004. Statistical Significance Tests for Machine Translation Evaluation. In Dekang Lin and Dekai Wu, editors, Proceedings of the Conference on Empirical Methods in Natural Language Pro- cessing (EMNLP 2004), pages 388-395, Barcelona. Association for Computational Linguistics.",
                "links": null
            },
            "BIBREF10": {
                "ref_id": "b10",
                "title": "BLEU: a Method for Automatic Evaluation of Machine Translation",
                "authors": [
                    {
                        "first": "Kishore",
                        "middle": [],
                        "last": "Papineni",
                        "suffix": ""
                    },
                    {
                        "first": "Salim",
                        "middle": [],
                        "last": "Roukos",
                        "suffix": ""
                    },
                    {
                        "first": "Todd",
                        "middle": [],
                        "last": "Ward",
                        "suffix": ""
                    },
                    {
                        "first": "Wei-Jing",
                        "middle": [],
                        "last": "Zhu",
                        "suffix": ""
                    }
                ],
                "year": 2002,
                "venue": "Proceedings of the 40th Annual Meeting of the Association for Computational Linguistics (ACL 2002)",
                "volume": "",
                "issue": "",
                "pages": "311--318",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Kishore Papineni, Salim Roukos, Todd Ward, and Wei- Jing Zhu. 2002. BLEU: a Method for Automatic Evaluation of Machine Translation. In Proceedings of the 40th Annual Meeting of the Association for Computational Linguistics (ACL 2002), pages 311- 318, Philadelphia, PA.",
                "links": null
            },
            "BIBREF11": {
                "ref_id": "b11",
                "title": "An Information Structural Approach to Spoken Language Generation",
                "authors": [
                    {
                        "first": "Scott",
                        "middle": [],
                        "last": "Prevost",
                        "suffix": ""
                    }
                ],
                "year": 1996,
                "venue": "Proceedings of the 34th Annual Meeting of the Association for Computational Linguistics (ACL 1996)",
                "volume": "",
                "issue": "",
                "pages": "294--301",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Scott Prevost. 1996. An Information Structural Ap- proach to Spoken Language Generation. In Pro- ceedings of the 34th Annual Meeting of the Asso- ciation for Computational Linguistics (ACL 1996), pages 294-301, Morristown, NJ.",
                "links": null
            },
            "BIBREF12": {
                "ref_id": "b12",
                "title": "Toward a Taxonomy of Given-New Information",
                "authors": [
                    {
                        "first": "Ellen",
                        "middle": [
                            "F"
                        ],
                        "last": "Prince",
                        "suffix": ""
                    }
                ],
                "year": 1981,
                "venue": "Radical Pragmatics",
                "volume": "",
                "issue": "",
                "pages": "233--255",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Ellen F. Prince. 1981. Toward a Taxonomy of Given- New Information. In P. Cole, editor, Radical Prag- matics, pages 233-255. Academic Press, New York.",
                "links": null
            },
            "BIBREF13": {
                "ref_id": "b13",
                "title": "The ZPG Letter: Subjects, Definiteness and Information Status",
                "authors": [
                    {
                        "first": "Ellen",
                        "middle": [
                            "F"
                        ],
                        "last": "Prince",
                        "suffix": ""
                    }
                ],
                "year": 1992,
                "venue": "Discourse Description: Diverse Linguistic Analyses of a Fund-Raising Text",
                "volume": "",
                "issue": "",
                "pages": "295--325",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Ellen F. Prince. 1992. The ZPG Letter: Subjects, Def- initeness and Information Status. In W. C. Mann and S. A. Thompson, editors, Discourse Descrip- tion: Diverse Linguistic Analyses of a Fund-Raising Text, pages 295-325. Benjamins, Amsterdam.",
                "links": null
            },
            "BIBREF14": {
                "ref_id": "b14",
                "title": "Higher Order Unification and the Interpretation of Focus",
                "authors": [
                    {
                        "first": "G",
                        "middle": [],
                        "last": "Stephen",
                        "suffix": ""
                    },
                    {
                        "first": "",
                        "middle": [],
                        "last": "Pulman",
                        "suffix": ""
                    }
                ],
                "year": 1997,
                "venue": "Linguistics and Philosophy",
                "volume": "20",
                "issue": "",
                "pages": "73--115",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Stephen G. Pulman. 1997. Higher Order Unification and the Interpretation of Focus. Linguistics and Phi- losophy, 20:73-115.",
                "links": null
            },
            "BIBREF15": {
                "ref_id": "b15",
                "title": "Semantic Explication of 'Information Status' and the Underspecification of the Recipients' Knowledge",
                "authors": [
                    {
                        "first": "Arndt",
                        "middle": [],
                        "last": "Riester",
                        "suffix": ""
                    }
                ],
                "year": 2008,
                "venue": "Proceedings of Sinn und Bedeutung",
                "volume": "12",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Arndt Riester. 2008a. A Semantic Explication of 'In- formation Status' and the Underspecification of the Recipients' Knowledge. In Atle Grønn, editor, Pro- ceedings of Sinn und Bedeutung 12, University of Oslo.",
                "links": null
            },
            "BIBREF16": {
                "ref_id": "b16",
                "title": "The Components of Focus and their Use in Annotating Information Structure",
                "authors": [
                    {
                        "first": "Arndt",
                        "middle": [],
                        "last": "Riester",
                        "suffix": ""
                    }
                ],
                "year": 2008,
                "venue": "",
                "volume": "14",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Arndt Riester. 2008b. The Components of Focus and their Use in Annotating Information Struc- ture. Ph.D. thesis, University of Stuttgart. Ar- beitspapiere des Instituts für Maschinelle Sprachver- arbeitung (AIMS), Vol. 14(2).",
                "links": null
            },
            "BIBREF17": {
                "ref_id": "b17",
                "title": "Improving Coverage and Parsing Quality of a Large-Scale LFG for German",
                "authors": [
                    {
                        "first": "Christian",
                        "middle": [],
                        "last": "Rohrer",
                        "suffix": ""
                    },
                    {
                        "first": "Martin",
                        "middle": [],
                        "last": "Forst",
                        "suffix": ""
                    }
                ],
                "year": 2006,
                "venue": "Proceedings of the Language Resources and Evaluation Conference (LREC 2006)",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Christian Rohrer and Martin Forst. 2006. Improving Coverage and Parsing Quality of a Large-Scale LFG for German. In Proceedings of the Language Re- sources and Evaluation Conference (LREC 2006), Genoa, Italy.",
                "links": null
            },
            "BIBREF18": {
                "ref_id": "b18",
                "title": "Presupposition Projection as Anaphora Resolution",
                "authors": [
                    {
                        "first": "Rob",
                        "middle": [],
                        "last": "Van Der Sandt",
                        "suffix": ""
                    }
                ],
                "year": 1992,
                "venue": "Journal of Semantics",
                "volume": "9",
                "issue": "",
                "pages": "333--377",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Rob van der Sandt. 1992. Presupposition Projection as Anaphora Resolution. Journal of Semantics, 9:333- 377.",
                "links": null
            },
            "BIBREF19": {
                "ref_id": "b19",
                "title": "Goalgetter: Predicting Contrastive Accent in Data-to-Speech Generation",
                "authors": [
                    {
                        "first": "Mariët",
                        "middle": [],
                        "last": "Theune",
                        "suffix": ""
                    }
                ],
                "year": 1997,
                "venue": "Proceedings of the 35th Annual Meeting of the Association for Computational Linguistics (ACL/EACL 1997)",
                "volume": "",
                "issue": "",
                "pages": "519--521",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Mariët Theune. 1997. Goalgetter: Predicting Con- trastive Accent in Data-to-Speech Generation. In Proceedings of the 35th Annual Meeting of the Asso- ciation for Computational Linguistics (ACL/EACL 1997), pages 519-521, Madrid. Student paper.",
                "links": null
            },
            "BIBREF20": {
                "ref_id": "b20",
                "title": "Information Structure in Natural Language Generation: an Account for East-Slavic Languages. Term paper",
                "authors": [
                    {
                        "first": "Nadiya",
                        "middle": [],
                        "last": "Yampolska",
                        "suffix": ""
                    }
                ],
                "year": 2007,
                "venue": "",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Nadiya Yampolska. 2007. Information Structure in Natural Language Generation: an Account for East- Slavic Languages. Term paper. Universität des Saar- landes.",
                "links": null
            }
        },
        "ref_entries": {
            "FIGREF0": {
                "num": null,
                "text": "Figure 1: An example C(onstituent) and F(unctional) Structure pair for (1)",
                "uris": null,
                "fig_num": "1",
                "type_str": "figure"
            },
            "FIGREF1": {
                "num": null,
                "text": "Lanka, Tamil rebels have, for the first time, carried out an airstrike against the armed forces.'In the indefinite domain, a simple classification along the lines of",
                "uris": null,
                "fig_num": null,
                "type_str": "figure"
            },
            "FIGREF3": {
                "num": null,
                "text": "the numbers were reduced it would blow every sensible defence planning out of proportion.'",
                "uris": null,
                "fig_num": null,
                "type_str": "figure"
            },
            "FIGREF4": {
                "num": null,
                "text": "PERS PRON precedes INDEF ATTR PERS PRON precedes SIMPLE INDEF DA PRON precedes INDEF ATTR DA PRON precedes SIMPLE INDEF DEMON PRON precedes INDEF ATTR DEMON PRON precedes SIMPLE INDEF GENERIC PRON precedes INDEF ATTR GENERIC PRON precedes SIMPLE INDEF",
                "uris": null,
                "fig_num": null,
                "type_str": "figure"
            },
            "TABREF1": {
                "content": "<table><tr><td>Context resource</td><td>IS label</td></tr><tr><td>discourse</td><td>D-GIVEN</td></tr><tr><td>context</td><td/></tr><tr><td>encyclopedic/</td><td>ACCESSIBLE-GENERAL</td></tr><tr><td>knowledge</td><td/></tr><tr><td>context</td><td/></tr><tr><td>environment/</td><td>SITUATIVE</td></tr><tr><td>situative</td><td/></tr><tr><td>context</td><td/></tr><tr><td>bridging</td><td>BRIDGING</td></tr><tr><td>context (scenario)</td><td/></tr><tr><td>accommodation</td><td>ACCESSIBLE-</td></tr><tr><td>(no context)</td><td/></tr></table>",
                "type_str": "table",
                "text": "IS classification for definites anaphoric relation",
                "html": null,
                "num": null
            },
            "TABREF2": {
                "content": "<table><tr><td>Type</td><td>IS label</td></tr><tr><td colspan=\"2\">unrelated to context NEW</td></tr><tr><td>part-whole relation</td><td>PARTITIVE</td></tr><tr><td>to previous entity</td><td/></tr><tr><td>other (unspecified)</td><td>INDEF-REL</td></tr><tr><td>relation to context</td><td/></tr></table>",
                "type_str": "table",
                "text": "Table 2 is proposed.",
                "html": null,
                "num": null
            },
            "TABREF3": {
                "content": "<table/>",
                "type_str": "table",
                "text": "IS classification for indefinitesThere are a few more subdivisions. Table3, for instance, contains the labels BRIDGING-CON-TAINED and PARTITIVE-CONTAINED, going back toPrince's (1981:236)  \"containing inferrables\". The entire IS label inventory used in this study comprises 19 (sub)classes in total.",
                "html": null,
                "num": null
            },
            "TABREF4": {
                "content": "<table><tr><td>Syntactic feature</td><td>Count</td></tr><tr><td colspan=\"2\">D-GIVEN-PRONOUN</td></tr><tr><td>PERS PRON</td><td>39</td></tr><tr><td>DA PRON</td><td>25</td></tr><tr><td>DEMON PRON</td><td>19</td></tr><tr><td>GENERIC PRON</td><td>11</td></tr><tr><td>NEW</td><td/></tr><tr><td>SIMPLE INDEF</td><td>113</td></tr><tr><td>INDEF ATTR</td><td>53</td></tr><tr><td>INDEF NUM</td><td>32</td></tr><tr><td>INDEF PPADJ</td><td>26</td></tr><tr><td>INDEF GEN</td><td>25</td></tr><tr><td>. . .</td><td/></tr></table>",
                "type_str": "table",
                "text": ".",
                "html": null,
                "num": null
            },
            "TABREF5": {
                "content": "<table/>",
                "type_str": "table",
                "text": "Syntactic characteristics of IS labelsCombining the most frequent syntactic characteristics with the asymmetries presented in Table3gives us Table6.8",
                "html": null,
                "num": null
            },
            "TABREF6": {
                "content": "<table><tr><td>Exact</td></tr></table>",
                "type_str": "table",
                "text": "Ranking Results for new model with ISinspired syntactic asymmetry features.We evaluate the string chosen by the log-linear model against the original treebank string in terms of exact match and BLEU score(Papineni et al.,",
                "html": null,
                "num": null
            },
            "TABREF7": {
                "content": "<table><tr><td colspan=\"2\">Label 1 (+ features)</td><td colspan=\"2\">Label 2 (+ features)</td><td>B/A Total</td></tr><tr><td colspan=\"2\">D-GIVEN-PRONOUN</td><td>INDEF-REL</td><td/><td>0</td><td>19</td></tr><tr><td>PERS PRON</td><td colspan=\"2\">39 INDEF ATTR</td><td>23</td></tr><tr><td>DA PRON</td><td colspan=\"2\">25 SIMPLE INDEF</td><td>17</td></tr><tr><td>DEMON PRON</td><td>19</td><td/><td/></tr><tr><td colspan=\"2\">GENERIC PRON 11</td><td/><td/></tr><tr><td colspan=\"2\">D-GIVEN-PRONOUN</td><td colspan=\"2\">D-GIVEN-CATAPHOR</td><td>0.1</td><td>11</td></tr><tr><td>PERS PRON</td><td colspan=\"2\">39 SIMPLE DEF</td><td>13</td></tr><tr><td>DA PRON</td><td colspan=\"2\">25 DA PRON</td><td>10</td></tr><tr><td>DEMON PRON</td><td>19</td><td/><td/></tr><tr><td colspan=\"2\">GENERIC PRON 11</td><td/><td/></tr><tr><td colspan=\"2\">D-GIVEN-REFLEXIVE</td><td>NEW</td><td/><td>0.11</td><td>31</td></tr><tr><td>REFL PRON</td><td colspan=\"3\">54 SIMPLE INDEF 113</td></tr><tr><td/><td/><td>INDEF ATTR</td><td>53</td></tr><tr><td/><td/><td>INDEF NUM</td><td>32</td></tr><tr><td/><td/><td>INDEF PPADJ</td><td>26</td></tr><tr><td/><td/><td>INDEF GEN</td><td>25</td></tr><tr><td/><td/><td>...</td><td/></tr></table>",
                "type_str": "table",
                "text": "An inventory of interesting syntactic characteristics in IS phrases",
                "html": null,
                "num": null
            },
            "TABREF8": {
                "content": "<table/>",
                "type_str": "table",
                "text": "IS asymmetric pairs augmented with syntactic characteristics",
                "html": null,
                "num": null
            },
            "TABREF10": {
                "content": "<table/>",
                "type_str": "table",
                "text": "Purely syntactic asymmetries",
                "html": null,
                "num": null
            }
        }
    }
}