{
    "paper_id": "P18-1164",
    "header": {
        "generated_with": "S2ORC 1.0.0",
        "date_generated": "2023-06-16T12:00:50.137645Z"
    },
    "title": "Attention Focusing for Neural Machine Translation by Bridging Source and Target Embeddings",
    "authors": [
        {
            "first": "Shaohui",
            "middle": [],
            "last": "Kuang",
            "suffix": "",
            "affiliation": {
                "laboratory": "",
                "institution": "Soochow University",
                "location": {
                    "settlement": "Suzhou",
                    "country": "China"
                }
            },
            "email": "shaohuikuang@foxmail.com"
        },
        {
            "first": "Junhui",
            "middle": [],
            "last": "Li",
            "suffix": "",
            "affiliation": {
                "laboratory": "",
                "institution": "Soochow University",
                "location": {
                    "settlement": "Suzhou",
                    "country": "China"
                }
            },
            "email": "lijunhui@suda.edu.cn"
        },
        {
            "first": "António",
            "middle": [],
            "last": "Branco",
            "suffix": "",
            "affiliation": {
                "laboratory": "NLX-Natural Language and Speech Group",
                "institution": "University of Lisbon",
                "location": {
                    "addrLine": "Campo Grande",
                    "postCode": "1749-016",
                    "settlement": "Lisboa, Portuga"
                }
            },
            "email": "antonio.branco@di.fc.ul.pt"
        },
        {
            "first": "Weihua",
            "middle": [],
            "last": "Luo",
            "suffix": "",
            "affiliation": {},
            "email": "weihua.luowh@alibaba-inc.com"
        },
        {
            "first": "Deyi",
            "middle": [],
            "last": "Xiong",
            "suffix": "",
            "affiliation": {
                "laboratory": "",
                "institution": "Soochow University",
                "location": {
                    "settlement": "Suzhou",
                    "country": "China"
                }
            },
            "email": "dyxiong@suda.edu.cn"
        }
    ],
    "year": "",
    "venue": null,
    "identifiers": {},
    "abstract": "In neural machine translation, a source sequence of words is encoded into a vector from which a target sequence is generated in the decoding phase. Differently from statistical machine translation, the associations between source words and their possible target counterparts are not explicitly stored. Source and target words are at the two ends of a long information processing procedure, mediated by hidden states at both the source encoding and the target decoding phases. This makes it possible that a source word is incorrectly translated into a target word that is not any of its admissible equivalent counterparts in the target language.",
    "pdf_parse": {
        "paper_id": "P18-1164",
        "_pdf_hash": "",
        "abstract": [
            {
                "text": "In neural machine translation, a source sequence of words is encoded into a vector from which a target sequence is generated in the decoding phase. Differently from statistical machine translation, the associations between source words and their possible target counterparts are not explicitly stored. Source and target words are at the two ends of a long information processing procedure, mediated by hidden states at both the source encoding and the target decoding phases. This makes it possible that a source word is incorrectly translated into a target word that is not any of its admissible equivalent counterparts in the target language.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Abstract",
                "sec_num": null
            }
        ],
        "body_text": [
            {
                "text": "In this paper, we seek to somewhat shorten the distance between source and target words in that procedure, and thus strengthen their association, by means of a method we term bridging source and target word embeddings. We experiment with three strategies: (1) a source-side bridging model, where source word embeddings are moved one step closer to the output target sequence; (2) a target-side bridging model, which explores the more relevant source word embeddings for the prediction of the target sequence; and (3) a direct bridging model, which directly connects source and target word embeddings seeking to minimize errors in the translation of ones by the others.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            },
            {
                "text": "Experiments and analysis presented in this paper demonstrate that the proposed bridging models are able to significantly * Corresponding author NMT, where x 1 , . . . , x T and h 1 , . . . , h T represent source-side word embeddings and hidden states respectively, c t represents a source-side context vector, s t a target-side decoder RNN hidden state, and y t a predicted word. Seeking to shorten the distance between source and target word embeddings, in what we term bridging, is the key insight for the advances presented in this paper.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            },
            {
                "text": "improve quality of both sentence translation, in general, and alignment and translation of individual source words with target words, in particular.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            },
            {
                "text": "Neural machine translation (NMT) is an endto-end approach to machine translation that has achieved competitive results vis-a-vis statistical machine translation (SMT) on various language pairs (Bahdanau et al., 2015; Cho et al., 2014; Sutskever et al., 2014; Luong and Manning, 2015) . In NMT, the sequence-to-sequence (seq2seq) model learns word embeddings for both source and target words synchronously. However, as illustrated in Figure 1 , source and target word embeddings are at the two ends of a long information processing procedure. The individual associations between them will gradually become loose due to the separation of source-side hidden states (represented by h 1 , . . . , h T in Fig. 1 ) and a target- side hidden state (represented by s t in Fig. 1 ). As a result, in the absence of a more tight interaction between source and target word pairs, the seq2seq model in NMT produces tentative translations that contain incorrect alignments of source words with target counterparts that are non-admissible equivalents in any possible translation context. Differently from SMT, in NMT an attention model is adopted to help align output with input words. The attention model is based on the estimation of a probability distribution over all input words for each target word. Word alignments with attention weights can then be easily deduced from such distributions and support the translation. Nevertheless, sometimes one finds translations by NMT that contain surprisingly wrong word alignments, that would unlikely occur in SMT.",
                "cite_spans": [
                    {
                        "start": 193,
                        "end": 216,
                        "text": "(Bahdanau et al., 2015;",
                        "ref_id": "BIBREF1"
                    },
                    {
                        "start": 217,
                        "end": 234,
                        "text": "Cho et al., 2014;",
                        "ref_id": "BIBREF3"
                    },
                    {
                        "start": 235,
                        "end": 258,
                        "text": "Sutskever et al., 2014;",
                        "ref_id": "BIBREF19"
                    },
                    {
                        "start": 259,
                        "end": 283,
                        "text": "Luong and Manning, 2015)",
                        "ref_id": null
                    }
                ],
                "ref_spans": [
                    {
                        "start": 440,
                        "end": 441,
                        "text": "1",
                        "ref_id": "FIGREF0"
                    },
                    {
                        "start": 704,
                        "end": 705,
                        "text": "1",
                        "ref_id": "FIGREF0"
                    },
                    {
                        "start": 768,
                        "end": 769,
                        "text": "1",
                        "ref_id": "FIGREF0"
                    }
                ],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "For instance, Figure 2 shows two Chineseto-English translation examples by NMT. In the top example, the NMT seq2seq model incorrectly aligns the target side end of sentence mark eos to 下旬/late with a high attention weight (0.80 in this example) due to the failure of appropriately capturing the similarity, or the lack of it, between the source word 下旬/late and the target eos. It is also worth noting that, as 本/this and 月/month end up not being translated in this example, inappropriate alignment of target side eos is likely the responsible factor for under translation in NMT as the decoding process ends once a target eos is generated. Statistics on our development data show that as much as 50% of target side eos do not properly align to source side eos.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 21,
                        "end": 22,
                        "text": "2",
                        "ref_id": "FIGREF1"
                    }
                ],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "The second example in Figure 2 shows another case where source words are translated into target items that are not their possible translations in that or in any other context. In particular, 冬奥 会/winter olympics is incorrectly translated into a target comma \",\" and 载誉/honors into have.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 29,
                        "end": 30,
                        "text": "2",
                        "ref_id": "FIGREF1"
                    }
                ],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "In this paper, to address the problem illustrated above, we seek to shorten the distance within the seq2seq NMT information processing procedure between source and target word embeddings. This is a method we term as bridging, and can be conceived as strengthening the focus of the attention mechanism into more translation-plausible source and target word alignments. In doing so, we hope that the seq2seq model is able to learn more appropriate word alignments between source and target words.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "We propose three simple yet effective strategies to bridge between word embeddings. The inspiring insight in all these three models is to move source word embeddings closer to target word embeddings along the seq2seq NMT information processing procedure. We categorize these strategies in terms of how close the source and target word embeddings are along that procedure, schematically depicted in Fig. 1 .",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 403,
                        "end": 404,
                        "text": "1",
                        "ref_id": "FIGREF0"
                    }
                ],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "(1) Source-side bridging model: Our first strategy for bridging, which we call source-side bridging, is to move source word embeddings just one step closer to the target end. Each source word embedding is concatenated with the respective source hidden state at the same position so that the attention model can more closely benefit from source word embeddings to produce word alignments.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "(2) Target-side bridging model: In a second more bold strategy, we seek to incorporate relevant source word embeddings more closely into the prediction of the next target hidden state. In particular, the most appropriate source words are selected according to their attention weights and they are made to more closely interact with target hidden states.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "(3) Direct bridging model: The third model consists of directly bridging between source and target word embeddings. The training objective is optimized towards minimizing the distance between target word embeddings and their most relevant source word embeddings, selected according to the attention model.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "Experiments on Chinese-English translation with extensive analysis demonstrate that directly bridging word embeddings at the two ends can produce better word alignments and thus achieve better translation. ",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "As suggested by Figure 1 , there may exist different ways to bridge between x and y t . We concentrate on the folowing three bridging models.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 23,
                        "end": 24,
                        "text": "1",
                        "ref_id": "FIGREF0"
                    }
                ],
                "eq_spans": [],
                "section": "Bridging Models",
                "sec_num": "2"
            },
            {
                "text": "Figure 3 illustrates the source-side bridging model. The encoder reads a word sequence equipped with word embeddings and generates a word annotation vector for each position. Then we simply concatenate the word annotation vector with its corresponding word embedding as the final annotation vector. For example, the final annotation vector h j for the word",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 7,
                        "end": 8,
                        "text": "3",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "Source-side Bridging Model",
                "sec_num": "2.1"
            },
            {
                "text": "x j in Fig- ure 3 is [ - → h j ; ← - h j ; x j ],",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Source-side Bridging Model",
                "sec_num": "2.1"
            },
            {
                "text": "where the first two sub-items",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Source-side Bridging Model",
                "sec_num": "2.1"
            },
            {
                "text": "[ - → h j ;",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Source-side Bridging Model",
                "sec_num": "2.1"
            },
            {
                "text": "←h j ] are the source-side forward and backward hidden states and x j is the corresponding word embedding. In this way, the word embeddings will not only have a more strong contribution in the computation of attention weights, but also be part of the annotation vector to form the weighted source context vector and consequently have a more strong impact in the prediction of target words.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Source-side Bridging Model",
                "sec_num": "2.1"
            },
            {
                "text": "While the above source-side bridging method uses the embeddings of all words for every target word, in the target-side method only more relevant source word embeddings for bridging are explored, rather than all of them. This is par- tially inspired by the word alignments from SMT, where words from the two ends are paired as they are possible translational equivalents of each other and those pairs are explicitly recorded and enter into the system inner workings. In particular, for a given target word, we explicitly determine the most likely source word aligned to it and use the word embedding of this source word to support the prediction of the target hidden state of the next target word to be generated.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Target-side Bridging Model",
                "sec_num": "2.2"
            },
            {
                "text": "Figure 4 schematically illustrates the target-side bridging method, where the input for computing the hidden state s t of the decoder is augmented by x t * , as follows:",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 7,
                        "end": 8,
                        "text": "4",
                        "ref_id": "FIGREF2"
                    }
                ],
                "eq_spans": [],
                "section": "Target-side Bridging Model",
                "sec_num": "2.2"
            },
            {
                "text": "EQUATION",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [
                    {
                        "start": 0,
                        "end": 8,
                        "text": "EQUATION",
                        "ref_id": "EQREF",
                        "raw_str": "s t = f (s t-1 , y t-1 , c t , x t * )",
                        "eq_num": "(1)"
                    }
                ],
                "section": "Target-side Bridging Model",
                "sec_num": "2.2"
            },
            {
                "text": "where x t * is the word embedding of the selected source word which has the highest attention weight:",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Target-side Bridging Model",
                "sec_num": "2.2"
            },
            {
                "text": "t * = arg max j (α tj ) (2)",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Target-side Bridging Model",
                "sec_num": "2.2"
            },
            {
                "text": "where α tj is the attention weight of each hidden state h j computed by the attention model",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Target-side Bridging Model",
                "sec_num": "2.2"
            },
            {
                "text": "Further to the above two bridging methods, which use source word embeddings to predict target words, we seek to bridge the word embeddings of the two ends in a more direct way. This is done by resorting to an auxiliary objective function to narrow the discrepancy between word embeddings of the two sides.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Direct Bridging Model",
                "sec_num": "2.3"
            },
            {
                "text": "Figure 5 is a schematic representation of our direct bridging method, with an auxiliary objective function. More specifically, the goal is to let the learned word embeddings on the two ends be transformable, i.e. if a target word e i aligns with a source word f j , a transformation matrix W is learned with the hope that the discrepancy of W x i and y j tends to be zero. Accordingly, we update the objective function of training for a single sentence with its following extended formulation:",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 7,
                        "end": 8,
                        "text": "5",
                        "ref_id": "FIGREF3"
                    }
                ],
                "eq_spans": [],
                "section": "Direct Bridging Model",
                "sec_num": "2.3"
            },
            {
                "text": "L(θ) = - Ty t=1 (log p(y t |y <t , x) -W x t * -y t 2 ) (3)",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Direct Bridging Model",
                "sec_num": "2.3"
            },
            {
                "text": "where log p(y t |y <t , x) is the original objective function of the NMT model, and the term W x t * -y t 2 measures and penalizes the difference between target word y t and its aligned source word x t * , i.e. the one with the highest attention weight, as computed in Equation 2. Similar to Mi et al. (2016) , we view the two parts of the loss in Equation 3 as equally important.",
                "cite_spans": [
                    {
                        "start": 292,
                        "end": 308,
                        "text": "Mi et al. (2016)",
                        "ref_id": "BIBREF14"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Direct Bridging Model",
                "sec_num": "2.3"
            },
            {
                "text": "At this juncture, it is worth noting the following:",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Direct Bridging Model",
                "sec_num": "2.3"
            },
            {
                "text": "• Our direct bridging model is an extension of the source-side bridging model, where the source word embeddings are part of the final annotation vector of the encoder. We have also tried to place the auxiliary object function directly on the NMT baseline model.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Direct Bridging Model",
                "sec_num": "2.3"
            },
            {
                "text": "However, our empirical study showed that the combined objective consistently worsens the translation quality. We blame this on that the learned word embeddings on two sides by the baseline model are too heterogeneous to be constrained.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Direct Bridging Model",
                "sec_num": "2.3"
            },
            {
                "text": "• Rather than using a concrete source word embedding x t * in Equation 3, we could also use a weighted sum of source word embeddings, i.e. j α tj h j . However, our preliminary experiments showed that the performance gap between these two methods is very small. Therefore, we use x t * to calculate the new training objective as shown in Equation 3 in all experiments.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Direct Bridging Model",
                "sec_num": "2.3"
            },
            {
                "text": "3 Experiments",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Direct Bridging Model",
                "sec_num": "2.3"
            },
            {
                "text": "As we have presented above three different methods to bridge between source and target word embeddings, in the present section we report on a series of experiments on Chinese to English translation that are undertaken to assess the effectiveness of those bridging methods.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Direct Bridging Model",
                "sec_num": "2.3"
            },
            {
                "text": "We resorted to Chinese-English bilingual corpora that contain 1.25M sentence pairs extracted from LDC corpora, with 27.9M Chinese words and 34.5M English words respectively. 1 We chose the NIST06 dataset as our development set, and the NIST02, NIST03, NIST04, NIST08 datasets as our test sets. We used the case-insensitive 4-gram NIST BLEU score as our evaluation metric (Papineni et al., 2002) and the script 'mteval-v11b.pl' to compute BLEU scores. We also report TER scores on our dataset (Snover et al., 2006) .",
                "cite_spans": [
                    {
                        "start": 371,
                        "end": 394,
                        "text": "(Papineni et al., 2002)",
                        "ref_id": "BIBREF17"
                    },
                    {
                        "start": 492,
                        "end": 513,
                        "text": "(Snover et al., 2006)",
                        "ref_id": "BIBREF18"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Experimental Settings",
                "sec_num": "3.1"
            },
            {
                "text": "For the efficient training of the neural networks, we limited the source (Chinese) and target (English) vocabularies to the most frequent 30k words, covering approximately 97.7% and 99.3% of the two corpora respectively. All the out-ofvocabulary words were mapped to the special token UNK. The dimension of word embedding was 620 and the size of the hidden layer was 1000. All other settings were the same as in Bahdanau et al. (2015) . The maximum length of sentences that we used to train the NMT model in our experiments was set to 50, for both the Chinese and English sides. Additionally, during decoding, we used the beam-search algorithm and set the beam size to 10. The model parameters were selected according to the maximum BLEU points on the development set.",
                "cite_spans": [
                    {
                        "start": 412,
                        "end": 434,
                        "text": "Bahdanau et al. (2015)",
                        "ref_id": "BIBREF1"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Experimental Settings",
                "sec_num": "3.1"
            },
            {
                "text": "We compared our proposed models against the following two systems:",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Experimental Settings",
                "sec_num": "3.1"
            },
            {
                "text": "• cdec (Dyer et al., 2010): this is an open source hierarchical phrase-based SMT system (Chiang, 2007) with default configuration and a 4-gram language model trained on the target side of the training data.",
                "cite_spans": [
                    {
                        "start": 7,
                        "end": 27,
                        "text": "(Dyer et al., 2010):",
                        "ref_id": "BIBREF6"
                    },
                    {
                        "start": 88,
                        "end": 102,
                        "text": "(Chiang, 2007)",
                        "ref_id": "BIBREF2"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Experimental Settings",
                "sec_num": "3.1"
            },
            {
                "text": "• RNNSearch*: this is an attention-based NMT system, taken from the dl4mt tutorial with slight changes. It improves the attention model by feeding the lastly generated word. For the activation function f of an RNN, we use the gated recurrent unit (GRU) (Chung et al., 2014) . Dropout was applied only on the output layer and the dropout (Hinton et al., 2012) rate was set to 0.5. We used the stochastic gradient descent algorithm with mini-batch and Adadelta (Zeiler, 2012) to train the NMT models. The minibatch was set to 80 sentences and decay rates ρ and ε of Adadelta were set to 0.95 and 10 -6 .",
                "cite_spans": [
                    {
                        "start": 253,
                        "end": 273,
                        "text": "(Chung et al., 2014)",
                        "ref_id": "BIBREF4"
                    },
                    {
                        "start": 337,
                        "end": 358,
                        "text": "(Hinton et al., 2012)",
                        "ref_id": "BIBREF8"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Experimental Settings",
                "sec_num": "3.1"
            },
            {
                "text": "For our NMT system with the direct bridging model, we use a simple pre-training strategy to train our model. We first train a regular attentionbased NMT model, then use this trained model to initialize the parameters of the NMT system equipped with the direct bridging model and randomly initialize the additional parameters of the direct bridging model in this NMT system. The reason of using pre-training strategy is that the embedding loss requires well-trained word alignment as a starting point.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Experimental Settings",
                "sec_num": "3.1"
            },
            {
                "text": "Table 1 displays the translation performance measured in terms of BLEU and TER scores. Clearly, every one of the three NMT models we proposed, with some bridging method, improve the translation accuracy over all test sets in comparison to the SMT (cdec) and NMT (RNNSearch*) baseline systems.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 6,
                        "end": 7,
                        "text": "1",
                        "ref_id": "TABREF0"
                    }
                ],
                "eq_spans": [],
                "section": "Experimental Results",
                "sec_num": "3.2"
            },
            {
                "text": "The three proposed models introduce new parameters in different ways. The source-side bridging model augments source hidden states from a dimension of 2,000 to 2,620, requiring 3.7M additional parameters to accommodate the hidden states that are appended. The target-side bridging model introduces 1.8M additional parameters for catering x t * in calculating target side state, as in Equation 1. Based on the source-side bridging model, the direct bridging model requires extra 0.4M parameters (i.e. the transformation matrix W in Equation 3 is 620 * 620), resulting in 4.1M additional parameters over the baseline. Given that the baseline model has 74.8M parameters, the size of extra parameters in our proposed models are comparably small.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Parameters",
                "sec_num": null
            },
            {
                "text": "The results in Table 1 indicate that all NMT systems outperform the SMT system taking into account the evaluation metrics considered, BLEU and TER. This is consistent with other studies on Chinese to English machine translation (Mi et al., 2016; Tu et al., 2016; Li et al., 2017) . Additionally, all the three NMT models with bridging mechanisms we proposed outperform the baseline NMT model RNNSearch*. With respect to BLEU scores, we observe a consistent trend that the target-side bridging model works better than the source-side bridging model, while the direct bridging model achieves the best accuracy over all test sets, with the only exception of NIST MT 08. On all test sets, the direct bridging model outperforms the baseline RNNSearch* by 1.81 BLEU points and outperforms the other two bridging-improved NMT models by 0.4∼0.6 BLEU points.",
                "cite_spans": [
                    {
                        "start": 228,
                        "end": 245,
                        "text": "(Mi et al., 2016;",
                        "ref_id": "BIBREF14"
                    },
                    {
                        "start": 246,
                        "end": 262,
                        "text": "Tu et al., 2016;",
                        "ref_id": "BIBREF21"
                    },
                    {
                        "start": 263,
                        "end": 279,
                        "text": "Li et al., 2017)",
                        "ref_id": "BIBREF9"
                    }
                ],
                "ref_spans": [
                    {
                        "start": 21,
                        "end": 22,
                        "text": "1",
                        "ref_id": "TABREF0"
                    }
                ],
                "eq_spans": [],
                "section": "Comparison with the baseline systems",
                "sec_num": null
            },
            {
                "text": "Though all models are not tuned on TER score, our three models perform favorably well with similar average improvement, of about 1.70 TER points, below the baseline model.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Comparison with the baseline systems",
                "sec_num": null
            },
            {
                "text": "As the direct bridging system proposed achieves the best performance, we further look at it and at Table 3: Confusion matrix for translation by POS, in percentage. To cope with fine-grained differences among verbs (e.g., VV, VC and VE in Chinese, and VB, VBD, VBP, etc. in English) , we merge all verbs into V. Similarly, we merged all nouns into N. CD stands for Cardinal numbers, JJ for adjectives or modifiers, AD for adverbs. These POS tags exist in both Chinese and English. For the sake of simplicity, for each target POS tag, we present only the two source POS tags that are more frequently aligned with it.",
                "cite_spans": [
                    {
                        "start": 221,
                        "end": 281,
                        "text": "VV, VC and VE in Chinese, and VB, VBD, VBP, etc. in English)",
                        "ref_id": null
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Analysis",
                "sec_num": "4"
            },
            {
                "text": "the RNNSearch* baseline system to gain further insight on how bridging may help in translation. Our approach presents superior results along all the dimensions assessed.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Analysis",
                "sec_num": "4"
            },
            {
                "text": "Since our improved model strengthens the focus of attention between pairs of translation equivalents by explicitly bridging source and target word embeddings, we expect to observe improved word alignment quality. The quality of the word alignment is examined from the following three aspects.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Analysis of Word Alignment",
                "sec_num": "4.1"
            },
            {
                "text": "As a special symbol marking the end of sentence, target side eos has a critical impact on controlling the length of the generated translation. A target eos is a correct translation when is aligned with the source eos. Table 2 displays the percentage of target side eos that are translations of the source side eos. It indicates that our model improved with bridging substantially achieves better translation of source eos.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 224,
                        "end": 225,
                        "text": "2",
                        "ref_id": "TABREF1"
                    }
                ],
                "eq_spans": [],
                "section": "Better eos translation",
                "sec_num": null
            },
            {
                "text": "To have a further insight into the quality of word translation, we group generated words by their part-of-speech (POS) tags and examine the POS of their aligned source words. 2 Table 3 is a confusion matrix for translations by POS. For example, under RNNSearch*, 64.95% of target verbs originate from verbs in the source 2 We used Stanford POS tagger (Toutanova et al., 2003) to get POS tags for the words in source sentences and their translations. side. This is enhanced to 66.29% in our direct bridging model. From the data in that table, one observes that in general more target words align to source words with the same POS tags in our improved system than in the baseline system.",
                "cite_spans": [
                    {
                        "start": 351,
                        "end": 375,
                        "text": "(Toutanova et al., 2003)",
                        "ref_id": "BIBREF20"
                    }
                ],
                "ref_spans": [
                    {
                        "start": 183,
                        "end": 184,
                        "text": "3",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "Better word translation",
                "sec_num": null
            },
            {
                "text": "Next we report on the quality of word alignment taking into account a manually aligned dataset, from Liu and Sun (2015) , which contains 900 manually aligned Chinese-English sentence pairs. We forced the decoder to output reference translations in order to get automatic alignments between input sentences and their reference translations yielded by the translation systems. To evaluate alignment performance, we measured the alignment error rate (AER) (Och and Ney, 2003) and the soft AER (SAER) (Tu et al., 2016) , which are registered in Table 4 . The data in this Table 4 indicate that, as expected, bridging improves the alignment quality as a consequence of its favoring of a stronger relationship between the source and target word embeddings of translational equivalents.",
                "cite_spans": [
                    {
                        "start": 101,
                        "end": 119,
                        "text": "Liu and Sun (2015)",
                        "ref_id": "BIBREF11"
                    },
                    {
                        "start": 453,
                        "end": 472,
                        "text": "(Och and Ney, 2003)",
                        "ref_id": "BIBREF16"
                    },
                    {
                        "start": 497,
                        "end": 514,
                        "text": "(Tu et al., 2016)",
                        "ref_id": "BIBREF21"
                    }
                ],
                "ref_spans": [
                    {
                        "start": 547,
                        "end": 548,
                        "text": "4",
                        "ref_id": "TABREF2"
                    },
                    {
                        "start": 574,
                        "end": 575,
                        "text": "4",
                        "ref_id": "TABREF2"
                    }
                ],
                "eq_spans": [],
                "section": "Better word alignment",
                "sec_num": null
            },
            {
                "text": "Following Bahdanau et al. (2015) , we partition sentences by their length and compute the respec- These results indicate that our improved system outperforms RNNSearch* for all the sentence lengths. They also reveal that the performance drops substantially when the length of the input sentence increases. This trend is consistent with the findings in (Cho et al., 2014; Tu et al., 2016; Li et al., 2017) .",
                "cite_spans": [
                    {
                        "start": 10,
                        "end": 32,
                        "text": "Bahdanau et al. (2015)",
                        "ref_id": "BIBREF1"
                    },
                    {
                        "start": 352,
                        "end": 370,
                        "text": "(Cho et al., 2014;",
                        "ref_id": "BIBREF3"
                    },
                    {
                        "start": 371,
                        "end": 387,
                        "text": "Tu et al., 2016;",
                        "ref_id": "BIBREF21"
                    },
                    {
                        "start": 388,
                        "end": 404,
                        "text": "Li et al., 2017)",
                        "ref_id": "BIBREF9"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Analysis of Long Sentence Translation",
                "sec_num": "4.2"
            },
            {
                "text": "One also observes that the NMT systems perform very badly on sentences of length over 50, when compared to the performance of the baseline SMT system (cdec). We think that the degradation of NMT systems performance over long sentences is due to the following reasons: (1) during training, the maximum source sentence length limit is set to 50, thus making the learned models not ready to cope well with sentences over this maximum length limit; (2) for long input sentences, NMT systems tend to stop early in the generation of the translation.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Analysis of Long Sentence Translation",
                "sec_num": "4.2"
            },
            {
                "text": "To assess the expectation that improved translation of eos improves the appropriate termination of the translations generated by the decoder, we analyze the performance of our best model with respect to over translation and under translation, which are both notoriously a hard problem for NMT.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Analysis of Over and Under Translation",
                "sec_num": "4.3"
            },
            {
                "text": "To estimate the over translation generated by an NMT system, we follow Li et al. (2017) and report the ratio of over translation (ROT) 3 , which is computed as the total number of times of over translation of words in a word set (e.g., all nouns in the source part of the test set) divided by the number of words in the word set.",
                "cite_spans": [
                    {
                        "start": 71,
                        "end": 87,
                        "text": "Li et al. (2017)",
                        "ref_id": "BIBREF9"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Analysis of Over and Under Translation",
                "sec_num": "4.3"
            },
            {
                "text": "Table 5 displays ROTs of words grouped by some prominent POS tags. These data indicate that both systems have higher over translation with proper nouns (NR) and other nouns (NN) than 3 please refer to (Li et al., 2017) with other POS tags, which is consistent with the results in (Li et al., 2017) . The likely reason is that these two POS tags usually have more unknown words, which are words that tend to be over translated. Importantly, these data also show that our direct bridging model alleviates the over translation issue by 15%, as ROT drops from 5.28% to 4.49%.",
                "cite_spans": [
                    {
                        "start": 201,
                        "end": 218,
                        "text": "(Li et al., 2017)",
                        "ref_id": "BIBREF9"
                    },
                    {
                        "start": 280,
                        "end": 297,
                        "text": "(Li et al., 2017)",
                        "ref_id": "BIBREF9"
                    }
                ],
                "ref_spans": [
                    {
                        "start": 6,
                        "end": 7,
                        "text": "5",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "Analysis of Over and Under Translation",
                "sec_num": "4.3"
            },
            {
                "text": "While it is hard to obtain an accurate estimation of under translation, we simply report 1-gram BLEU score that measures how many words in the translation outcome appear in the reference translation, roughly indicating the proportion of source words that are translated. Table 6 presents the average 1-gram BLEU scores on our test datasets. These data indicate that our improved system has a higher score than RNNSearch*, suggesting that it is less prone to under translation.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 277,
                        "end": 278,
                        "text": "6",
                        "ref_id": "TABREF4"
                    }
                ],
                "eq_spans": [],
                "section": "Analysis of Over and Under Translation",
                "sec_num": "4.3"
            },
            {
                "text": "It is also worth noting that the SMT baseline (cdec) presents the highest 1-gram BLEU score, as expected, given that under translation is known to be less of an issue for SMT.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Analysis of Over and Under Translation",
                "sec_num": "4.3"
            },
            {
                "text": "In the direct bridging model, we introduced a transformation matrix to convert a source-side word embedding into its counterpart on the target side. We seek now to assess the contribution of this transformation. Given a source word x i , we obtain its closest target word y * via:",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Analysis of Learned Word Embeddings",
                "sec_num": "4.4"
            },
            {
                "text": "EQUATION",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [
                    {
                        "start": 0,
                        "end": 8,
                        "text": "EQUATION",
                        "ref_id": "EQREF",
                        "raw_str": "y * = arg min y ( wx i -y )",
                        "eq_num": "(4)"
                    }
                ],
                "section": "Analysis of Learned Word Embeddings",
                "sec_num": "4.4"
            },
            {
                "text": "Table 7 lists the 10 more frequent source words and their corresponding closest target words. For the sake of comparison, it also displays their most likely translations from the lexical translation table in SMT. These results suggest that the closest target words obtained via the transformation matrix of our direct bridging method are very consistent with those obtained from the SMT lexical table, containing only admissible translation pairs. These data thus suggest that our improved model has a good capability of capturing the translation equivalence between source and target word embeddings.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 6,
                        "end": 7,
                        "text": "7",
                        "ref_id": "TABREF5"
                    }
                ],
                "eq_spans": [],
                "section": "Analysis of Learned Word Embeddings",
                "sec_num": "4.4"
            },
            {
                "text": "Since the pioneer work of Bahdanau et al. (2015) to jointly learning alignment and translation in NMT, many effective approaches have been proposed to further improve the alignment quality.",
                "cite_spans": [
                    {
                        "start": 26,
                        "end": 48,
                        "text": "Bahdanau et al. (2015)",
                        "ref_id": "BIBREF1"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Related Work",
                "sec_num": "5"
            },
            {
                "text": "The attention model plays a crucial role in the alignment quality and thus its enhancement has continuously attracted further efforts. To obtain better attention focuses, Luong et al. (2015) propose global and local attention models; and Cohn et al. (2016) extend the attentional model to include structural biases from word based alignment models, including positional bias, Markov conditioning, fertility and agreement over translation directions.",
                "cite_spans": [
                    {
                        "start": 171,
                        "end": 190,
                        "text": "Luong et al. (2015)",
                        "ref_id": null
                    },
                    {
                        "start": 238,
                        "end": 256,
                        "text": "Cohn et al. (2016)",
                        "ref_id": "BIBREF5"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Related Work",
                "sec_num": "5"
            },
            {
                "text": "In contrast, we did not delve into the attention model or sought to redesign it in our new bridging proposal. And yet we achieve enhanced align-ment quality by inducing the NMT model to capture more favorable pairs of words that are translation equivalents of each other under the effect of the bridging mechanism.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Related Work",
                "sec_num": "5"
            },
            {
                "text": "Recently there have been also studies towards leveraging word alignments from SMT models. Mi et al. (2016) and Liu et al. (2016) use preobtained word alignments to guide the NMT attention model in the learning of favorable word pairs. Arthur et al. (2016) leverage a pre-obtained word dictionary to constrain the prediction of target words. Despite these approaches having a somewhat similar motivation of using pairs of translation equivalents to benefit the NMT translation, in our new bridging approach we do not use extra resources in the NMT model, but let the model itself learn the similarity of word pairs from the training data. 4Besides, there exist also studies on the learning of cross-lingual embeddings for machine translation. Mikolov et al. (2013) propose to first learn distributed representation of words from large monolingual data, and then learn a linear mapping between vector spaces of languages. Gehring et al. (2017) introduce source word embeddings to predict target words. These approaches are somewhat similar to our source-side bridging model. However, inspired by the insight of shortening the distance between source and target embeddings in the seq2seq processing chain, in the present paper we propose more strategies to bridge source and target word embeddings and with better results.",
                "cite_spans": [
                    {
                        "start": 90,
                        "end": 106,
                        "text": "Mi et al. (2016)",
                        "ref_id": "BIBREF14"
                    },
                    {
                        "start": 111,
                        "end": 128,
                        "text": "Liu et al. (2016)",
                        "ref_id": "BIBREF10"
                    },
                    {
                        "start": 235,
                        "end": 255,
                        "text": "Arthur et al. (2016)",
                        "ref_id": "BIBREF0"
                    },
                    {
                        "start": 742,
                        "end": 763,
                        "text": "Mikolov et al. (2013)",
                        "ref_id": "BIBREF15"
                    },
                    {
                        "start": 920,
                        "end": 941,
                        "text": "Gehring et al. (2017)",
                        "ref_id": "BIBREF7"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Related Work",
                "sec_num": "5"
            },
            {
                "text": "We have presented three models to bridge source and target word embeddings for NMT. The three models seek to shorten the distance between source and target word embeddings along the extensive information procedure in the encoderdecoder neural network.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Conclusion",
                "sec_num": "6"
            },
            {
                "text": "Experiments on Chinese to English translation shows that the proposed models can significantly improve the translation quality. Further in-depth analysis demonstrate that our models are able (1) to learn better word alignments than the baseline NMT, (2) to alleviate the notorious problems of over and under translation in NMT, and (3) to learn direct mappings between source and target words.",
                "cite_spans": [
                    {
                        "start": 323,
                        "end": 327,
                        "text": "NMT,",
                        "ref_id": null
                    },
                    {
                        "start": 328,
                        "end": 335,
                        "text": "and (3)",
                        "ref_id": null
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Conclusion",
                "sec_num": "6"
            },
            {
                "text": "In future work, we will explore further strategies to bridge the source and target side for sequence-to-sequence and tree-based NMT. Additionally, we also intend to apply these methods to other sequence-to-sequence tasks, including natural language conversation.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Conclusion",
                "sec_num": "6"
            },
            {
                "text": "The corpora include LDC2002E18, LDC2003E07, LDC2003E14, Hansards portion of LDC2004T07, LDC2004T08 and LDC2005T06.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            },
            {
                "text": "Though the pre-obtained word alignments or word dictionaries can be learned from MT training data in an unsupervised fashion, these are still extra knowledge with respect to to the NMT models.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            }
        ],
        "back_matter": [
            {
                "text": "The present research was partly supported by the National Natural Science Foundation of China (Grant No. 61622209), the CNPTDeepMT grant of the Portugal-China Bilateral Exchange Program (ANI/3279/2016) and the Infrastructure for the Science and Technology of the Portuguese Language (PORTULAN / CLARIN).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Acknowledgment",
                "sec_num": null
            },
            {
                "text": "Target POS Tag Source POS Tag ",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "System",
                "sec_num": null
            }
        ],
        "bib_entries": {
            "BIBREF0": {
                "ref_id": "b0",
                "title": "Incorporating discrete translation lexicons into neural machine translation",
                "authors": [
                    {
                        "first": "Philip",
                        "middle": [],
                        "last": "Arthur",
                        "suffix": ""
                    },
                    {
                        "first": "Graham",
                        "middle": [],
                        "last": "Neubig",
                        "suffix": ""
                    },
                    {
                        "first": "Satoshi",
                        "middle": [],
                        "last": "Nakamura",
                        "suffix": ""
                    }
                ],
                "year": 2016,
                "venue": "Proceddings of EMNLP",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Philip Arthur, Graham Neubig, and Satoshi Nakamura. 2016. Incorporating discrete translation lexicons into neural machine translation. In Proceddings of EMNLP 2016.",
                "links": null
            },
            "BIBREF1": {
                "ref_id": "b1",
                "title": "Neural machine translation by jointly learning to align and translate",
                "authors": [
                    {
                        "first": "Dzmitry",
                        "middle": [],
                        "last": "Bahdanau",
                        "suffix": ""
                    },
                    {
                        "first": "Kyunghyun",
                        "middle": [],
                        "last": "Cho",
                        "suffix": ""
                    },
                    {
                        "first": "Yoshua",
                        "middle": [],
                        "last": "Bengio",
                        "suffix": ""
                    }
                ],
                "year": 2015,
                "venue": "Proceedings of ICLR 2015",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Dzmitry Bahdanau, Kyunghyun Cho, and Yoshua Ben- gio. 2015. Neural machine translation by jointly learning to align and translate. In Proceedings of ICLR 2015.",
                "links": null
            },
            "BIBREF2": {
                "ref_id": "b2",
                "title": "Hierarchical phrase-based translation. computational linguistics",
                "authors": [
                    {
                        "first": "David",
                        "middle": [],
                        "last": "Chiang",
                        "suffix": ""
                    }
                ],
                "year": 2007,
                "venue": "",
                "volume": "33",
                "issue": "",
                "pages": "201--228",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "David Chiang. 2007. Hierarchical phrase-based trans- lation. computational linguistics, 33(2):201-228.",
                "links": null
            },
            "BIBREF3": {
                "ref_id": "b3",
                "title": "Learning phrase representations using rnn encoder-decoder for statistical machine translation",
                "authors": [
                    {
                        "first": "Kyunghyun",
                        "middle": [],
                        "last": "Cho",
                        "suffix": ""
                    },
                    {
                        "first": "Bart",
                        "middle": [],
                        "last": "Van Merrienboer",
                        "suffix": ""
                    },
                    {
                        "first": "Dzmitry",
                        "middle": [],
                        "last": "Bahdanau Caglar Gulcehre",
                        "suffix": ""
                    },
                    {
                        "first": "Fethi",
                        "middle": [],
                        "last": "Bougares",
                        "suffix": ""
                    },
                    {
                        "first": "Holger",
                        "middle": [],
                        "last": "Schwenk",
                        "suffix": ""
                    },
                    {
                        "first": "Yoshua",
                        "middle": [],
                        "last": "Bengio",
                        "suffix": ""
                    }
                ],
                "year": 2014,
                "venue": "Proceedings of EMNLP 2014",
                "volume": "",
                "issue": "",
                "pages": "1724--1734",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Kyunghyun Cho, Bart van Merrienboer, Dzmitry Bah- danau Caglar Gulcehre, Fethi Bougares, Holger Schwenk, and Yoshua Bengio. 2014. Learning phrase representations using rnn encoder-decoder for statistical machine translation. In Proceedings of EMNLP 2014, pages 1724-1734.",
                "links": null
            },
            "BIBREF4": {
                "ref_id": "b4",
                "title": "Empirical evaluation of gated recurrent neural networks on sequence modeling",
                "authors": [
                    {
                        "first": "Junyoung",
                        "middle": [],
                        "last": "Chung",
                        "suffix": ""
                    },
                    {
                        "first": "Caglar",
                        "middle": [],
                        "last": "Gulcehre",
                        "suffix": ""
                    },
                    {
                        "first": "Kyunghyun",
                        "middle": [],
                        "last": "Cho",
                        "suffix": ""
                    },
                    {
                        "first": "Yoshua",
                        "middle": [],
                        "last": "Bengio",
                        "suffix": ""
                    }
                ],
                "year": 2014,
                "venue": "Proceedings of Deep Learning and Representation Learning Workshop in NIPS",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Junyoung Chung, Caglar Gulcehre, KyungHyun Cho, and Yoshua Bengio. 2014. Empirical evaluation of gated recurrent neural networks on sequence model- ing. In Proceedings of Deep Learning and Repre- sentation Learning Workshop in NIPS 2014.",
                "links": null
            },
            "BIBREF5": {
                "ref_id": "b5",
                "title": "Incorporating structural alignment biases into an attentional neural translation model",
                "authors": [
                    {
                        "first": "Trevor",
                        "middle": [],
                        "last": "Cohn",
                        "suffix": ""
                    },
                    {
                        "first": "Cong",
                        "middle": [],
                        "last": "Duy Vu",
                        "suffix": ""
                    },
                    {
                        "first": "Ekaterina",
                        "middle": [],
                        "last": "Hoang",
                        "suffix": ""
                    },
                    {
                        "first": "Kaisheng",
                        "middle": [],
                        "last": "Vymolova",
                        "suffix": ""
                    },
                    {
                        "first": "Chris",
                        "middle": [],
                        "last": "Yao",
                        "suffix": ""
                    },
                    {
                        "first": "Gholamreza",
                        "middle": [],
                        "last": "Dyer",
                        "suffix": ""
                    },
                    {
                        "first": "",
                        "middle": [],
                        "last": "Haffari",
                        "suffix": ""
                    }
                ],
                "year": 2016,
                "venue": "Proceedings of NAACL 2016",
                "volume": "",
                "issue": "",
                "pages": "876--885",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Trevor Cohn, Cong Duy Vu Hoang, Ekaterina Vy- molova, Kaisheng Yao, Chris Dyer, and Gholamreza Haffari. 2016. Incorporating structural alignment bi- ases into an attentional neural translation model. In Proceedings of NAACL 2016, pages 876-885.",
                "links": null
            },
            "BIBREF6": {
                "ref_id": "b6",
                "title": "cdec: A decoder, alignment, and learning framework for finite-state and context-free translation models",
                "authors": [
                    {
                        "first": "Chris",
                        "middle": [],
                        "last": "Dyer",
                        "suffix": ""
                    },
                    {
                        "first": "Jonathan",
                        "middle": [],
                        "last": "Weese",
                        "suffix": ""
                    },
                    {
                        "first": "Hendra",
                        "middle": [],
                        "last": "Setiawan",
                        "suffix": ""
                    },
                    {
                        "first": "Adam",
                        "middle": [],
                        "last": "Lopez",
                        "suffix": ""
                    },
                    {
                        "first": "Ferhan",
                        "middle": [],
                        "last": "Ture",
                        "suffix": ""
                    },
                    {
                        "first": "Vladimir",
                        "middle": [],
                        "last": "Eidelman",
                        "suffix": ""
                    },
                    {
                        "first": "Juri",
                        "middle": [],
                        "last": "Ganitkevitch",
                        "suffix": ""
                    },
                    {
                        "first": "Phil",
                        "middle": [],
                        "last": "Blunsom",
                        "suffix": ""
                    },
                    {
                        "first": "Philip",
                        "middle": [],
                        "last": "Resnik",
                        "suffix": ""
                    }
                ],
                "year": 2010,
                "venue": "Proceedings of the ACL 2010 System Demonstrations",
                "volume": "",
                "issue": "",
                "pages": "7--12",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Chris Dyer, Jonathan Weese, Hendra Setiawan, Adam Lopez, Ferhan Ture, Vladimir Eidelman, Juri Gan- itkevitch, Phil Blunsom, and Philip Resnik. 2010. cdec: A decoder, alignment, and learning framework for finite-state and context-free translation models. In Proceedings of the ACL 2010 System Demonstra- tions, pages 7-12. Association for Computational Linguistics.",
                "links": null
            },
            "BIBREF7": {
                "ref_id": "b7",
                "title": "Convolutional sequence to sequence learning",
                "authors": [
                    {
                        "first": "Jonas",
                        "middle": [],
                        "last": "Gehring",
                        "suffix": ""
                    },
                    {
                        "first": "Michael",
                        "middle": [],
                        "last": "Auli",
                        "suffix": ""
                    },
                    {
                        "first": "David",
                        "middle": [],
                        "last": "Grangier",
                        "suffix": ""
                    },
                    {
                        "first": "Denis",
                        "middle": [],
                        "last": "Yarats",
                        "suffix": ""
                    },
                    {
                        "first": "Yann",
                        "middle": [
                            "N"
                        ],
                        "last": "Dauphin",
                        "suffix": ""
                    }
                ],
                "year": 2017,
                "venue": "",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {
                    "arXiv": [
                        "arXiv:1705.03122"
                    ]
                },
                "num": null,
                "urls": [],
                "raw_text": "Jonas Gehring, Michael Auli, David Grangier, De- nis Yarats, and Yann N Dauphin. 2017. Convolu- tional sequence to sequence learning. arXiv preprint arXiv:1705.03122.",
                "links": null
            },
            "BIBREF8": {
                "ref_id": "b8",
                "title": "Improving neural networks by preventing coadaptation of feature detectors",
                "authors": [
                    {
                        "first": "Geoffrey",
                        "middle": [
                            "E"
                        ],
                        "last": "Hinton",
                        "suffix": ""
                    },
                    {
                        "first": "Nitish",
                        "middle": [],
                        "last": "Srivastava",
                        "suffix": ""
                    },
                    {
                        "first": "Alex",
                        "middle": [],
                        "last": "Krizhevsky",
                        "suffix": ""
                    },
                    {
                        "first": "Ilya",
                        "middle": [],
                        "last": "Sutskever",
                        "suffix": ""
                    },
                    {
                        "first": "Ruslan",
                        "middle": [
                            "R"
                        ],
                        "last": "Salakhutdinov",
                        "suffix": ""
                    }
                ],
                "year": 2012,
                "venue": "",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {
                    "arXiv": [
                        "arXiv:1207.0580"
                    ]
                },
                "num": null,
                "urls": [],
                "raw_text": "Geoffrey E Hinton, Nitish Srivastava, Alex Krizhevsky, Ilya Sutskever, and Ruslan R Salakhutdinov. 2012. Improving neural networks by preventing co- adaptation of feature detectors. arXiv preprint arXiv:1207.0580.",
                "links": null
            },
            "BIBREF9": {
                "ref_id": "b9",
                "title": "Modeling source syntax for neural machine translation",
                "authors": [
                    {
                        "first": "Junhui",
                        "middle": [],
                        "last": "Li",
                        "suffix": ""
                    },
                    {
                        "first": "Deyi",
                        "middle": [],
                        "last": "Xiong",
                        "suffix": ""
                    },
                    {
                        "first": "Zhaopeng",
                        "middle": [],
                        "last": "Tu",
                        "suffix": ""
                    },
                    {
                        "first": "Muhua",
                        "middle": [],
                        "last": "Zhu",
                        "suffix": ""
                    },
                    {
                        "first": "Min",
                        "middle": [],
                        "last": "Zhang",
                        "suffix": ""
                    },
                    {
                        "first": "Guodong",
                        "middle": [],
                        "last": "Zhou",
                        "suffix": ""
                    }
                ],
                "year": 2017,
                "venue": "Proceedings of ACL",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Junhui Li, Deyi Xiong, Zhaopeng Tu, Muhua Zhu, Min Zhang, and Guodong Zhou. 2017. Modeling source syntax for neural machine translation. In Proceed- ings of ACL 2017.",
                "links": null
            },
            "BIBREF10": {
                "ref_id": "b10",
                "title": "Neural machine translation with supervised attention",
                "authors": [
                    {
                        "first": "Lemao",
                        "middle": [],
                        "last": "Liu",
                        "suffix": ""
                    },
                    {
                        "first": "Masao",
                        "middle": [],
                        "last": "Utiyama",
                        "suffix": ""
                    },
                    {
                        "first": "Andrew",
                        "middle": [],
                        "last": "Finch",
                        "suffix": ""
                    },
                    {
                        "first": "Eiichiro",
                        "middle": [],
                        "last": "Sumita",
                        "suffix": ""
                    }
                ],
                "year": 2016,
                "venue": "Proceddings of COLING",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Lemao Liu, Masao Utiyama, Andrew Finch, and Ei- ichiro Sumita. 2016. Neural machine translation with supervised attention. In In Proceddings of COLING 2016.",
                "links": null
            },
            "BIBREF11": {
                "ref_id": "b11",
                "title": "Contrastive unsupervised word alignment with non-local features",
                "authors": [
                    {
                        "first": "Yang",
                        "middle": [],
                        "last": "Liu",
                        "suffix": ""
                    },
                    {
                        "first": "Maosong",
                        "middle": [],
                        "last": "Sun",
                        "suffix": ""
                    }
                ],
                "year": 2015,
                "venue": "Proceedings of AAAI 2015",
                "volume": "",
                "issue": "",
                "pages": "2295--2301",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Yang Liu and Maosong Sun. 2015. Contrastive unsu- pervised word alignment with non-local features. In Proceedings of AAAI 2015, pages 2295-2301.",
                "links": null
            },
            "BIBREF12": {
                "ref_id": "b12",
                "title": "Stanford neural machine translation systems for spoken language domains",
                "authors": [
                    {
                        "first": "Minh-Thang",
                        "middle": [],
                        "last": "Luong",
                        "suffix": ""
                    },
                    {
                        "first": "Christopher",
                        "middle": [
                            "D"
                        ],
                        "last": "Manning",
                        "suffix": ""
                    }
                ],
                "year": 2015,
                "venue": "Proceedings of the International Workshop on Spoken Language Translation",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Minh-Thang Luong and Christopher D Manning. 2015. Stanford neural machine translation systems for spo- ken language domains. In Proceedings of the In- ternational Workshop on Spoken Language Transla- tion.",
                "links": null
            },
            "BIBREF13": {
                "ref_id": "b13",
                "title": "Effective approaches to attentionbased neural machine translation",
                "authors": [
                    {
                        "first": "Minh-Thang",
                        "middle": [],
                        "last": "Luong",
                        "suffix": ""
                    },
                    {
                        "first": "Hieu",
                        "middle": [],
                        "last": "Pham",
                        "suffix": ""
                    },
                    {
                        "first": "Christopher",
                        "middle": [
                            "D"
                        ],
                        "last": "Manning",
                        "suffix": ""
                    }
                ],
                "year": 2015,
                "venue": "Proceedings of EMNLP 2015",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Minh-Thang Luong, Hieu Pham, and Christopher D Manning. 2015. Effective approaches to attention- based neural machine translation. In Proceedings of EMNLP 2015.",
                "links": null
            },
            "BIBREF14": {
                "ref_id": "b14",
                "title": "Supervised attentions for neural machine translation",
                "authors": [
                    {
                        "first": "Haitao",
                        "middle": [],
                        "last": "Mi",
                        "suffix": ""
                    },
                    {
                        "first": "Zhiguo",
                        "middle": [],
                        "last": "Wang",
                        "suffix": ""
                    },
                    {
                        "first": "Abe",
                        "middle": [],
                        "last": "Ittycheriah",
                        "suffix": ""
                    }
                ],
                "year": 2016,
                "venue": "Proceddings of EMNLP",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Haitao Mi, Zhiguo Wang, and Abe Ittycheriah. 2016. Supervised attentions for neural machine translation. In Proceddings of EMNLP 2016.",
                "links": null
            },
            "BIBREF15": {
                "ref_id": "b15",
                "title": "Exploiting similarities among languages for machine translation",
                "authors": [
                    {
                        "first": "Tomas",
                        "middle": [],
                        "last": "Mikolov",
                        "suffix": ""
                    },
                    {
                        "first": "Ilya",
                        "middle": [],
                        "last": "Quoc V Le",
                        "suffix": ""
                    },
                    {
                        "first": "",
                        "middle": [],
                        "last": "Sutskever",
                        "suffix": ""
                    }
                ],
                "year": 2013,
                "venue": "",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {
                    "arXiv": [
                        "arXiv:1309.4168"
                    ]
                },
                "num": null,
                "urls": [],
                "raw_text": "Tomas Mikolov, Quoc V Le, and Ilya Sutskever. 2013. Exploiting similarities among languages for ma- chine translation. arXiv preprint arXiv:1309.4168.",
                "links": null
            },
            "BIBREF16": {
                "ref_id": "b16",
                "title": "A systematic comparison of various statistical alignment models",
                "authors": [
                    {
                        "first": "Josef",
                        "middle": [],
                        "last": "Franz",
                        "suffix": ""
                    },
                    {
                        "first": "Hermann",
                        "middle": [],
                        "last": "Och",
                        "suffix": ""
                    },
                    {
                        "first": "",
                        "middle": [],
                        "last": "Ney",
                        "suffix": ""
                    }
                ],
                "year": 2003,
                "venue": "Computational linguistics",
                "volume": "29",
                "issue": "1",
                "pages": "19--51",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Franz Josef Och and Hermann Ney. 2003. A systematic comparison of various statistical alignment models. Computational linguistics, 29(1):19-51.",
                "links": null
            },
            "BIBREF17": {
                "ref_id": "b17",
                "title": "Bleu: a method for automatic evaluation of machine translation",
                "authors": [
                    {
                        "first": "Kishore",
                        "middle": [],
                        "last": "Papineni",
                        "suffix": ""
                    },
                    {
                        "first": "Salim",
                        "middle": [],
                        "last": "Roukos",
                        "suffix": ""
                    },
                    {
                        "first": "Todd",
                        "middle": [],
                        "last": "Ward",
                        "suffix": ""
                    },
                    {
                        "first": "Wei-Jing",
                        "middle": [],
                        "last": "Zhu",
                        "suffix": ""
                    }
                ],
                "year": 2002,
                "venue": "Proceedings of ACL 2002",
                "volume": "",
                "issue": "",
                "pages": "311--318",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Kishore Papineni, Salim Roukos, Todd Ward, and Wei- Jing Zhu. 2002. Bleu: a method for automatic eval- uation of machine translation. In Proceedings of ACL 2002, pages 311-318. Association for Compu- tational Linguistics.",
                "links": null
            },
            "BIBREF18": {
                "ref_id": "b18",
                "title": "A study of translation edit rate with targeted human annotation",
                "authors": [
                    {
                        "first": "Matthew",
                        "middle": [],
                        "last": "Snover",
                        "suffix": ""
                    },
                    {
                        "first": "Bonnie",
                        "middle": [],
                        "last": "Dorr",
                        "suffix": ""
                    },
                    {
                        "first": "Richard",
                        "middle": [],
                        "last": "Schwartz",
                        "suffix": ""
                    },
                    {
                        "first": "Linnea",
                        "middle": [],
                        "last": "Micciulla",
                        "suffix": ""
                    },
                    {
                        "first": "John",
                        "middle": [],
                        "last": "Makhoul",
                        "suffix": ""
                    }
                ],
                "year": 2006,
                "venue": "Proceddings of AMTA",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Matthew Snover, Bonnie Dorr, Richard Schwartz, Lin- nea Micciulla, and John Makhoul. 2006. A study of translation edit rate with targeted human annotation. In Proceddings of AMTA 2006.",
                "links": null
            },
            "BIBREF19": {
                "ref_id": "b19",
                "title": "Sequence to sequence learning with neural networks",
                "authors": [
                    {
                        "first": "Ilya",
                        "middle": [],
                        "last": "Sutskever",
                        "suffix": ""
                    },
                    {
                        "first": "Oriol",
                        "middle": [],
                        "last": "Vinyals",
                        "suffix": ""
                    },
                    {
                        "first": "Quoc V",
                        "middle": [],
                        "last": "Le",
                        "suffix": ""
                    }
                ],
                "year": 2014,
                "venue": "Proceedings of NIPS 2014",
                "volume": "",
                "issue": "",
                "pages": "3104--3112",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Ilya Sutskever, Oriol Vinyals, and Quoc V Le. 2014. Sequence to sequence learning with neural net- works. In Proceedings of NIPS 2014, pages 3104- 3112.",
                "links": null
            },
            "BIBREF20": {
                "ref_id": "b20",
                "title": "Feature-rich part-ofspeech tagging with a cyclic dependency network",
                "authors": [
                    {
                        "first": "Kristina",
                        "middle": [],
                        "last": "Toutanova",
                        "suffix": ""
                    },
                    {
                        "first": "Dan",
                        "middle": [],
                        "last": "Klein",
                        "suffix": ""
                    },
                    {
                        "first": "Christopher",
                        "middle": [],
                        "last": "Manning",
                        "suffix": ""
                    },
                    {
                        "first": "Yoram",
                        "middle": [],
                        "last": "Singer",
                        "suffix": ""
                    }
                ],
                "year": 2003,
                "venue": "Proceedings of HLT-NAACL 2003",
                "volume": "",
                "issue": "",
                "pages": "252--259",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Kristina Toutanova, Dan Klein, Christopher Manning, and Yoram Singer. 2003. Feature-rich part-of- speech tagging with a cyclic dependency network. In Proceedings of HLT-NAACL 2003, pages 252- 259.",
                "links": null
            },
            "BIBREF21": {
                "ref_id": "b21",
                "title": "Modeling coverage for neural machine translation",
                "authors": [
                    {
                        "first": "Zhaopeng",
                        "middle": [],
                        "last": "Tu",
                        "suffix": ""
                    },
                    {
                        "first": "Zhengdong",
                        "middle": [],
                        "last": "Lu",
                        "suffix": ""
                    },
                    {
                        "first": "Yang",
                        "middle": [],
                        "last": "Liu",
                        "suffix": ""
                    },
                    {
                        "first": "Xiaohua",
                        "middle": [],
                        "last": "Liu",
                        "suffix": ""
                    },
                    {
                        "first": "Hang",
                        "middle": [],
                        "last": "Li",
                        "suffix": ""
                    }
                ],
                "year": 2016,
                "venue": "Proceedings of ACL 2016",
                "volume": "",
                "issue": "",
                "pages": "76--85",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Zhaopeng Tu, Zhengdong Lu, Yang Liu, Xiaohua Liu, and Hang Li. 2016. Modeling coverage for neural machine translation. In Proceedings of ACL 2016, pages 76-85.",
                "links": null
            },
            "BIBREF22": {
                "ref_id": "b22",
                "title": "Adadelta: an adaptive learning rate method",
                "authors": [
                    {
                        "first": "D",
                        "middle": [],
                        "last": "Matthew",
                        "suffix": ""
                    },
                    {
                        "first": "",
                        "middle": [],
                        "last": "Zeiler",
                        "suffix": ""
                    }
                ],
                "year": 2012,
                "venue": "",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {
                    "arXiv": [
                        "arXiv:1212.5701"
                    ]
                },
                "num": null,
                "urls": [],
                "raw_text": "Matthew D Zeiler. 2012. Adadelta: an adaptive learn- ing rate method. arXiv preprint arXiv:1212.5701.",
                "links": null
            }
        },
        "ref_entries": {
            "FIGREF0": {
                "num": null,
                "text": "Figure1: Schematic representation of seq2seq NMT, where x 1 , . . . , x T and h 1 , . . . , h T represent source-side word embeddings and hidden states respectively, c t represents a source-side context vector, s t a target-side decoder RNN hidden state, and y t a predicted word. Seeking to shorten the distance between source and target word embeddings, in what we term bridging, is the key insight for the advances presented in this paper.",
                "uris": null,
                "fig_num": "1",
                "type_str": "figure"
            },
            "FIGREF1": {
                "num": null,
                "text": "Figure 2: Examples of NMT output with incorrect alignments of source and target words that cannot be the translation of each other in any possible context.",
                "uris": null,
                "fig_num": "2",
                "type_str": "figure"
            },
            "FIGREF2": {
                "num": null,
                "text": "Figure 3: Architecture of the source-side bridging model.",
                "uris": null,
                "fig_num": "4",
                "type_str": "figure"
            },
            "FIGREF3": {
                "num": null,
                "text": "Figure 5: Architecture of direct bridging model.",
                "uris": null,
                "fig_num": "5",
                "type_str": "figure"
            },
            "FIGREF4": {
                "num": null,
                "text": "Figure 6: BLEU scores for the translation of sentences with different lengths.",
                "uris": null,
                "fig_num": "6",
                "type_str": "figure"
            },
            "TABREF0": {
                "content": "<table><tr><td/><td>Model</td><td colspan=\"6\">NIST06 NIST02 NIST03 NIST04 NIST08 Avg</td></tr><tr><td/><td>cdec (SMT)</td><td>34.00</td><td>35.81</td><td>34.70</td><td>37.15</td><td>25.28</td><td>33.23</td></tr><tr><td/><td>RNNSearch*</td><td>35.92</td><td>37.88</td><td>36.21</td><td>38.83</td><td>26.30</td><td>34.81</td></tr><tr><td>BLEU</td><td colspan=\"2\">Source bridging 36.79 ‡</td><td>38.71 ‡</td><td>37.24 ‡</td><td>40.28 ‡</td><td>27.40 ‡</td><td>35.91</td></tr><tr><td/><td>Target bridging</td><td>36.69</td><td>39.04 ‡</td><td>37.63 ‡</td><td>40.41 ‡</td><td>27.98 ‡</td><td>36.27</td></tr><tr><td/><td>Direct bridging</td><td>36.97 ‡</td><td>39.77 ‡</td><td>38.02 ‡</td><td>40.83 ‡</td><td>27.85 ‡</td><td>36.62</td></tr><tr><td/><td>cdec (SMT)</td><td>58.29</td><td>59.65</td><td>59.28</td><td>58.12</td><td>61.54</td><td>59.64</td></tr><tr><td/><td>RNNSearch*</td><td>59.56</td><td>57.79</td><td>59.25</td><td>57.88</td><td>64.22</td><td>59.78</td></tr><tr><td>TER</td><td colspan=\"2\">Source bridging 58.13</td><td>56.25</td><td>57.33</td><td>56.32</td><td>62.13</td><td>58.01</td></tr><tr><td/><td>Target bridging</td><td>58.01</td><td>56.27</td><td>57.76</td><td>56.33</td><td>62.12</td><td>58.12</td></tr><tr><td/><td>Direct bridging</td><td>57.20</td><td>56.68</td><td>57.29</td><td>55.62</td><td>62.49</td><td>58.02</td></tr></table>",
                "type_str": "table",
                "text": "BLEU and TER scores on the NIST Chinese-English translation tasks. The BLEU scores are case-insensitive. Avg means the average scores on all test sets. \" ‡\": statistically better than RNNSearch* (p < 0.01). Higher BLEU (or lower TER) scores indicate better translation quality.",
                "html": null,
                "num": null
            },
            "TABREF1": {
                "content": "<table><tr><td>System</td><td>Percentage (%)</td></tr><tr><td>RNNSearch*</td><td>49.82</td></tr><tr><td>Direct bridging</td><td>81.30</td></tr></table>",
                "type_str": "table",
                "text": "Percentage of target side eos translated from source side eos on the development set.",
                "html": null,
                "num": null
            },
            "TABREF2": {
                "content": "<table><tr><td/><td colspan=\"2\">SAER AER</td></tr><tr><td>RNNSearch*</td><td>62.68</td><td>47.61</td></tr><tr><td>Direct bridging</td><td>59.72</td><td>44.71</td></tr></table>",
                "type_str": "table",
                "text": "Alignment error rate (AER) and soft AER. quality. A lower score indicates better alignment.",
                "html": null,
                "num": null
            },
            "TABREF3": {
                "content": "<table><tr><td>System</td><td colspan=\"2\">POS ROT(%)</td></tr><tr><td/><td>NN</td><td>8.63</td></tr><tr><td/><td>NR</td><td>12.92</td></tr><tr><td>RNNSearch*</td><td>DT</td><td>4.01</td></tr><tr><td/><td>CD</td><td>7.05</td></tr><tr><td/><td>ALL</td><td>5.28</td></tr><tr><td/><td>NN</td><td>7.56</td></tr><tr><td/><td>NR</td><td>10.88</td></tr><tr><td>Direct bridging</td><td>DT</td><td>2.37</td></tr><tr><td/><td>CD</td><td>4.79</td></tr><tr><td/><td>ALL</td><td>4.49</td></tr><tr><td colspan=\"3\">Table 5: Ratios of over translation (ROT) on test</td></tr><tr><td colspan=\"3\">sets. NN stands for nouns excluding proper nouns</td></tr><tr><td colspan=\"3\">and temporal nouns, NR for proper nouns, DT for</td></tr><tr><td colspan=\"3\">determiners, and CD for cardinal numbers.</td></tr><tr><td>System</td><td colspan=\"2\">1-gram BLEU</td></tr><tr><td>cdec (SMT)</td><td/><td>77.09</td></tr><tr><td>RNNSearch*</td><td/><td>72.70</td></tr><tr><td>Direct bridging</td><td/><td>74.22</td></tr></table>",
                "type_str": "table",
                "text": "for more details of ROT.",
                "html": null,
                "num": null
            },
            "TABREF4": {
                "content": "<table><tr><td>: 1-gram BLEU scores averaged on test</td></tr><tr><td>sets, supporting the assessment of under transla-</td></tr><tr><td>tion. A larger score indicates less under transla-</td></tr><tr><td>tion.</td></tr></table>",
                "type_str": "table",
                "text": "",
                "html": null,
                "num": null
            },
            "TABREF5": {
                "content": "<table><tr><td>Src</td><td colspan=\"2\">Transformation Lexical Table</td></tr><tr><td>是</td><td>is</td><td>is</td></tr><tr><td>和</td><td>and</td><td>and</td></tr><tr><td>及</td><td>and</td><td>and</td></tr><tr><td>将</td><td>will</td><td>will</td></tr><tr><td>会</td><td>will</td><td>will</td></tr><tr><td>国</td><td>countries</td><td>countries</td></tr><tr><td>发展</td><td>development</td><td>development</td></tr><tr><td>经济</td><td>economic</td><td>economic</td></tr><tr><td>问题</td><td>question</td><td>issue</td></tr><tr><td>人民</td><td>people</td><td>people</td></tr></table>",
                "type_str": "table",
                "text": "Top 10 more frequent source words and their closest translations obtained, respectively, by embedding transformation in NMT and from the lexical translation table in SMT.",
                "html": null,
                "num": null
            }
        }
    }
}