{
    "paper_id": "P19-1184",
    "header": {
        "generated_with": "S2ORC 1.0.0",
        "date_generated": "2023-06-16T12:13:32.132580Z"
    },
    "title": "The PhotoBook Dataset: Building Common Ground through Visually-Grounded Dialogue",
    "authors": [
        {
            "first": "Janosch",
            "middle": [],
            "last": "Haber",
            "suffix": "",
            "affiliation": {
                "laboratory": "",
                "institution": "Tilburg University",
                "location": {}
            },
            "email": "j.haber@qmul.ac.uk"
        },
        {
            "first": "Tim",
            "middle": [],
            "last": "Baumgärtner",
            "suffix": "",
            "affiliation": {
                "laboratory": "",
                "institution": "University of Amsterdam",
                "location": {}
            },
            "email": ""
        },
        {
            "first": "Ece",
            "middle": [],
            "last": "Takmaz",
            "suffix": "",
            "affiliation": {
                "laboratory": "",
                "institution": "University of Amsterdam",
                "location": {}
            },
            "email": ""
        },
        {
            "first": "Lieke",
            "middle": [],
            "last": "Gelderloos",
            "suffix": "",
            "affiliation": {},
            "email": "l.j.gelderloos@tilburguniversity.edu"
        },
        {
            "first": "Elia",
            "middle": [],
            "last": "Bruni",
            "suffix": "",
            "affiliation": {
                "laboratory": "",
                "institution": "Universitat Pompeu Fabra",
                "location": {}
            },
            "email": ""
        },
        {
            "first": "Raquel",
            "middle": [],
            "last": "Fernández",
            "suffix": "",
            "affiliation": {
                "laboratory": "",
                "institution": "University of Amsterdam",
                "location": {}
            },
            "email": ""
        }
    ],
    "year": "",
    "venue": null,
    "identifiers": {},
    "abstract": "This paper introduces the PhotoBook dataset, a large-scale collection of visually-grounded, task-oriented dialogues in English designed to investigate shared dialogue history accumulating during conversation. Taking inspiration from seminal work on dialogue analysis, we propose a data-collection task formulated as a collaborative game prompting two online participants to refer to images utilising both their visual context as well as previously established referring expressions. We provide a detailed description of the task setup and a thorough analysis of the 2,500 dialogues collected. To further illustrate the novel features of the dataset, we propose a baseline model for reference resolution which uses a simple method to take into account shared information accumulated in a reference chain. Our results show that this information is particularly important to resolve later descriptions and underline the need to develop more sophisticated models of common ground in dialogue interaction. 1 ",
    "pdf_parse": {
        "paper_id": "P19-1184",
        "_pdf_hash": "",
        "abstract": [
            {
                "text": "This paper introduces the PhotoBook dataset, a large-scale collection of visually-grounded, task-oriented dialogues in English designed to investigate shared dialogue history accumulating during conversation. Taking inspiration from seminal work on dialogue analysis, we propose a data-collection task formulated as a collaborative game prompting two online participants to refer to images utilising both their visual context as well as previously established referring expressions. We provide a detailed description of the task setup and a thorough analysis of the 2,500 dialogues collected. To further illustrate the novel features of the dataset, we propose a baseline model for reference resolution which uses a simple method to take into account shared information accumulated in a reference chain. Our results show that this information is particularly important to resolve later descriptions and underline the need to develop more sophisticated models of common ground in dialogue interaction. 1 ",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Abstract",
                "sec_num": null
            }
        ],
        "body_text": [
            {
                "text": "The past few years have seen an increasing interest in developing computational agents for visually grounded dialogue, the task of using natural language to communicate about visual content in a multi-agent setup. The models developed for this task often focus on specific aspects such as image labelling (Mao et al., 2016; Vedantam et al., 2017) , object reference (Kazemzadeh et al., 2014; De Vries et al., 2017a) , visual question answering (Antol et al., 2015) , and first attempts of visual dialogue proper (Das et al., 2017) , but fail to produce consistent outputs over a conversation.",
                "cite_spans": [
                    {
                        "start": 305,
                        "end": 323,
                        "text": "(Mao et al., 2016;",
                        "ref_id": "BIBREF23"
                    },
                    {
                        "start": 324,
                        "end": 346,
                        "text": "Vedantam et al., 2017)",
                        "ref_id": "BIBREF29"
                    },
                    {
                        "start": 366,
                        "end": 391,
                        "text": "(Kazemzadeh et al., 2014;",
                        "ref_id": "BIBREF16"
                    },
                    {
                        "start": 392,
                        "end": 415,
                        "text": "De Vries et al., 2017a)",
                        "ref_id": null
                    },
                    {
                        "start": 444,
                        "end": 464,
                        "text": "(Antol et al., 2015)",
                        "ref_id": "BIBREF2"
                    },
                    {
                        "start": 512,
                        "end": 530,
                        "text": "(Das et al., 2017)",
                        "ref_id": "BIBREF7"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "We hypothesise that one of the main reasons for this shortcoming is the models' inability to effectively utilise dialogue history. Human interlocutors are known to collaboratively establish a shared repository of mutual information during a conversation (Clark and Wilkes-Gibbs, 1986; Clark, 1996; Brennan and Clark, 1996) . This common ground (Stalnaker, 1978) then is used to optimise understanding and communication efficiency. Equipping artificial dialogue agents with a similar representation of dialogue context thus is a pivotal next step in improving the quality of their dialogue output.",
                "cite_spans": [
                    {
                        "start": 254,
                        "end": 284,
                        "text": "(Clark and Wilkes-Gibbs, 1986;",
                        "ref_id": "BIBREF6"
                    },
                    {
                        "start": 285,
                        "end": 297,
                        "text": "Clark, 1996;",
                        "ref_id": null
                    },
                    {
                        "start": 298,
                        "end": 322,
                        "text": "Brennan and Clark, 1996)",
                        "ref_id": "BIBREF3"
                    },
                    {
                        "start": 344,
                        "end": 361,
                        "text": "(Stalnaker, 1978)",
                        "ref_id": "BIBREF27"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "To facilitate progress towards more consistent and effective conversation models, we introduce the PhotoBook dataset: a large collection of 2,500 human-human goal-oriented English conversations between two participants, who are asked to identify shared images in their respective photo books by exchanging messages via written chat. This setup takes inspiration from experimental paradigms extensively used within the psycholinguistics literature to investigate partnerspecific common ground (for an overview, see Brown-Schmidt et al., 2015) , adapting them to the requirements imposed by online crowdsourcing methods. The task is formulated as a game consisting of five rounds. Figure 1 shows an example of a participant's display. Over the five rounds of a game, a selection of previously displayed images will be visible again, prompting participants to re-refer to images utilising both their visual context as well as previously established referring expressions. The resulting dialogue data therefore allows for tracking the common ground developing between dialogue participants.",
                "cite_spans": [
                    {
                        "start": 514,
                        "end": 541,
                        "text": "Brown-Schmidt et al., 2015)",
                        "ref_id": "BIBREF4"
                    }
                ],
                "ref_spans": [
                    {
                        "start": 686,
                        "end": 687,
                        "text": "1",
                        "ref_id": "FIGREF0"
                    }
                ],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "We describe in detail the PhotoBook task and the data collection, and present a thorough analysis of the dialogues in the dataset. In addition, to showcase how the new dataset may be exploited for computational modelling, we propose a reference resolution baseline model trained to identify target images being discussed in a given dialogue segment. The model uses a simple method to take into account information accumulated in a reference chain. Our results show that this information is particularly important to resolve later descriptions and highlight the importance of developing more sophisticated models of common ground in dialogue interaction.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "The PhotoBook dataset, together with the data collection protocol, the automatically extracted reference chains, and the code used for our analyses and models are available at the following site: https://dmg-photobook.github.io.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Introduction",
                "sec_num": "1"
            },
            {
                "text": "Seminal works on cooperative aspects of dialogue have developed their hypotheses and models based on a relatively small number of samples collected through lab-based conversation tasks (e.g., Krauss and Weinheimer, 1964, 1966; Clark and Wilkes-Gibbs, 1986; Brennan and Clark, 1996; Anderson et al., 1991) . Recent datasets inspired by this line of work include the REX corpora (Takenobu et al., 2012) and PentoRef (Zarrieß et al., 2016) . With the development of online data collection methods (von Ahn et al., 2006) a new, game-based approach to quick and inexpensive collection of dialogue data became available. PhotoBook builds on these traditions to provide a large-scale dataset suitable for data-driven development of computational dialogue agents.",
                "cite_spans": [
                    {
                        "start": 192,
                        "end": 202,
                        "text": "Krauss and",
                        "ref_id": null
                    },
                    {
                        "start": 203,
                        "end": 226,
                        "text": "Weinheimer, 1964, 1966;",
                        "ref_id": null
                    },
                    {
                        "start": 227,
                        "end": 256,
                        "text": "Clark and Wilkes-Gibbs, 1986;",
                        "ref_id": "BIBREF6"
                    },
                    {
                        "start": 257,
                        "end": 281,
                        "text": "Brennan and Clark, 1996;",
                        "ref_id": "BIBREF3"
                    },
                    {
                        "start": 282,
                        "end": 304,
                        "text": "Anderson et al., 1991)",
                        "ref_id": null
                    },
                    {
                        "start": 377,
                        "end": 400,
                        "text": "(Takenobu et al., 2012)",
                        "ref_id": "BIBREF28"
                    },
                    {
                        "start": 414,
                        "end": 436,
                        "text": "(Zarrieß et al., 2016)",
                        "ref_id": "BIBREF31"
                    },
                    {
                        "start": 494,
                        "end": 516,
                        "text": "(von Ahn et al., 2006)",
                        "ref_id": "BIBREF0"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Related Work",
                "sec_num": "2"
            },
            {
                "text": "The computer vision community has recently developed large-scale datasets for visually grounded dialogue (Das et al., 2017; De Vries et al., 2017b) . These approaches extend earlier work on visual question answering (Antol et al., 2015) to a multi-turn setup where two agents, each with a pre-determined Questioner or Answerer role, exchange sequences of questions and answers about an image. While data resulting from these tasks provides interesting opportunities to investigate visual grounding, it suffers from fundamental shortcomings with respect to the collaborative aspects of natural goal-oriented dialogue (e.g., fixed, pairwise structuring of question and answers, no extended dialogue history). In contrast, PhotoBook includes natural and free-from dialogue data with a variety of dialogue acts and opportunities for participant collaboration.",
                "cite_spans": [
                    {
                        "start": 105,
                        "end": 123,
                        "text": "(Das et al., 2017;",
                        "ref_id": "BIBREF7"
                    },
                    {
                        "start": 124,
                        "end": 147,
                        "text": "De Vries et al., 2017b)",
                        "ref_id": null
                    },
                    {
                        "start": 216,
                        "end": 236,
                        "text": "(Antol et al., 2015)",
                        "ref_id": "BIBREF2"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Related Work",
                "sec_num": "2"
            },
            {
                "text": "Resolving referring expressions in the visual modality has also been studied in computer vision. Datasets such as ReferIt (Kazemzadeh et al., 2014 ), Flicker30k Entities (Plummer et al., 2015) and Visual Genome (Krishna et al., 2017) map referring expressions to regions in a single image. Referring expressions in the PhotoBook dataset differ from this type of data in that the candidate referents are independent but similar images and, most importantly, are often part of a reference chain in the participants' dialogue history.",
                "cite_spans": [
                    {
                        "start": 122,
                        "end": 146,
                        "text": "(Kazemzadeh et al., 2014",
                        "ref_id": "BIBREF16"
                    },
                    {
                        "start": 147,
                        "end": 192,
                        "text": "), Flicker30k Entities (Plummer et al., 2015)",
                        "ref_id": null
                    },
                    {
                        "start": 211,
                        "end": 233,
                        "text": "(Krishna et al., 2017)",
                        "ref_id": "BIBREF20"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Related Work",
                "sec_num": "2"
            },
            {
                "text": "In the PhotoBook task, two participants are paired for an online multi-round image identification game. In this game, participants are shown collections of images that resemble the page of a photo book (see Figure 1 ). Each of these collections is a randomly ordered grid of six similar images depicting everyday scenes extracted from the MS COCO Dataset (Lin et al., 2014) . On each page of the photo book, some of the images are present in the displays of both participants (the common images). The other images are each shown to one of the participants only (different). Three of the images in each display are highlighted through a yellow bar under the picture. The participants are tasked to mark these highlighted target images as either common or different by chatting with their partner. 2 The PhotoBook task is symmetric, i.e., participants do not have predefined roles such as instruction giver and follower, or questioner and answerer. Consequently, both participants can freely and naturally contribute to the conversation, leading to more natural dialogues.",
                "cite_spans": [
                    {
                        "start": 355,
                        "end": 373,
                        "text": "(Lin et al., 2014)",
                        "ref_id": "BIBREF22"
                    }
                ],
                "ref_spans": [
                    {
                        "start": 214,
                        "end": 215,
                        "text": "1",
                        "ref_id": "FIGREF0"
                    }
                ],
                "eq_spans": [],
                "section": "Task Description and Setup",
                "sec_num": "3"
            },
            {
                "text": "Once the two participants have made their selections on a given page, they are shown a feedback screen and continue to the next round of the game, a new page of the photo book displaying a different grid of images. Some of the images in this grid will be new to the game while others will have appeared before. A full game consists of labelling three highlighted target images in each of five consecutive rounds.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Task Description and Setup",
                "sec_num": "3"
            },
            {
                "text": "Each highlighted image is displayed exactly five times throughout a game while the display of images and the order of rounds is randomised to prevent participants from detecting any patterns. As a result of this carefully designed setup, dialogues in the PhotoBook dataset contain multiple descriptions of each of the target images and thus provide a valuable resource for investigating participant cooperation, and specifically collaborative referring expression generation and resolution with respect to the conversation's common ground.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Task Description and Setup",
                "sec_num": "3"
            },
            {
                "text": "The task setup requires each game of five rounds to display 12 unique but similar images to elicit non-trivial referring expressions. We use the object category annotations in MS COCO to group all landscape, unmarked, colour images where the two largest objects belong to the same category across all images in the set (e.g., all images in the set prominently feature a person and a cat).3 This produced 30 sets of at least 20 images from which 12 were selected at random. As a given game highlights only half of the images from a given set, each image set produces two different game sets with different target images to be highlighted, for a total of 60 unique games and 360 unique images. More details on the PhotoBook setup and image sets are provided in Appendix A.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Image Sets",
                "sec_num": null
            },
            {
                "text": "We use the ParlAI framework (Miller et al., 2017) to implement the task and interface with crowdsourcing platform Amazon Mechanical Turk (AMT) to collect the data. To control the quality of collected dialogues, we require AMT workers to be native English speakers and to have completed at least 100 other tasks on AMT with a minimum acceptance rate of 90%. Workers are paired through an algorithm based on whether or not they have completed the PhotoBook task before and which of the individual games they have played. In order to prevent biased data, workers can complete a maximum of five games, each participant can complete a given game only once, and the same pair of participants cannot complete more than one game.",
                "cite_spans": [
                    {
                        "start": 28,
                        "end": 49,
                        "text": "(Miller et al., 2017)",
                        "ref_id": "BIBREF25"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Data Collection",
                "sec_num": "4"
            },
            {
                "text": "Participants are instructed about the task and first complete a warming-up round with only three images per participant (two of them highlighted). In order to render reference grounding as clean as possible and facilitate automatic processing of the resulting dialogue data, participants are asked to try to identify the common and different images as quickly as possible, only describe a single image per message, and directly select an image's label when they agree on it. The compensation scheme is based on an average wage of 10 USD per hour (Hara et al., 2018) . See Appendix B for a full account of the instructions and further details on participant payment.",
                "cite_spans": [
                    {
                        "start": 546,
                        "end": 565,
                        "text": "(Hara et al., 2018)",
                        "ref_id": "BIBREF11"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Data Collection",
                "sec_num": "4"
            },
            {
                "text": "During data collection, we recorded anonymised participant IDs, the author, timestamp and content of all sent messages, label selections and button clicks, plus self-reported collaboration performance scores. For a period of two months, data collection produced human-human dialogues for a total of 2,506 completed games. The resulting PhotoBook dataset contains a total of 164,615 utterances, 130,322 actions and spans a vocabulary of 11,805 unique tokens.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Data Collection",
                "sec_num": "4"
            },
            {
                "text": "Each of the 60 unique game sets was played between 15 and 72 times, with an average of 41 games per set. The task was completed by 1,514 unique workers, of which 472 only completed a single game, 448 completed between two and four games, and 594 the maximum of five games.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Data Collection",
                "sec_num": "4"
            },
            {
                "text": "Completing a full five-round game took an average of 14.2 minutes. With three highlighted images per player per round, during a full game of five rounds 30 labelling decisions have to be made. On average, participants correctly labelled 28.62 out of these 30.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Data Collection",
                "sec_num": "4"
            },
            {
                "text": "In this paper, we focus on the analysis of participants' interaction during a game of five labelling rounds. 4 Our data here largely confirms the observations concerning participants' task efficiency and language use during a multi-round communication task made by seminal, small-scale experiments such as those by Krauss and Weinheimer (1964) ; Clark and Wilkes-Gibbs (1986) ; Brennan and Clark (1996) and, due to its scale, offers additional aspects for further investigation.",
                "cite_spans": [
                    {
                        "start": 315,
                        "end": 343,
                        "text": "Krauss and Weinheimer (1964)",
                        "ref_id": "BIBREF18"
                    },
                    {
                        "start": 346,
                        "end": 375,
                        "text": "Clark and Wilkes-Gibbs (1986)",
                        "ref_id": "BIBREF6"
                    },
                    {
                        "start": 378,
                        "end": 402,
                        "text": "Brennan and Clark (1996)",
                        "ref_id": "BIBREF3"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Dataset Analysis",
                "sec_num": "5"
            },
            {
                "text": "Completing the first round of the PhotoBook task takes participants an average of almost three minutes. Completing the fifth round on the other hand takes them about half that time. As Figure 2a shows, this decline roughly follows a negative logarithmic function, with significant differences between rounds 1, 2, 3 and 4, and plateauing towards the last round. The number of messages sent by participants as well as the average message length follow a similar pattern, significantly decreasing between consecutive game rounds. The average number of correct image labels, on the other hand, significantly increases between the first and last round of the game (cf. the red dashed graph in Figure 2a ). As a result, task efficiency as calculated by points per minute significantly increases with each game round.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 192,
                        "end": 194,
                        "text": "2a",
                        "ref_id": "FIGREF1"
                    },
                    {
                        "start": 696,
                        "end": 698,
                        "text": "2a",
                        "ref_id": "FIGREF1"
                    }
                ],
                "eq_spans": [],
                "section": "Task Efficiency",
                "sec_num": "5.1"
            },
            {
                "text": "To get a better understanding of how participants increase task efficiency and shorten their utterances, we analyse how the linguistic characteristics of messages change over a game. We calculated a normalised content word ratio by dividing the count of content words by the total token count. 5 This results in an almost linear increase of content tokens over total token ratio throughout a game (average Pearson's r per game of 0.34, p 0.05, see Figure 2b ). With referring expressions and messages in general getting shorter, content words thus appear to be favoured to remain. We also observe that participants reuse these content words. Figure 2c shows the number of novel content tokens per game round, which roughly follows a negative logarithmic function. This supports the hypothesis of participants establishing a conceptual pact on the referring expression attached to a specific referent: Once accepted, a referring expression is typically refined through shortening rather than by reformulating or adding novel information (cf., Brennan and Clark, 1996) .",
                "cite_spans": [
                    {
                        "start": 1042,
                        "end": 1066,
                        "text": "Brennan and Clark, 1996)",
                        "ref_id": "BIBREF3"
                    }
                ],
                "ref_spans": [
                    {
                        "start": 455,
                        "end": 457,
                        "text": "2b",
                        "ref_id": "FIGREF1"
                    },
                    {
                        "start": 649,
                        "end": 651,
                        "text": "2c",
                        "ref_id": "FIGREF1"
                    }
                ],
                "eq_spans": [],
                "section": "Linguistic Properties of Utterances",
                "sec_num": "5.2"
            },
            {
                "text": "We also analysed in more detail the distribution of word classes per game round by tagging messages with the NLTK POS-Tagger. Figure 2d displays the relative changes in content-word-class usage between the first round and last round of a game. All content word classes but verbs show a relative increase in occurrence, most prominently nouns with a 20% relative increase. The case of adverbs, which show a 12% relative increase, is particular: Manual examination showed that most adverbs are not used to described images but rather to flag that a given image has already appeared before or to confirm/reject ('again' and 'too' make up 21% of all adverb occurrences; about 36% are 'not', 'n't' and 'yes'). These results indicate that interlocutors are most likely to retain the nouns and adjectives of a developing referring expression, while increasingly dropping verbs, as well as prepositions and determiners. A special role here takes definite determiner 'the', which, in spite of the stark decline of determiners in general, increases by 13% in absolute occurrence counts between the first and last round of a game, suggesting a shift towards known information.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 133,
                        "end": 135,
                        "text": "2d",
                        "ref_id": "FIGREF1"
                    }
                ],
                "eq_spans": [],
                "section": "Linguistic Properties of Utterances",
                "sec_num": "5.2"
            },
            {
                "text": "Finally, in contrast to current visual dialogue datasets (Das et al., 2017; De Vries et al., 2017b) which exclusively contain sequences of questionanswer pairs, the PhotoBook dataset includes diverse dialogue acts. Qualitative examination shows that, not surprisingly, a large proportion of messages include an image description. These descriptions however are interleaved with clarification questions, acceptances/rejections, and acknowledgements. For an example, see the dialogue excerpt in Figure 1 . Further data samples are available in Appendix C. A deeper analysis of the task-specific dialogue acts would require manual annotation, which could be added in the future.",
                "cite_spans": [
                    {
                        "start": 57,
                        "end": 75,
                        "text": "(Das et al., 2017;",
                        "ref_id": "BIBREF7"
                    },
                    {
                        "start": 76,
                        "end": 99,
                        "text": "De Vries et al., 2017b)",
                        "ref_id": null
                    }
                ],
                "ref_spans": [
                    {
                        "start": 500,
                        "end": 501,
                        "text": "1",
                        "ref_id": "FIGREF0"
                    }
                ],
                "eq_spans": [],
                "section": "Linguistic Properties of Utterances",
                "sec_num": "5.2"
            },
            {
                "text": "In a small-scale pilot study, Ilinykh et al. (2018) find that the pragmatics of goal-oriented dialogue leads to consistently more factual scene descriptions and reasonable referring expressions than traditional, context-free labelling of the same images. We argue that in the PhotoBook task referring expressions are not only adapted based on the goal-oriented nature of the interaction but also by incorporating the developing common ground between the participants. This effect becomes most apparent when collecting all referring expressions for a specific target image produced during the different rounds of a game in its coreference chain. Before filtering, first referring expressions do not significantly differ in length from the COCO captions. Last descriptions however are significantly shorter than both the COCO captions and first descriptions. After filtering for content words, no significant differences remain. We also calculate the cosine distance between the three different descriptions based on their average word vectors. 6Non-function words here should not significantly alter an utterance's mean word vector, which is confirmed in our results. Before as well as after filtering, the distance between last referring expression and COCO captions is almost double the distance between the first referring expressions and the captions (see last column in Table 1 ). Comparing the distribution of word classes in the captions and referring expressions finally revealed a similar distribution in first referring expressions and COCO captions, and a significantly different distribution in last referring expressions, among other things doubling the relative frequency of nouns.",
                "cite_spans": [
                    {
                        "start": 30,
                        "end": 51,
                        "text": "Ilinykh et al. (2018)",
                        "ref_id": "BIBREF15"
                    }
                ],
                "ref_spans": [
                    {
                        "start": 1380,
                        "end": 1381,
                        "text": "1",
                        "ref_id": "TABREF0"
                    }
                ],
                "eq_spans": [],
                "section": "Reference Chains",
                "sec_num": "5.3"
            },
            {
                "text": "Collecting reference chains from dialogue data is a non-trivial task which normally requires manual annotation (Yoshida, 2011) . Here we propose a simple procedure to automatically extract reference chains made up of dialogue segments. A dialogue segment is defined as a collection of consecutive utterances that, as a whole, discuss a given target image and include expressions referring to it. All dialogue segments within a game that refer to the same target image form its reference chain.",
                "cite_spans": [
                    {
                        "start": 111,
                        "end": 126,
                        "text": "(Yoshida, 2011)",
                        "ref_id": "BIBREF30"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Reference Chains",
                "sec_num": "5.3"
            },
            {
                "text": "In order to automatically segment the collected dialogues in this way, we developed a rule-based heuristics exploiting participants' image labelling actions to detect segment boundaries and their respective targets. The heuristics is described in detail in Appendix D. Since the task instructs participants to label images as soon as they identify them as either common or different, the majority of registered labelling actions can be assumed to conclude the current dialogue segment. The following excerpt displays a segment extracted from a game's first round, discussing one target image before a participant selects its label: B: I have two kids (boys) holding surf boards walking. A: I do not have that one.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Reference Chains",
                "sec_num": "5.3"
            },
            {
                "text": "Image selections however do not always delimit segments in the cleanest way possible. For example, a segment may refer to more than one target image, i.e., the participants may discuss two images and only after this discussion be able to identify them as common/different. 72% of the extracted segments are linked to only one target; 25% to two. Moreover, reference chains do not necessarily contain one segment for each of the five game rounds. They may contain fewer or more segments than rounds in a game, since participants may discuss the same image more than once in a single round and some of the extracted chains may be noisy, as explained in the evaluation section below. 75% of the automatically extracted chains contain three to six segments.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "B: marks #340331 as different",
                "sec_num": null
            },
            {
                "text": "Evaluation To evaluate the segmentation, two annotators independently reviewed segments extracted from 20 dialogues. These segments were annotated by marking all utterances u in a segment S with target images I that refer to an image i where i / ∈ I to determine precision, and marking all directly preceding and succeeding utterances u outside of a segment S that refer to a target image i ∈ I to determine recall. Additionally, if a segment S did not include any references to any of its target images I, it was labelled as improper. 95% of annotated segments were assessed to be proper (Cohen's κ of 0.87), with 28.4% of segments containing non-target references besides target references (Cohen's κ of 0.97). Recall across all reviewed segments is 99% (Cohen's κ of 0.93).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "B: marks #340331 as different",
                "sec_num": null
            },
            {
                "text": "Using the automatically extracted dialogue segments, we develop a reference resolution model that aims at identifying the target images referred to in a dialogue segment. We hypothesise that later segments within a reference chain might be more difficult to resolve, because they rely on referring expressions previously established by the dialogue participants. As a consequence, a model that is able to keep track of the common ground should be less affected by this effect. To investigate these issues, we experiment with two conditions: In the NO-HISTORY condition, the model only has access to the current segment and to the visual features of each of the candidate images. In the HIS-TORY condition, on the other hand, the model also has access to the previous segments in the reference chain associated with each of the candidate images, containing the linguistic common ground built up by the participants.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Experiments on Reference Resolution",
                "sec_num": "7"
            },
            {
                "text": "We keep our models very simple. Our aim is to propose baselines against which future work can be compared.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Experiments on Reference Resolution",
                "sec_num": "7"
            },
            {
                "text": "The automatically extracted co-reference chains per target image were split into three disjoint sets for training (70%), validation (15%) and testing (15%), aiming at an equal distribution of target image domains in all three sets. The raw numbers per data split are shown in Table 2 . ",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 282,
                        "end": 283,
                        "text": "2",
                        "ref_id": "TABREF1"
                    }
                ],
                "eq_spans": [],
                "section": "Data",
                "sec_num": "7.1"
            },
            {
                "text": "Segment to be resolved ...",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Candidate images",
                "sec_num": null
            },
            {
                "text": "Image has not been discussed before; no available chain ...",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "LSTM Ref Chain Encoder",
                "sec_num": null
            },
            {
                "text": "Seg 2",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Seg 1",
                "sec_num": null
            },
            {
                "text": "Figure 3 : Diagram of the model in the HISTORY condition. For simplicity, we only show three candidate images. Some candidate images may not have a reference chain associated with them, while others may be linked to chains of different length, reflecting how many times an image has been referred to in the dialogue so far. In this example, the model predicts that the bottom candidate is the target referent of the segment to be resolved.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 7,
                        "end": 8,
                        "text": "3",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "LSTM Ref Chain Encoder",
                "sec_num": null
            },
            {
                "text": "Our resolution model encodes the linguistic features of the dialogue segment to be resolved with a recurrent neural network with Long Short-Term Memory (LSTM, Hochreiter and Schmidhuber, 1997) . The last hidden state of the LSTM is then used as the representation for the dialogue segment. For each candidate image in the context, we obtain image features using the activations from the penultimate layer of a ResNet-152 (He et al., 2016) pre-trained on ImageNet (Deng et al., 2009) . These image features, which are of size 2048, are projected onto a smaller dimension equal to the hidden dimension of LSTM units. Projected image features go through ReLU nonlinearity and are normalised to unit vectors. To assess which of the candidate images is a target, in the NO-HISTORY condition we take the dot product between the dialogue segment representation and each image feature vector, ending up with scalar predictions for all N images in the context: s = {s 0 , ..., s N }.",
                "cite_spans": [
                    {
                        "start": 159,
                        "end": 192,
                        "text": "Hochreiter and Schmidhuber, 1997)",
                        "ref_id": "BIBREF14"
                    },
                    {
                        "start": 421,
                        "end": 438,
                        "text": "(He et al., 2016)",
                        "ref_id": "BIBREF13"
                    },
                    {
                        "start": 463,
                        "end": 482,
                        "text": "(Deng et al., 2009)",
                        "ref_id": "BIBREF10"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Models",
                "sec_num": "7.2"
            },
            {
                "text": "For the HISTORY condition, we propose a simple mechanism for taking into account linguistic common ground about each image. For each candidate image, we consider the sequence of previous segments within its reference chain. This shared linguistic background is encoded with another LSTM, whose last hidden state is added to the corresponding image feature that was projected to the same dimension as the hidden state of the LSTM. The resulting representation goes through ReLU, is normalised, and compared to the target dialogue segment representation via dot product, as in NO-HISTORY (see Figure 3 ).",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 598,
                        "end": 599,
                        "text": "3",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "Models",
                "sec_num": "7.2"
            },
            {
                "text": "As an ablation study, we train a HISTORY model without visual features. This allows us to establish a baseline performance only involving language and to study whether the HISTORY model with visual features learns an efficient multi-modal representation. We hypothesise that some descriptions can be successfully resolved by just comparing the current segment and the reference chain in the history (e.g., when descriptions are detailed and repeated). However, performance should be significantly lower than with visual features, for example when referring expressions are ambiguous.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Models",
                "sec_num": "7.2"
            },
            {
                "text": "Sigmoid is applied element-wise over the scalar predictions in all three models. As a result, each image can be assessed independently using a decision threshold (set to 0.5). This allows the model to predict multiple images as referents. 7 We use Binary Cross Entropy Loss to train the models. Since distractor images make up 84.74% of the items to be classified in the training set and target images constitute only the 15.26% of them, we provided 84.74/15.26 ≈ 5.5 as the weight of the target class in the loss function.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Models",
                "sec_num": "7.2"
            },
            {
                "text": "All models were implemented in PyTorch, trained with a learning rate of 0.001 and a batch size of 512. The dimension of the word embeddings and the hidden dimensions of the LSTM units were all set to 512. The parameters were optimised using Adam (Kingma and Ba, 2014). The models were trained until the validation loss stopped improving, after which we selected the model with the best weighted average of the target and non-target F-scores.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Models",
                "sec_num": "7.2"
            },
            {
                "text": "We report precision, recall, and F-score for the target images in Table 3 . Results for non-target images are available in Appendix E. Every candidate image contributes individually to the scores, i.e., the task is not treated as multi-label for evaluation purposes. Random baseline scores are obtained by taking the average of 10 runs with a model that predicts targets and non-targets randomly for the images in the test set.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 72,
                        "end": 73,
                        "text": "3",
                        "ref_id": "TABREF2"
                    }
                ],
                "eq_spans": [],
                "section": "Results",
                "sec_num": "7.3"
            },
            {
                "text": "Given the low ratio of target to distractor images (see Table 2 in Section 7.1), the task of identifying target images is challenging and the random baseline achieves an F-score below 30%. The results show that the resolution capabilities of our model are well above the baseline. The HISTORY model achieves higher recall and F-score than the NO-HISTORY model, while precision is comparable across these two conditions. For a more in-depth analysis of the results, we examine how precision and recall vary depending on the position of the to-be-resolved segment within a reference chain. Figure 4 displays this information. As hypothesised, we observe that resolution performance is lower for later segments in a reference chain. For example, while precision is close to 60% for first mentions (position 1 in a chain), it declines by around 20 points for last mentions. The plots in Figure 4 also show the impact of taking into account the common ground accumulated over a reference chain. This is most prominent with regard to the recall of target images. The HISTORY model yields higher results than the NO-HISTORY model when it comes to resolving segments that refer to an image that has already been referred to earlier within the dialogue (positions > 1). Yet, the presence of linguistic context does not fully cancel out the effect observed above: The performance of the HISTORY model also declines for later segments in a chain, indicating that more sophisticated methods are needed to fully exploit shared linguistic information.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 62,
                        "end": 63,
                        "text": "2",
                        "ref_id": "TABREF1"
                    },
                    {
                        "start": 595,
                        "end": 596,
                        "text": "4",
                        "ref_id": "FIGREF3"
                    },
                    {
                        "start": 890,
                        "end": 891,
                        "text": "4",
                        "ref_id": "FIGREF3"
                    }
                ],
                "eq_spans": [],
                "section": "Results",
                "sec_num": "7.3"
            },
            {
                "text": "Experiments with the HISTORY model without visual features (HISTORY/No image) confirm our hypothesis. The HISTORY model outperforms the \"blind\" model by about 21 points in precision and 14 points in recall. We thus conclude that even our simple fusion mechanism already allows for learning an efficient multimodal encoding and resolution of referring expressions.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Model",
                "sec_num": null
            },
            {
                "text": "The quantitative dataset analysis presented in Section 5 showed that referring expressions become shorter over time, with interlocutors being most likely to retain nouns and adjectives. Qualitative inspection of the reference chains reveals that this compression process can lead to very nonstandard descriptions. We hypothesise that the degree to which the compressed descriptions rely on visual information has an impact on the performance of the models. For example, the NO-HISTORY model can be effective when the participants converge on a non-standard description which highlights a visual property of the target image that clearly discriminates it from the distractors. This is the case in the example shown on the left-hand side of Figure 5 . The target image shows a woman holding what seems to be a plastic carrot. This feature stands out in a domain where all the candidate images include a person and a TV.8 After an initial, longer description ('a woman sitting in front of a monitor with a dog wallpaper while holding a plastic carrot'), the participants use the much more compact description 'the carrot lady'. Arguably, given the saliency of the carrot in the given context, relying on the preceding linguistic history is not critical in this case, and thus both the NO-HISTORY and the HISTORY model succeed in identifying the target.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 746,
                        "end": 747,
                        "text": "5",
                        "ref_id": "FIGREF4"
                    }
                ],
                "eq_spans": [],
                "section": "Qualitative Analysis",
                "sec_num": "7.4"
            },
            {
                "text": "We observe that the HISTORY model is particularly helpful when the participants converge on a non-standard description of a target image that cannot easily be grounded on visual information. The image and reference chain on the right-hand side of Figure 5 illustrate this point, where the description to be resolved is the remarkably abstract 'strange'. Here the HISTORY model succeeds while the NO-HISTORY model fails. As in the previous example, the referring expression in the first segment of the reference chain for this image ('a strange bike with two visible wheels in the back') includes more descriptive content -indeed, it is similar to a caption, as shown by our analysis in Section 5.3. By exploiting shared linguistic context, the HISTORY model can not only interpret the non-standard phrase, but also recover additional properties of the image not explicit in the segment to be resolved, which presumably help to ground it.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 254,
                        "end": 255,
                        "text": "5",
                        "ref_id": "FIGREF4"
                    }
                ],
                "eq_spans": [],
                "section": "Qualitative Analysis",
                "sec_num": "7.4"
            },
            {
                "text": "We have presented the first large-scale dataset of goal-oriented, visually grounded dialogues for investigating shared linguistic history. Through the data collection's task setup, participants repeatedly refer to a controlled set of target images, which allows them to improve task efficiency if they utilise their developing common ground and establish conceptual pacts (Brennan and Clark, 1996) on referring expressions. The collected dialogues exhibit a significant shortening of utterances throughout a game, with final referring expressions starkly differing from both standard image captions and initial descriptions. To illustrate the potential of the dataset, we trained a baseline reference resolution model and showed that information accumulated over a reference chain helps to resolve later descriptions. Our results suggest that more sophisticated models are needed to fully exploit shared linguistic history.",
                "cite_spans": [
                    {
                        "start": 372,
                        "end": 397,
                        "text": "(Brennan and Clark, 1996)",
                        "ref_id": "BIBREF3"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Conclusion",
                "sec_num": "8"
            },
            {
                "text": "The current paper showcases only some of the aspects of the PhotoBook dataset, which we hereby release to the public (https:// dmg-photobook.github.io).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Conclusion",
                "sec_num": "8"
            },
            {
                "text": "In future work, the data can be used to further investigate common ground and conceptual pacts; be extended through manual annotations for a more thorough linguistic analysis of co-reference chains; exploit the combination of vision and language to develop computational models for referring expression generation; or use the PhotoBook task in the ParlAI framework for Turing-Test-like evaluation of dialogue agents.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Conclusion",
                "sec_num": "8"
            },
            {
                "text": "Image Sets The images used in the PhotoBook task are taken from the MS COCO 2014 Trainset (Lin et al., 2014) . Images in MS COCO were collected from the Flickr 9 image repository, which contains labelled photos predominantly uploaded by amateur photographers. The pictures largely are snapshots of everyday situations, placing objects in a natural and often rich context (hence the name Common Objects in COntext) instead of showing an iconic view of objects. In the MS COCO Trainset, images are manually annotated with the outlines of the depicted objects as well as their object categories. We use this information to select similar pictures to display in the PhotoBook task. Through the filtering described in Section 3, we obtained 30 sets of similar images with different pairings of their most prominent objects. In total there are 26 unique object categories in the image sets. The most frequent object category in the image sets is person, which is one of the two main objects in 19 sets.",
                "cite_spans": [
                    {
                        "start": 90,
                        "end": 108,
                        "text": "(Lin et al., 2014)",
                        "ref_id": "BIBREF22"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Appendices A Task Setup",
                "sec_num": null
            },
            {
                "text": "We developed a simple function to select which images of a set should be shown to which participant in which round of a game in order to guarantee that the task setup elicits sufficient image (re-)references for collecting co-reference chains. In this function, the 12 images in a set of similar photographs are randomly indexed and then assigned to a participant's display based on the schema displayed in Table 4 . 9 https://www.flickr.com/ With this schema, each photograph is displayed exactly five times while the order of images and the order of rounds can be randomised to prevent participants from detecting patterns in the display. Each of these sets then is duplicated and assigned a different selection of highlighted images to obtain the 60 game sets of the PhotoBook task. While most highlighted images recur five times during a game, they can be highlighted for both participants in the same round. As a result, any given image is highlighted in an average of 3.42 rounds of a game (see Table 5 for the highlighting schema). 3, 6, 7, 9, 10 2, 3, 6, 7, 9, 11 3 4, 5, 7, 10, 11, 12 2, 3, 6, 7, 9, 11 4 1, 2, 5, 8, 11, 12 1, 4, 5, 8, 10, 12 5 5, 6, 8, 9, 11, 12 3, 7, 9, 10, 11, 12 Table 4 : Assignment of image IDs to the different participants and rounds of a game schema. The order of rounds and the arrangement of images on the participant's display can be randomised without effect on the game setup.",
                "cite_spans": [
                    {
                        "start": 1039,
                        "end": 1192,
                        "text": "3, 6, 7, 9, 10 2, 3, 6, 7, 9, 11 3 4, 5, 7, 10, 11, 12 2, 3, 6, 7, 9, 11 4 1, 2, 5, 8, 11, 12 1, 4, 5, 8, 10, 12 5 5, 6, 8, 9, 11, 12 3, 7, 9, 10, 11, 12",
                        "ref_id": null
                    }
                ],
                "ref_spans": [
                    {
                        "start": 413,
                        "end": 414,
                        "text": "4",
                        "ref_id": null
                    },
                    {
                        "start": 1007,
                        "end": 1008,
                        "text": "5",
                        "ref_id": "TABREF3"
                    },
                    {
                        "start": 1199,
                        "end": 1200,
                        "text": "4",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "Specification of Games",
                "sec_num": null
            },
            {
                "text": "Round Participant A Participant B 1 1, 2, 3, 4, 5, 6 1, 2, 3, 4, 7, 8 2 1,",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Specification of Games",
                "sec_num": null
            },
            {
                "text": "Game Round Statistics 1 2 3 4 5 H ID A B A B A B A B A B T 1 2 R 1 1 1 1 1 1 5 5 0 3 2 2 2",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Specification of Games",
                "sec_num": null
            },
            {
                "text": "2 2 2 5 0 5 4 3 1 1 1 1 1 5 5 0 3 4 2 2 2 1 2 5 4 1 3 5 1 1 1 1 1 5 0 5 4 6 2 2 2 2 2 5 5 0 4 7 1 1 1 1 1 5 0 5 3 8 2 1 2 1 1 5 2 3 3 9 2 2 1 2 2 5 4 1 3 10 2 2 2 2 2 5 5 0 4 11 1 1 1 1 1 5 0 5 4 12 2 2 2 2 2 5 5 0 3 ",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Specification of Games",
                "sec_num": null
            },
            {
                "text": "HIT Preview When the PhotoBook task environment is initialised, it publishes a specified number of Human Intelligence Tasks (HITs) titled Game: Detect common images by chatting with another player on Amazon Mechanical Turk (see Figure 6 for a full print of the descriptions). Participants entering the HIT are shown a preview screen with the central task details as shown in Figure 7 .",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 235,
                        "end": 236,
                        "text": "6",
                        "ref_id": "FIGREF5"
                    },
                    {
                        "start": 382,
                        "end": 383,
                        "text": "7",
                        "ref_id": "FIGREF6"
                    }
                ],
                "eq_spans": [],
                "section": "B Task Instructions",
                "sec_num": null
            },
            {
                "text": "Game Round Mechanics The PhotoBook task AMT user interface is designed in such a way that the six images per round are displayed in a 2 × 3 grid, with a coloured bar under each image: If the image is highlighted, this bar is yellow and contains a radio button option for the common and different labels. If they are not highlighted for a player, the bar is greyed out and empty. The submit button is deactivated as long as not all highlighted images have been labelled. As soon as both players submitted their selection, a feedback page is shown where the bars under the highlighted images either colour green to indicate a correct selection or red to indicate a wrong one. Figure 8(b) shows a screenshot of the feedback display.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 681,
                        "end": 685,
                        "text": "8(b)",
                        "ref_id": "FIGREF9"
                    }
                ],
                "eq_spans": [],
                "section": "B Task Instructions",
                "sec_num": null
            },
            {
                "text": "The radio buttons are disabled in the feedback screens so players cannot revise their selectionthey can however communicate about their mistakes or pass any other feedback to their partner. The title of a page indicates the current page number so participants can always check their progress; the text input field is limited to a maximum of hundred characters to prevent listings of multiple images or overly elaborate descriptionswhich, if necessary, can be conveyed in a number of subsequent messages.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "B Task Instructions",
                "sec_num": null
            },
            {
                "text": "Feedback Questionnaire In order to facilitate a qualitative analysis of dialogue agents developed for the PhotoBook task, we also collect a goldstandard benchmark of participant's self-reported satisfaction scores. These scores later can be compared with those obtained by pairing human participants with an artificial dialogue agent in order to assess it in a Turing Test-like setting. Following He et al. (2017) , we ask participants to rate three statements on a five-point Likert scale (Likert, 1932) , ranging from strongly agree to strongly disagree:",
                "cite_spans": [
                    {
                        "start": 397,
                        "end": 413,
                        "text": "He et al. (2017)",
                        "ref_id": "BIBREF12"
                    },
                    {
                        "start": 490,
                        "end": 504,
                        "text": "(Likert, 1932)",
                        "ref_id": "BIBREF21"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "B Task Instructions",
                "sec_num": null
            },
            {
                "text": "1. Overall collaboration with my partner worked well.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "B Task Instructions",
                "sec_num": null
            },
            {
                "text": "2. I understood my partner's descriptions well.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "B Task Instructions",
                "sec_num": null
            },
            {
                "text": "3. My partner seemed to understand me well.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "B Task Instructions",
                "sec_num": null
            },
            {
                "text": "Warming-Up Round During an initial series of pilot runs we observed that for new participants the first round of their first game took significantly longer than any other ones. Although we do expect that participants get more efficient over time, we argue that this effect is largely related to the fact that participants need to get familiar with the task's mechanics when it is the first time they are exposed to it. In order to control for this effect, we added a warming-up round with three images per participant10 for each pair of new participants (see Figure 8a ). This strongly reduced the completion time of new participants' first game rounds.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 566,
                        "end": 568,
                        "text": "8a",
                        "ref_id": "FIGREF9"
                    }
                ],
                "eq_spans": [],
                "section": "B Task Instructions",
                "sec_num": null
            },
            {
                "text": "Matching Participants In order to collect unbiased samples of the referring expression generation process, we aim to prevent both, i) participants completing the same game multiple times (as here they could re-use referring expressions that worked well during the last one) and ii) specific pairs of participants completing multiple games (as they might have established some kind of strategy or code already). We however also aim at designing the task in such a way that the degree of the partner-specificity in established canonical expressions could be assessed. To achieve this, the participant matching should create settings where a re-entering participant is assigned a game with the same image set as in the game before, but paired with a different conversation partner changes (compare for example Brennan and Clark, 1996) . In order to maximise the number of this second game setting, we encourage workers to continue playing by paying them a bonus of 0.25 USD for each 2nd, 3rd, 4th and 5th game.",
                "cite_spans": [
                    {
                        "start": 807,
                        "end": 831,
                        "text": "Brennan and Clark, 1996)",
                        "ref_id": "BIBREF3"
                    }
                ],
                "ref_spans": [],
                "eq_spans": [],
                "section": "B Task Instructions",
                "sec_num": null
            },
            {
                "text": "Worker Payment The HIT description also details the worker's payment. We want to provide fair payment to workers, which we calculated based on an average wage of 10 USD per hour (Hara et al., 2018). 11 An initial set of runs resulted in an average completion time of 12 minutes, which indicated an expected expense of about 2 USD per participant per game. More experienced workers however managed to complete a full game in six to ten minutes, meaning that for them we would often surpass the 10 USD/h guideline based on this calculation. Other workers -especially new ones -took up to 25 minutes for the first game, which means that they on the other hand would be strongly under-payed with a rigid per-game payment strategy. To mitigate this effect, we developed the following payment schema: Each worker that completes a full game is payed a base-amount of 1.75 USD -which is indicated in the HIT description. If the game took longer than ten minutes, the participants are payed a bonus amount of 0.10 USD per minute, up to an additional bonus payment of 1.50 USD for 25 or more minutes. In order to not encourage workers to play slowly, we only inform them about this bonus at the end of a HIT. With this bonus and the 20% AMT fee on each transaction, we expected an average cost of about 5 USD per game, which due to connection problems in the framework ultimately accumulated to 6 USD for a completed game. The total cost of the data collection, including pilot runs, was 16,350 USD.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "B Task Instructions",
                "sec_num": null
            },
            {
                "text": "Through the goal-oriented nature of participants' interactions in the PhotoBook dataset, we do not only collect image descriptions but rather the full, collaborative process of establishing, grounding and refining referring expressions throughout the subsequent rounds of the PhotoBook task. As a result, we capture a wide range of dialogue acts such as clarification questions, corrections, extensions, (self-)repairs as well as interactions concerning game mechanics. Consider for example the following interactions:",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "C Dataset Samples",
                "sec_num": null
            },
            {
                "text": "A: Man with dog on lap looking at his computer? B: I don't have that, but could it be a TV in yours? Mine has a man sitting with his dog watching TV. A: yes, TV -sorry! B: Okay. In most cases, referring expressions agreed upon during the first rounds of a game are further refined and optimised while re-referring to the same target object in later rounds of the game. These refinements often are manifested in an omission of detail while retaining core features of the target object. ",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "C Dataset Samples",
                "sec_num": null
            },
            {
                "text": "As explained in Section 6, instead of collecting coreference chains from manual annotation, we use a heuristics to automatically extract reference chains of dialogue segments likely to contain referring expressions to a chain's target image. We consider participants' image labelling actions to signal that a previously discussed target image was identified as either common or different and therefore concluding the current dialogue segment. Due to the spontaneous and unrestricted nature of the PhotoBook dialogues, these labelling actions however do not always indicate segment boundaries as cleanly as possible. To improve the quality of extracted dialogue segments and reference chains, we therefore developed a more context-sensitive heuristics to automate segmentation. The heuristics is implemented as a binary decision tree that uses labelling actions as well as any preceding and subsequent messages and additional labelling actions to better decide on segment boundaries and associated target images. It considers 32 combinations of eight different factors. The first case of the heuristics, for example, states that if 1. the current turn is a message, . there is a non-empty, currently developing dialogue segment, then we assume that after one speaker selected an image as common, the other speaker makes one utterance and marks the same image as common, which is resolved by saving the currently developing segment with the common image as referent and initialising a new segment with the trailing utterance of the second speaker. This prevents creating a segment with just the trailing utterance (that cannot be a complete segment) which would be the naive decision if segmenting was based solely on labelling actions. Other cases include whether the next turn is a message by the other participant followed by them labelling a second image as different (likely to indicate that two images were discussed and the segment should be extended by the following message as well as the second target image) or whether none of the preceding and subsequent turns contains labelling actions (indicating an ongoing dialogue segment).",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "D Reference Chain Extraction",
                "sec_num": null
            },
            {
                "text": "The following shows a typical example of an automatically extracted chain of dialogue segments associated with the image in Figure 9 About 72% of all segments are assigned to a single co-reference chain, 25% were automatically assigned to co-reference chains of two different target images and the remaining 3% to 3 or more chains.",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 131,
                        "end": 132,
                        "text": "9",
                        "ref_id": "FIGREF12"
                    }
                ],
                "eq_spans": [],
                "section": "D Reference Chain Extraction",
                "sec_num": null
            },
            {
                "text": "Data and Results In addition to the results reported on Table 3 in Section 7, which concern the target images in the test set, here we report the scores for target images on the validation set (Table 6) and the scores for non-target images (Table 7 ). The latter constitute the large majority of candidate images, and thus results are substantially higher for this class. ",
                "cite_spans": [],
                "ref_spans": [
                    {
                        "start": 62,
                        "end": 63,
                        "text": "3",
                        "ref_id": "TABREF2"
                    },
                    {
                        "start": 247,
                        "end": 248,
                        "text": "7",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "E Reference Resolution Experiments",
                "sec_num": null
            },
            {
                "text": "The PhotoBook dataset is being released by the Dialogue Modelling Group led by Raquel Fernández at the University of Amsterdam. The core of this work was done while Janosch Haber and Elia Bruni were affiliated with the group.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            },
            {
                "text": "Pilot studies showed that labelling all six images took participants about half an hour, which appeared to be too long for the online setting, resulting in large numbers of disconnects and incomplete games.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            },
            {
                "text": "All images where the two largest objects cover less than 30k pixels (∼10% of an average COCO image) were rejected.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            },
            {
                "text": "Tracking participant IDs, for example, also allows for an analysis of differences in behaviour across different games.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            },
            {
                "text": "We filtered out function words with NLTK's stopword list http://www.nltk.org/.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            },
            {
                "text": "We average pretrained word vectors from Word2Vec(Mikolov et al., 2013) in gensim (https: //radimrehurek.com/gensim/) to generate utterance vectors. The five COCO captions are represented by a cluster mean vector.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            },
            {
                "text": "As explained in Section 6, 25% of segments are linked to two targets; 3% to more. See Appendix D for further details.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            },
            {
                "text": "The COCO annotations for this image seem to be slightly off, as the image is tagged as including a TV but in fact shows a computer monitor.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            },
            {
                "text": "Warming-Up image categories are disjoint from the regular PhotoBook image sets.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "",
                "sec_num": null
            }
        ],
        "back_matter": [
            {
                "text": "The PhotoBook dataset was collected thanks to funding in the form of a Facebook ParlAI Research Award to Raquel Fernández. We are grateful to the ParlAI team, in particular Jack Urbanek and Jason Weston, for their continued support and assistance in using the ParlAI framework during the data collection, which was coordinated by Janosch Haber. Janosch Haber is currently supported by the DALI project, ERC Grant 695662. We warmly thank the volunteers who took part in pilot experiments. Thanks also go to Aashish Venkatesh for his valuable contributions in brainstorming sessions about the task design and for preliminary modelling efforts. Finally, we are grateful to the participants of two Faculty Summits at Facebook AI Research NYC for their feedback.",
                "cite_spans": [],
                "ref_spans": [],
                "eq_spans": [],
                "section": "Acknowledgements",
                "sec_num": null
            },
            {
                "text": "Recall F1 NO HISTORY 95.34 (95.37) 89.48 (89.42) Qualitative Analysis Figures 10 and 11 show the distractor images for the examples provided in Figure 5 and discussed in Section 7.4. ",
                "cite_spans": [
                    {
                        "start": 21,
                        "end": 48,
                        "text": "95.34 (95.37) 89.48 (89.42)",
                        "ref_id": null
                    }
                ],
                "ref_spans": [
                    {
                        "start": 151,
                        "end": 152,
                        "text": "5",
                        "ref_id": null
                    }
                ],
                "eq_spans": [],
                "section": "Model Precision",
                "sec_num": null
            }
        ],
        "bib_entries": {
            "BIBREF0": {
                "ref_id": "b0",
                "title": "Verbosity: A game for collecting common-sense facts",
                "authors": [
                    {
                        "first": "Mihir",
                        "middle": [],
                        "last": "Luis Von Ahn",
                        "suffix": ""
                    },
                    {
                        "first": "Manuel",
                        "middle": [],
                        "last": "Kedia",
                        "suffix": ""
                    },
                    {
                        "first": "",
                        "middle": [],
                        "last": "Blum",
                        "suffix": ""
                    }
                ],
                "year": 2006,
                "venue": "Proceedings of the Conference on Human Factors in Computing Systems",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {
                    "DOI": [
                        "10.1145/1124772.1124784"
                    ]
                },
                "num": null,
                "urls": [],
                "raw_text": "Luis von Ahn, Mihir Kedia, and Manuel Blum. 2006. Verbosity: A game for collecting common-sense facts. In Proceedings of the Conference on Human Factors in Computing Systems.",
                "links": null
            },
            "BIBREF2": {
                "ref_id": "b2",
                "title": "VQA: Visual Question Answering",
                "authors": [
                    {
                        "first": "Stanislaw",
                        "middle": [],
                        "last": "Antol",
                        "suffix": ""
                    },
                    {
                        "first": "Aishwarya",
                        "middle": [],
                        "last": "Agrawal",
                        "suffix": ""
                    },
                    {
                        "first": "Jiasen",
                        "middle": [],
                        "last": "Lu",
                        "suffix": ""
                    },
                    {
                        "first": "Margaret",
                        "middle": [],
                        "last": "Mitchell",
                        "suffix": ""
                    },
                    {
                        "first": "Dhruv",
                        "middle": [],
                        "last": "Batra",
                        "suffix": ""
                    },
                    {
                        "first": "C",
                        "middle": [
                            "Lawrence"
                        ],
                        "last": "Zitnick",
                        "suffix": ""
                    },
                    {
                        "first": "Devi",
                        "middle": [],
                        "last": "Parikh",
                        "suffix": ""
                    }
                ],
                "year": 2015,
                "venue": "Proceedings of ICCV",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Stanislaw Antol, Aishwarya Agrawal, Jiasen Lu, Mar- garet Mitchell, Dhruv Batra, C. Lawrence Zitnick, and Devi Parikh. 2015. VQA: Visual Question An- swering. In Proceedings of ICCV.",
                "links": null
            },
            "BIBREF3": {
                "ref_id": "b3",
                "title": "Conceptual pacts and lexical choice in conversation",
                "authors": [
                    {
                        "first": "Susan",
                        "middle": [
                            "E"
                        ],
                        "last": "Brennan",
                        "suffix": ""
                    },
                    {
                        "first": "Herbert",
                        "middle": [
                            "H"
                        ],
                        "last": "Clark",
                        "suffix": ""
                    }
                ],
                "year": 1996,
                "venue": "Journal of Experimental Psychology: Learning, Memory, and Cognition",
                "volume": "22",
                "issue": "",
                "pages": "1482--1493",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Susan E. Brennan and Herbert H. Clark. 1996. Con- ceptual pacts and lexical choice in conversation. Journal of Experimental Psychology: Learning, Memory, and Cognition, 22:1482-1493.",
                "links": null
            },
            "BIBREF4": {
                "ref_id": "b4",
                "title": "People as contexts in conversation",
                "authors": [
                    {
                        "first": "Sarah",
                        "middle": [],
                        "last": "Brown-Schmidt",
                        "suffix": ""
                    },
                    {
                        "first": "Si",
                        "middle": [
                            "On"
                        ],
                        "last": "Yoon",
                        "suffix": ""
                    },
                    {
                        "first": "Rachel",
                        "middle": [],
                        "last": "Anna Ryskin",
                        "suffix": ""
                    }
                ],
                "year": 2015,
                "venue": "Psychology of Learning and Motivation",
                "volume": "62",
                "issue": "",
                "pages": "59--99",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Sarah Brown-Schmidt, Si On Yoon, and Rachel Anna Ryskin. 2015. People as contexts in conversation. In Psychology of Learning and Motivation, volume 62, chapter 3, pages 59-99. Elsevier.",
                "links": null
            },
            "BIBREF5": {
                "ref_id": "b5",
                "title": "Using Language. 'Using' Linguistic Books",
                "authors": [
                    {
                        "first": "H",
                        "middle": [],
                        "last": "Herbert",
                        "suffix": ""
                    },
                    {
                        "first": "",
                        "middle": [],
                        "last": "Clark",
                        "suffix": ""
                    }
                ],
                "year": 1996,
                "venue": "",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {
                    "DOI": [
                        "10.1017/CBO9780511620539"
                    ]
                },
                "num": null,
                "urls": [],
                "raw_text": "Herbert H. Clark. 1996. Using Language. 'Using' Lin- guistic Books. Cambridge University Press.",
                "links": null
            },
            "BIBREF6": {
                "ref_id": "b6",
                "title": "Referring as a collaborative process",
                "authors": [
                    {
                        "first": "Herbert",
                        "middle": [
                            "H"
                        ],
                        "last": "Clark",
                        "suffix": ""
                    },
                    {
                        "first": "Deanna",
                        "middle": [],
                        "last": "Wilkes-Gibbs",
                        "suffix": ""
                    }
                ],
                "year": 1986,
                "venue": "Cognition",
                "volume": "22",
                "issue": "1",
                "pages": "1--39",
                "other_ids": {
                    "DOI": [
                        "10.1016/0010-0277(86)90010-7"
                    ]
                },
                "num": null,
                "urls": [],
                "raw_text": "Herbert H. Clark and Deanna Wilkes-Gibbs. 1986. Referring as a collaborative process. Cognition, 22(1):1 -39.",
                "links": null
            },
            "BIBREF7": {
                "ref_id": "b7",
                "title": "Proceedings of CVPR",
                "authors": [
                    {
                        "first": "Abhishek",
                        "middle": [],
                        "last": "Das",
                        "suffix": ""
                    },
                    {
                        "first": "Satwik",
                        "middle": [],
                        "last": "Kottur",
                        "suffix": ""
                    },
                    {
                        "first": "Khushi",
                        "middle": [],
                        "last": "Gupta",
                        "suffix": ""
                    },
                    {
                        "first": "Avi",
                        "middle": [],
                        "last": "Singh",
                        "suffix": ""
                    },
                    {
                        "first": "Deshraj",
                        "middle": [],
                        "last": "Yadav",
                        "suffix": ""
                    },
                    {
                        "first": "M",
                        "middle": [
                            "F"
                        ],
                        "last": "José",
                        "suffix": ""
                    },
                    {
                        "first": "Devi",
                        "middle": [],
                        "last": "Moura",
                        "suffix": ""
                    },
                    {
                        "first": "Dhruv",
                        "middle": [],
                        "last": "Parikh",
                        "suffix": ""
                    },
                    {
                        "first": "",
                        "middle": [],
                        "last": "Batra",
                        "suffix": ""
                    }
                ],
                "year": 2017,
                "venue": "",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Abhishek Das, Satwik Kottur, Khushi Gupta, Avi Singh, Deshraj Yadav, José M.F. Moura, Devi Parikh, and Dhruv Batra. 2017. Visual Dialog. In Proceedings of CVPR.",
                "links": null
            },
            "BIBREF8": {
                "ref_id": "b8",
                "title": "2017a. Guesswhat?! visual object discovery through multi-modal dialogue",
                "authors": [
                    {
                        "first": "De",
                        "middle": [],
                        "last": "Harm",
                        "suffix": ""
                    },
                    {
                        "first": "Florian",
                        "middle": [],
                        "last": "Vries",
                        "suffix": ""
                    },
                    {
                        "first": "Sarath",
                        "middle": [],
                        "last": "Strub",
                        "suffix": ""
                    },
                    {
                        "first": "Olivier",
                        "middle": [],
                        "last": "Chandar",
                        "suffix": ""
                    },
                    {
                        "first": "Hugo",
                        "middle": [],
                        "last": "Pietquin",
                        "suffix": ""
                    },
                    {
                        "first": "Aaron",
                        "middle": [],
                        "last": "Larochelle",
                        "suffix": ""
                    },
                    {
                        "first": "",
                        "middle": [],
                        "last": "Courville",
                        "suffix": ""
                    }
                ],
                "year": null,
                "venue": "Proc. of CVPR",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Harm De Vries, Florian Strub, Sarath Chandar, Olivier Pietquin, Hugo Larochelle, and Aaron Courville. 2017a. Guesswhat?! visual object discovery through multi-modal dialogue. In Proc. of CVPR.",
                "links": null
            },
            "BIBREF9": {
                "ref_id": "b9",
                "title": "Modulating early visual processing by language",
                "authors": [
                    {
                        "first": "De",
                        "middle": [],
                        "last": "Harm",
                        "suffix": ""
                    },
                    {
                        "first": "Florian",
                        "middle": [],
                        "last": "Vries",
                        "suffix": ""
                    },
                    {
                        "first": "Jérémie",
                        "middle": [],
                        "last": "Strub",
                        "suffix": ""
                    },
                    {
                        "first": "Hugo",
                        "middle": [],
                        "last": "Mary",
                        "suffix": ""
                    },
                    {
                        "first": "Olivier",
                        "middle": [],
                        "last": "Larochelle",
                        "suffix": ""
                    },
                    {
                        "first": "Aaron",
                        "middle": [],
                        "last": "Pietquin",
                        "suffix": ""
                    },
                    {
                        "first": "",
                        "middle": [],
                        "last": "Courville",
                        "suffix": ""
                    }
                ],
                "year": 2017,
                "venue": "Proceedings of NIPS",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Harm De Vries, Florian Strub, Jérémie Mary, Hugo Larochelle, Olivier Pietquin, and Aaron Courville. 2017b. Modulating early visual processing by lan- guage. In Proceedings of NIPS.",
                "links": null
            },
            "BIBREF10": {
                "ref_id": "b10",
                "title": "ImageNet: A Large-Scale Hierarchical Image Database",
                "authors": [
                    {
                        "first": "Jia",
                        "middle": [],
                        "last": "Deng",
                        "suffix": ""
                    },
                    {
                        "first": "Wei",
                        "middle": [],
                        "last": "Dong",
                        "suffix": ""
                    },
                    {
                        "first": "Richard",
                        "middle": [],
                        "last": "Socher",
                        "suffix": ""
                    },
                    {
                        "first": "Li-Jia",
                        "middle": [],
                        "last": "Li",
                        "suffix": ""
                    },
                    {
                        "first": "Kai",
                        "middle": [],
                        "last": "Li",
                        "suffix": ""
                    },
                    {
                        "first": "Li",
                        "middle": [],
                        "last": "Fei-Fei",
                        "suffix": ""
                    }
                ],
                "year": 2009,
                "venue": "Proc. of CVPR",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Jia Deng, Wei Dong, Richard Socher, Li-Jia Li, Kai Li, and Li Fei-Fei. 2009. ImageNet: A Large-Scale Hierarchical Image Database. In Proc. of CVPR.",
                "links": null
            },
            "BIBREF11": {
                "ref_id": "b11",
                "title": "A Data-Driven Analysis of Workers' Earnings on Amazon Mechanical Turk",
                "authors": [
                    {
                        "first": "Kotaro",
                        "middle": [],
                        "last": "Hara",
                        "suffix": ""
                    },
                    {
                        "first": "Abigail",
                        "middle": [],
                        "last": "Adams",
                        "suffix": ""
                    },
                    {
                        "first": "Kristy",
                        "middle": [],
                        "last": "Milland",
                        "suffix": ""
                    },
                    {
                        "first": "Saiph",
                        "middle": [],
                        "last": "Savage",
                        "suffix": ""
                    },
                    {
                        "first": "Chris",
                        "middle": [],
                        "last": "Callison-Burch",
                        "suffix": ""
                    },
                    {
                        "first": "Jeffrey",
                        "middle": [
                            "P"
                        ],
                        "last": "Bigham",
                        "suffix": ""
                    }
                ],
                "year": 2018,
                "venue": "Proceedings of the Conference on Human Factors in Computing Systems",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Kotaro Hara, Abigail Adams, Kristy Milland, Saiph Savage, Chris Callison-Burch, and Jeffrey P Bigham. 2018. A Data-Driven Analysis of Workers' Earnings on Amazon Mechanical Turk. In Proceed- ings of the Conference on Human Factors in Com- puting Systems.",
                "links": null
            },
            "BIBREF12": {
                "ref_id": "b12",
                "title": "Learning symmetric collaborative dialogue agents with dynamic knowledge graph embeddings",
                "authors": [
                    {
                        "first": "He",
                        "middle": [],
                        "last": "He",
                        "suffix": ""
                    },
                    {
                        "first": "Anusha",
                        "middle": [],
                        "last": "Balakrishnan",
                        "suffix": ""
                    },
                    {
                        "first": "Mihail",
                        "middle": [],
                        "last": "Eric",
                        "suffix": ""
                    },
                    {
                        "first": "Percy",
                        "middle": [],
                        "last": "Liang",
                        "suffix": ""
                    }
                ],
                "year": 2017,
                "venue": "Proceedings of ACL",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "He He, Anusha Balakrishnan, Mihail Eric, and Percy Liang. 2017. Learning symmetric collaborative di- alogue agents with dynamic knowledge graph em- beddings. In Proceedings of ACL.",
                "links": null
            },
            "BIBREF13": {
                "ref_id": "b13",
                "title": "Deep residual learning for image recognition",
                "authors": [
                    {
                        "first": "Kaiming",
                        "middle": [],
                        "last": "He",
                        "suffix": ""
                    },
                    {
                        "first": "Xiangyu",
                        "middle": [],
                        "last": "Zhang",
                        "suffix": ""
                    },
                    {
                        "first": "Shaoqing",
                        "middle": [],
                        "last": "Ren",
                        "suffix": ""
                    },
                    {
                        "first": "Jian",
                        "middle": [],
                        "last": "Sun",
                        "suffix": ""
                    }
                ],
                "year": 2016,
                "venue": "Proceedings of CVPR",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Kaiming He, Xiangyu Zhang, Shaoqing Ren, and Jian Sun. 2016. Deep residual learning for image recog- nition. In Proceedings of CVPR.",
                "links": null
            },
            "BIBREF14": {
                "ref_id": "b14",
                "title": "Long short-term memory",
                "authors": [
                    {
                        "first": "Sepp",
                        "middle": [],
                        "last": "Hochreiter",
                        "suffix": ""
                    },
                    {
                        "first": "Jürgen",
                        "middle": [],
                        "last": "Schmidhuber",
                        "suffix": ""
                    }
                ],
                "year": 1997,
                "venue": "Neural Computation",
                "volume": "9",
                "issue": "8",
                "pages": "1735--1780",
                "other_ids": {
                    "DOI": [
                        "10.1162/neco.1997.9.8.1735"
                    ]
                },
                "num": null,
                "urls": [],
                "raw_text": "Sepp Hochreiter and Jürgen Schmidhuber. 1997. Long short-term memory. Neural Computation, 9(8):1735-1780.",
                "links": null
            },
            "BIBREF15": {
                "ref_id": "b15",
                "title": "The task matters: Comparing image captioning and task-based dialogical image description",
                "authors": [
                    {
                        "first": "Nikolai",
                        "middle": [],
                        "last": "Ilinykh",
                        "suffix": ""
                    },
                    {
                        "first": "Sina",
                        "middle": [],
                        "last": "Zarrieß",
                        "suffix": ""
                    },
                    {
                        "first": "David",
                        "middle": [],
                        "last": "Schlangen",
                        "suffix": ""
                    }
                ],
                "year": 2018,
                "venue": "Proceedings of INLG",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Nikolai Ilinykh, Sina Zarrieß, and David Schlangen. 2018. The task matters: Comparing image caption- ing and task-based dialogical image description. In Proceedings of INLG.",
                "links": null
            },
            "BIBREF16": {
                "ref_id": "b16",
                "title": "ReferIt Game: Referring to Objects in Photographs of Natural Scenes",
                "authors": [
                    {
                        "first": "Sahar",
                        "middle": [],
                        "last": "Kazemzadeh",
                        "suffix": ""
                    },
                    {
                        "first": "Vicente",
                        "middle": [],
                        "last": "Ordonez",
                        "suffix": ""
                    },
                    {
                        "first": "Mark",
                        "middle": [],
                        "last": "Matten",
                        "suffix": ""
                    },
                    {
                        "first": "Tamara",
                        "middle": [
                            "L"
                        ],
                        "last": "Berg",
                        "suffix": ""
                    }
                ],
                "year": 2014,
                "venue": "Proceedings of EMNLP",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Sahar Kazemzadeh, Vicente Ordonez, Mark Matten, and Tamara L. Berg. 2014. ReferIt Game: Refer- ring to Objects in Photographs of Natural Scenes. In Proceedings of EMNLP.",
                "links": null
            },
            "BIBREF17": {
                "ref_id": "b17",
                "title": "Adam: A method for stochastic optimization",
                "authors": [
                    {
                        "first": "P",
                        "middle": [],
                        "last": "Diederik",
                        "suffix": ""
                    },
                    {
                        "first": "Jimmy",
                        "middle": [],
                        "last": "Kingma",
                        "suffix": ""
                    },
                    {
                        "first": "",
                        "middle": [],
                        "last": "Ba",
                        "suffix": ""
                    }
                ],
                "year": 2014,
                "venue": "",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Diederik P. Kingma and Jimmy Ba. 2014. Adam: A method for stochastic optimization. CoRR, abs/1412.6980.",
                "links": null
            },
            "BIBREF18": {
                "ref_id": "b18",
                "title": "Changes in reference phrases as a function of frequency of usage in social interaction: a preliminary study",
                "authors": [
                    {
                        "first": "Robert",
                        "middle": [
                            "M"
                        ],
                        "last": "Krauss",
                        "suffix": ""
                    },
                    {
                        "first": "Sidney",
                        "middle": [],
                        "last": "Weinheimer",
                        "suffix": ""
                    }
                ],
                "year": 1964,
                "venue": "Psychonomic Science",
                "volume": "1",
                "issue": "1",
                "pages": "113--114",
                "other_ids": {
                    "DOI": [
                        "10.3758/BF03342817"
                    ]
                },
                "num": null,
                "urls": [],
                "raw_text": "Robert M. Krauss and Sidney Weinheimer. 1964. Changes in reference phrases as a function of fre- quency of usage in social interaction: a preliminary study. Psychonomic Science, 1(1):113-114.",
                "links": null
            },
            "BIBREF19": {
                "ref_id": "b19",
                "title": "Concurrent feedback, confirmation, and the encoding of referents in verbal communication",
                "authors": [
                    {
                        "first": "Robert",
                        "middle": [
                            "M"
                        ],
                        "last": "Krauss",
                        "suffix": ""
                    },
                    {
                        "first": "Sidney",
                        "middle": [],
                        "last": "Weinheimer",
                        "suffix": ""
                    }
                ],
                "year": 1966,
                "venue": "Journal of Personality and Social Psychology",
                "volume": "4",
                "issue": "3",
                "pages": "343--346",
                "other_ids": {
                    "DOI": [
                        "10.1037/h0023705"
                    ]
                },
                "num": null,
                "urls": [],
                "raw_text": "Robert M. Krauss and Sidney Weinheimer. 1966. Con- current feedback, confirmation, and the encoding of referents in verbal communication. Journal of Per- sonality and Social Psychology, 4(3):343-346.",
                "links": null
            },
            "BIBREF20": {
                "ref_id": "b20",
                "title": "Visual Genome: Connecting language and vision using crowdsourced dense image annotations",
                "authors": [
                    {
                        "first": "Ranjay",
                        "middle": [],
                        "last": "Krishna",
                        "suffix": ""
                    },
                    {
                        "first": "Yuke",
                        "middle": [],
                        "last": "Zhu",
                        "suffix": ""
                    },
                    {
                        "first": "Oliver",
                        "middle": [],
                        "last": "Groth",
                        "suffix": ""
                    },
                    {
                        "first": "Justin",
                        "middle": [],
                        "last": "Johnson",
                        "suffix": ""
                    },
                    {
                        "first": "Kenji",
                        "middle": [],
                        "last": "Hata",
                        "suffix": ""
                    },
                    {
                        "first": "Joshua",
                        "middle": [],
                        "last": "Kravitz",
                        "suffix": ""
                    },
                    {
                        "first": "Stephanie",
                        "middle": [],
                        "last": "Chen",
                        "suffix": ""
                    },
                    {
                        "first": "Yannis",
                        "middle": [],
                        "last": "Kalantidis",
                        "suffix": ""
                    },
                    {
                        "first": "Li-Jia",
                        "middle": [],
                        "last": "Li",
                        "suffix": ""
                    },
                    {
                        "first": "David",
                        "middle": [
                            "A"
                        ],
                        "last": "Shamma",
                        "suffix": ""
                    }
                ],
                "year": 2017,
                "venue": "International Journal of Computer Vision",
                "volume": "123",
                "issue": "1",
                "pages": "32--73",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Ranjay Krishna, Yuke Zhu, Oliver Groth, Justin John- son, Kenji Hata, Joshua Kravitz, Stephanie Chen, Yannis Kalantidis, Li-Jia Li, David A Shamma, et al. 2017. Visual Genome: Connecting language and vision using crowdsourced dense image anno- tations. International Journal of Computer Vision, 123(1):32-73.",
                "links": null
            },
            "BIBREF21": {
                "ref_id": "b21",
                "title": "A technique for the measurement of attitudes",
                "authors": [
                    {
                        "first": "Rensis",
                        "middle": [],
                        "last": "Likert",
                        "suffix": ""
                    }
                ],
                "year": 1932,
                "venue": "Archives of Psychology",
                "volume": "22",
                "issue": "",
                "pages": "55--55",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Rensis Likert. 1932. A technique for the measurement of attitudes. Archives of Psychology, 22 140:55-55.",
                "links": null
            },
            "BIBREF22": {
                "ref_id": "b22",
                "title": "Microsoft COCO: Common Objects in Context",
                "authors": [
                    {
                        "first": "Tsung-Yi",
                        "middle": [],
                        "last": "Lin",
                        "suffix": ""
                    },
                    {
                        "first": "Michael",
                        "middle": [],
                        "last": "Maire",
                        "suffix": ""
                    },
                    {
                        "first": "Serge",
                        "middle": [],
                        "last": "Belongie",
                        "suffix": ""
                    },
                    {
                        "first": "James",
                        "middle": [],
                        "last": "Hays",
                        "suffix": ""
                    },
                    {
                        "first": "Pietro",
                        "middle": [],
                        "last": "Perona",
                        "suffix": ""
                    },
                    {
                        "first": "Deva",
                        "middle": [],
                        "last": "Ramanan",
                        "suffix": ""
                    },
                    {
                        "first": "Piotr",
                        "middle": [],
                        "last": "Dollár",
                        "suffix": ""
                    },
                    {
                        "first": "C",
                        "middle": [
                            "Lawrence"
                        ],
                        "last": "Zitnick",
                        "suffix": ""
                    }
                ],
                "year": 2014,
                "venue": "Proc. of ECCV",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Tsung-Yi Lin, Michael Maire, Serge Belongie, James Hays, Pietro Perona, Deva Ramanan, Piotr Dollár, and C. Lawrence Zitnick. 2014. Microsoft COCO: Common Objects in Context. In Proc. of ECCV.",
                "links": null
            },
            "BIBREF23": {
                "ref_id": "b23",
                "title": "Generation and comprehension of unambiguous object descriptions",
                "authors": [
                    {
                        "first": "Junhua",
                        "middle": [],
                        "last": "Mao",
                        "suffix": ""
                    },
                    {
                        "first": "Jonathan",
                        "middle": [],
                        "last": "Huang",
                        "suffix": ""
                    },
                    {
                        "first": "Alexander",
                        "middle": [],
                        "last": "Toshev",
                        "suffix": ""
                    },
                    {
                        "first": "Oana",
                        "middle": [],
                        "last": "Camburu",
                        "suffix": ""
                    },
                    {
                        "first": "Alan",
                        "middle": [],
                        "last": "Yuille",
                        "suffix": ""
                    },
                    {
                        "first": "Kevin",
                        "middle": [],
                        "last": "Murphy",
                        "suffix": ""
                    }
                ],
                "year": 2016,
                "venue": "Proceedings of CVPR",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {
                    "DOI": [
                        "10.1109/CVPR.2016.9"
                    ]
                },
                "num": null,
                "urls": [],
                "raw_text": "Junhua Mao, Jonathan Huang, Alexander Toshev, Oana Camburu, Alan Yuille, and Kevin Murphy. 2016. Generation and comprehension of unambiguous ob- ject descriptions. In Proceedings of CVPR.",
                "links": null
            },
            "BIBREF24": {
                "ref_id": "b24",
                "title": "Distributed representations of words and phrases and their compositionality",
                "authors": [
                    {
                        "first": "Tomas",
                        "middle": [],
                        "last": "Mikolov",
                        "suffix": ""
                    },
                    {
                        "first": "Ilya",
                        "middle": [],
                        "last": "Sutskever",
                        "suffix": ""
                    },
                    {
                        "first": "Kai",
                        "middle": [],
                        "last": "Chen",
                        "suffix": ""
                    },
                    {
                        "first": "Greg",
                        "middle": [],
                        "last": "Corrado",
                        "suffix": ""
                    },
                    {
                        "first": "Jeffrey",
                        "middle": [],
                        "last": "Dean",
                        "suffix": ""
                    }
                ],
                "year": 2013,
                "venue": "Proceedings of NIPS",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Tomas Mikolov, Ilya Sutskever, Kai Chen, Greg Cor- rado, and Jeffrey Dean. 2013. Distributed represen- tations of words and phrases and their composition- ality. In Proceedings of NIPS.",
                "links": null
            },
            "BIBREF25": {
                "ref_id": "b25",
                "title": "ParlAI: A Dialog Research Software Platform",
                "authors": [
                    {
                        "first": "Alexander",
                        "middle": [],
                        "last": "Miller",
                        "suffix": ""
                    },
                    {
                        "first": "Will",
                        "middle": [],
                        "last": "Feng",
                        "suffix": ""
                    },
                    {
                        "first": "Dhruv",
                        "middle": [],
                        "last": "Batra",
                        "suffix": ""
                    },
                    {
                        "first": "Antoine",
                        "middle": [],
                        "last": "Bordes",
                        "suffix": ""
                    },
                    {
                        "first": "Adam",
                        "middle": [],
                        "last": "Fisch",
                        "suffix": ""
                    },
                    {
                        "first": "Jiasen",
                        "middle": [],
                        "last": "Lu",
                        "suffix": ""
                    },
                    {
                        "first": "Devi",
                        "middle": [],
                        "last": "Parikh",
                        "suffix": ""
                    },
                    {
                        "first": "Jason",
                        "middle": [],
                        "last": "Weston",
                        "suffix": ""
                    }
                ],
                "year": 2017,
                "venue": "Proceedings of EMNLP",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Alexander Miller, Will Feng, Dhruv Batra, Antoine Bordes, Adam Fisch, Jiasen Lu, Devi Parikh, and Ja- son Weston. 2017. ParlAI: A Dialog Research Soft- ware Platform. In Proceedings of EMNLP.",
                "links": null
            },
            "BIBREF26": {
                "ref_id": "b26",
                "title": "Flickr30k entities: Collecting region-to-phrase correspondences for richer imageto-sentence models",
                "authors": [
                    {
                        "first": "Liwei",
                        "middle": [],
                        "last": "Bryan A Plummer",
                        "suffix": ""
                    },
                    {
                        "first": "Chris",
                        "middle": [
                            "M"
                        ],
                        "last": "Wang",
                        "suffix": ""
                    },
                    {
                        "first": "Juan",
                        "middle": [
                            "C"
                        ],
                        "last": "Cervantes",
                        "suffix": ""
                    },
                    {
                        "first": "Julia",
                        "middle": [],
                        "last": "Caicedo",
                        "suffix": ""
                    },
                    {
                        "first": "Svetlana",
                        "middle": [],
                        "last": "Hockenmaier",
                        "suffix": ""
                    },
                    {
                        "first": "",
                        "middle": [],
                        "last": "Lazebnik",
                        "suffix": ""
                    }
                ],
                "year": 2015,
                "venue": "Proceedings of ICCV",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Bryan A Plummer, Liwei Wang, Chris M Cervantes, Juan C Caicedo, Julia Hockenmaier, and Svetlana Lazebnik. 2015. Flickr30k entities: Collecting region-to-phrase correspondences for richer image- to-sentence models. In Proceedings of ICCV.",
                "links": null
            },
            "BIBREF27": {
                "ref_id": "b27",
                "title": "Assertion",
                "authors": [
                    {
                        "first": "Robert",
                        "middle": [],
                        "last": "Stalnaker",
                        "suffix": ""
                    }
                ],
                "year": 1978,
                "venue": "Syntax and Semantics",
                "volume": "9",
                "issue": "",
                "pages": "315--332",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Robert Stalnaker. 1978. Assertion. In P. Cole, edi- tor, Pragmatics, volume 9 of Syntax and Semantics, pages 315-332. New York Academic Press.",
                "links": null
            },
            "BIBREF28": {
                "ref_id": "b28",
                "title": "The REX corpora: A collection of multimodal corpora of referring expressions in collaborative problem solving dialogues",
                "authors": [
                    {
                        "first": "Tokunaga",
                        "middle": [],
                        "last": "Takenobu",
                        "suffix": ""
                    },
                    {
                        "first": "Iida",
                        "middle": [],
                        "last": "Ryu",
                        "suffix": ""
                    },
                    {
                        "first": "Terai",
                        "middle": [],
                        "last": "Asuka",
                        "suffix": ""
                    },
                    {
                        "first": "Kuriyama",
                        "middle": [],
                        "last": "Naoko",
                        "suffix": ""
                    }
                ],
                "year": 2012,
                "venue": "Proceedings of LREC",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Tokunaga Takenobu, Iida Ryu, Terai Asuka, and Kuriyama Naoko. 2012. The REX corpora: A col- lection of multimodal corpora of referring expres- sions in collaborative problem solving dialogues. In Proceedings of LREC.",
                "links": null
            },
            "BIBREF29": {
                "ref_id": "b29",
                "title": "Context-aware captions from context-agnostic supervision",
                "authors": [
                    {
                        "first": "Ramakrishna",
                        "middle": [],
                        "last": "Vedantam",
                        "suffix": ""
                    },
                    {
                        "first": "Samy",
                        "middle": [],
                        "last": "Bengio",
                        "suffix": ""
                    },
                    {
                        "first": "Kevin",
                        "middle": [],
                        "last": "Murphy",
                        "suffix": ""
                    },
                    {
                        "first": "Devi",
                        "middle": [],
                        "last": "Parikh",
                        "suffix": ""
                    },
                    {
                        "first": "Gal",
                        "middle": [],
                        "last": "Chechik",
                        "suffix": ""
                    }
                ],
                "year": 2017,
                "venue": "Proceedings of CVPR",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {
                    "DOI": [
                        "10.1109/CVPR.2017.120"
                    ]
                },
                "num": null,
                "urls": [],
                "raw_text": "Ramakrishna Vedantam, Samy Bengio, Kevin Murphy, Devi Parikh, and Gal Chechik. 2017. Context-aware captions from context-agnostic supervision. In Pro- ceedings of CVPR.",
                "links": null
            },
            "BIBREF30": {
                "ref_id": "b30",
                "title": "Referring expressions in English and Japanese: patterns of use in dialogue processing",
                "authors": [
                    {
                        "first": "Etsuko",
                        "middle": [],
                        "last": "Yoshida",
                        "suffix": ""
                    }
                ],
                "year": 2011,
                "venue": "",
                "volume": "208",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Etsuko Yoshida. 2011. Referring expressions in En- glish and Japanese: patterns of use in dialogue pro- cessing, volume 208. John Benjamins Publishing.",
                "links": null
            },
            "BIBREF31": {
                "ref_id": "b31",
                "title": "PentoRef: A Corpus of Spoken References in Task-oriented Dialogues",
                "authors": [
                    {
                        "first": "Sina",
                        "middle": [],
                        "last": "Zarrieß",
                        "suffix": ""
                    },
                    {
                        "first": "Julian",
                        "middle": [],
                        "last": "Hough",
                        "suffix": ""
                    },
                    {
                        "first": "Casey",
                        "middle": [],
                        "last": "Kennington",
                        "suffix": ""
                    },
                    {
                        "first": "Ramesh",
                        "middle": [],
                        "last": "Manuvinakurike",
                        "suffix": ""
                    },
                    {
                        "first": "David",
                        "middle": [],
                        "last": "Devault",
                        "suffix": ""
                    },
                    {
                        "first": "Raquel",
                        "middle": [],
                        "last": "Fernández",
                        "suffix": ""
                    },
                    {
                        "first": "David",
                        "middle": [],
                        "last": "Schlangen",
                        "suffix": ""
                    }
                ],
                "year": 2016,
                "venue": "Proceedings of LREC",
                "volume": "",
                "issue": "",
                "pages": "",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Sina Zarrieß, Julian Hough, Casey Kennington, Ramesh Manuvinakurike, David DeVault, Raquel Fernández, and David Schlangen. 2016. PentoRef: A Corpus of Spoken References in Task-oriented Di- alogues. In Proceedings of LREC.",
                "links": null
            }
        },
        "ref_entries": {
            "FIGREF0": {
                "num": null,
                "text": "Figure 1: Screenshot of the Amazon Mechanical Turk user interface designed to collect the PhotoBook dataset.",
                "uris": null,
                "fig_num": "1",
                "type_str": "figure"
            },
            "FIGREF1": {
                "num": null,
                "text": "Figure 2: (a) Average completion times (solid blue) and scores (dashed red) per game round. (b) Ratio of content tokens over total token count per round with best linear fit. (c) Ratio of new content tokens over total content token count per round. (d) Relative change in distribution of main content POS between the first and last game round.",
                "uris": null,
                "fig_num": "2",
                "type_str": "figure"
            },
            "FIGREF2": {
                "num": null,
                "text": "people with bikes next to a train both wearing the same helmet?",
                "uris": null,
                "fig_num": null,
                "type_str": "figure"
            },
            "FIGREF3": {
                "num": null,
                "text": "Figure 4: Precision and recall (y axis) for target images, given the position of the segment in a reference chain (x axis).",
                "uris": null,
                "fig_num": "4",
                "type_str": "figure"
            },
            "FIGREF4": {
                "num": null,
                "text": "Figure 5: Reference chain for each of the two displayed images. The dialogue segments in the chains are slightly simplified for space reasons. Left: Both the HISTORY and the NO-HISTORY models succeed at identifying this image as the target of the segment to be resolved. Right: The NO-HISTORY model fails to recognise this image as the target of the segment to be resolved, while the HISTORY model succeeds. The distractor images for these two examples are available in Appendix E.",
                "uris": null,
                "fig_num": "5",
                "type_str": "figure"
            },
            "FIGREF5": {
                "num": null,
                "text": "Figure 6: Screenshot of the PhotoBook task AMT HIT details shown to a participant.",
                "uris": null,
                "fig_num": "6",
                "type_str": "figure"
            },
            "FIGREF6": {
                "num": null,
                "text": "Figure 7: Screenshot of the PhotoBook task AMT HIT preview page.",
                "uris": null,
                "fig_num": "7",
                "type_str": "figure"
            },
            "FIGREF7": {
                "num": null,
                "text": "Do you have someone on a big motorcycle and their head isn't visible?A: There is a blue car in the background B: No A: In any of the pictures? B: No A: Okay, thank you",
                "uris": null,
                "fig_num": null,
                "type_str": "figure"
            },
            "FIGREF8": {
                "num": null,
                "text": "(a) Screenshot of the PhotoBook task's display for one of the participants during the warming-up round. (b) Example screenshot of the PhotoBook AMT feedback display.",
                "uris": null,
                "fig_num": null,
                "type_str": "figure"
            },
            "FIGREF9": {
                "num": null,
                "text": "Figure 8: Example screenshots for a participant's display during the warming-up round and feedback screen.",
                "uris": null,
                "fig_num": "8",
                "type_str": "figure"
            },
            "FIGREF10": {
                "num": null,
                "text": "Do you have a boy with a teal coloured shirt with yellow holding a bear with a red shirt? B: Yes -B: Boy with teal shirt and bear with red shirt? A: Yes! -A: Teal shirt boy? B: No Collecting all utterances that refer to a specific target image during a given game creates its coreference chain. Consider the following examples of first (F) and last (L) referring expressions from co-reference chains manually extracted from the PhotoBook dataset: F: Two girls near TV playing wii One in white shirt, one in grey L: Girls in white and grey F: A person that looks like a monk sitting on a bench He's wearing a blue and white ball cap L: The monk F: A white, yellow, and blue bus being towed by a blue tow truck L: Yellow/white bus being towed by blue",
                "uris": null,
                "fig_num": null,
                "type_str": "figure"
            },
            "FIGREF11": {
                "num": null,
                "text": "2. the previous turn was an image labelling action, 3. the previous turn was by the other participant, 4. the next turn is an image selection action, 5. the next turn is by the current participant, 6. the next labelling action assigns a common label, 7. the other participant's previous labelling and the current participant's next labelling address the same target image, and 8",
                "uris": null,
                "fig_num": null,
                "type_str": "figure"
            },
            "FIGREF12": {
                "num": null,
                "text": "Figure 9: Sample image MS COCO #449904.",
                "uris": null,
                "fig_num": "9",
                "type_str": "figure"
            },
            "TABREF0": {
                "content": "<table><tr><td colspan=\"4\">To quantify the effect of referring expression re-</td></tr><tr><td colspan=\"4\">finement, we compare participants' first and last</td></tr><tr><td colspan=\"4\">descriptions to a given target image with the im-</td></tr><tr><td colspan=\"4\">age's captions provided in the MS COCO dataset.</td></tr><tr><td colspan=\"4\">For this purpose we manually annotated the first</td></tr><tr><td colspan=\"4\">and last expressions referring to a set of six tar-</td></tr><tr><td colspan=\"4\">get images across ten random games in the Photo-</td></tr><tr><td colspan=\"4\">Book dataset. Several examples are provided in</td></tr><tr><td colspan=\"4\">Appendix C. Table 1 shows their differences in</td></tr><tr><td colspan=\"4\">token count before and after filtering for content</td></tr><tr><td colspan=\"3\">words with the NLTK stopword list.</td><td/></tr><tr><td>Source</td><td colspan=\"3\"># Tokens # Content Distance</td></tr><tr><td>COCO captions</td><td>11.167</td><td>5.255</td><td>-</td></tr><tr><td>First description</td><td>9.963</td><td>5.185</td><td>0.091</td></tr><tr><td>Last description</td><td>5.685</td><td>5.128</td><td>0.156</td></tr></table>",
                "type_str": "table",
                "text": "The following excerpt displays such a coreference chain extracted from the PhotoBook dataset:1. A: Do you have a boy with a teal coloured shirt with yellow holding a bear with a red shirt?2. B: Boy with teal shirt and bear with red shirt? 3. A: Teal shirt boy?",
                "html": null,
                "num": null
            },
            "TABREF1": {
                "content": "<table><tr><td colspan=\"5\">Split Chains Segments Targets Non-Targets</td></tr><tr><td colspan=\"2\">Train 12,694</td><td>30,992</td><td>40,898</td><td>226,993</td></tr><tr><td>Val</td><td>2,811</td><td>6,801</td><td>9,070</td><td>50,383</td></tr><tr><td>Test</td><td>2,816</td><td>6,876</td><td>9,025</td><td>49,774</td></tr></table>",
                "type_str": "table",
                "text": "",
                "html": null,
                "num": null
            },
            "TABREF2": {
                "content": "<table><tr><td/><td colspan=\"2\">Precision Recall</td><td>F1</td></tr><tr><td>Random baseline</td><td>15.34</td><td colspan=\"2\">49.95 23.47</td></tr><tr><td>NO-HISTORY</td><td>56.65</td><td colspan=\"2\">75.86 64.86</td></tr><tr><td>HISTORY</td><td>56.66</td><td colspan=\"2\">77.41 65.43</td></tr><tr><td>HISTORY /No image</td><td>35.66</td><td colspan=\"2\">63.18 45.59</td></tr></table>",
                "type_str": "table",
                "text": "Results for the target images in the test set.",
                "html": null,
                "num": null
            },
            "TABREF3": {
                "content": "<table/>",
                "type_str": "table",
                "text": "Schema of referent image highlighting in the PhotoBook task. The left part of the table indicates whether a given image is highlighted for one of the two participants (A and B) in a given game round in either game 1 or 2. T indicates the total count of highlights (which is 5 always), H counts the highlights per game and R the number of rounds that an image is highlighted in.",
                "html": null,
                "num": null
            },
            "TABREF4": {
                "content": "<table><tr><td>B: Hello</td></tr><tr><td>A: Hi</td></tr><tr><td>A: Do you have a woman with a black</td></tr><tr><td>coat with buttons, glasses and a piece</td></tr><tr><td>of pizza on table</td></tr><tr><td>B: no</td></tr></table>",
                "type_str": "table",
                "text": ":",
                "html": null,
                "num": null
            },
            "TABREF5": {
                "content": "<table/>",
                "type_str": "table",
                "text": "Lady with black shirt, glasses with pizza on table?",
                "html": null,
                "num": null
            },
            "TABREF6": {
                "content": "<table/>",
                "type_str": "table",
                "text": "Table with orange bowl with lemons and liquor, cups?",
                "html": null,
                "num": null
            },
            "TABREF7": {
                "content": "<table><tr><td>Model</td><td colspan=\"2\">Precision Recall</td><td>F1</td></tr><tr><td>NO HISTORY</td><td>56.37</td><td colspan=\"2\">75.91 64.70</td></tr><tr><td>HISTORY</td><td>56.32</td><td colspan=\"2\">78.10 65.45</td></tr><tr><td>NO IMAGE</td><td>34.61</td><td colspan=\"2\">62.49 44.55</td></tr></table>",
                "type_str": "table",
                "text": "Results for target images in the validation set.",
                "html": null,
                "num": null
            }
        }
    }
}